eShips = { }
eFleets = { }

----------------------------------------------------------------

eShips['20000001'] = { title='驱逐Α级Ⅰ型', rarity=1, lv=1, type='驱逐', rec=3, speed=35, air=0, }
eShips['20000002'] = { title='驱逐Α级Ⅱ型', rarity=3, lv=17, type='驱逐', rec=6, speed=40, air=0, }
eShips['20000003'] = { title='驱逐Α级Ⅲ型', rarity=5, lv=53, type='驱逐', rec=20, speed=45, air=0, }
eShips['20000004'] = { title='驱逐Α级Ⅳ型', rarity=6, lv=77, type='驱逐', rec=28, speed=45, air=0, }
eShips['20000005'] = { title='驱逐Δ级Ⅰ型', rarity=1, lv=3, type='驱逐', rec=4, speed=35, air=0, }
eShips['20000006'] = { title='驱逐Δ级Ⅱ型', rarity=3, lv=29, type='驱逐', rec=7, speed=40, air=0, }
eShips['20000007'] = { title='驱逐Δ级Ⅲ型', rarity=5, lv=59, type='驱逐', rec=10, speed=45, air=0, }
eShips['20000008'] = { title='驱逐Γ级Ⅰ型', rarity=1, lv=1, type='驱逐', rec=4, speed=35, air=0, }
eShips['20000009'] = { title='驱逐Γ级Ⅱ型', rarity=3, lv=23, type='驱逐', rec=7, speed=40, air=0, }
eShips['20000010'] = { title='驱逐Γ级Ⅲ型', rarity=5, lv=46, type='驱逐', rec=12, speed=45, air=0, }
eShips['20000011'] = { title='驱逐Γ级Ⅳ型', rarity=6, lv=65, type='驱逐', rec=15, speed=45, air=0, }
eShips['20000012'] = { title='驱逐Β级Ⅰ型', rarity=1, lv=1, type='驱逐', rec=3, speed=35, air=0, }
eShips['20000013'] = { title='驱逐Β级Ⅱ型', rarity=3, lv=17, type='驱逐', rec=6, speed=40, air=0, }
eShips['20000014'] = { title='驱逐Β级Ⅲ型', rarity=5, lv=44, type='驱逐', rec=10, speed=45, air=0, }
eShips['20000015'] = { title='驱逐Β级Ⅳ型', rarity=6, lv=67, type='驱逐', rec=12, speed=45, air=0, }
eShips['20000016'] = { title='航母Ο级Ⅰ型', rarity=1, lv=3, type='航母', rec=45, speed=25, air=4.969813299576001, }
eShips['20000017'] = { title='航母Ο级Ⅱ型', rarity=3, lv=22, type='航母', rec=55, speed=30, air=13.862943611198906, }
eShips['20000018'] = { title='航母Ο级Ⅲ型', rarity=5, lv=47, type='航母', rec=55, speed=35, air=15.45521226679158, }
eShips['20000019'] = { title='航母Ο级Ⅳ型', rarity=6, lv=71, type='航母', rec=65, speed=35, air=29.989840591576833, }
eShips['20000020'] = { title='轻巡Η级Ⅰ型', rarity=1, lv=1, type='轻巡', rec=11, speed=30, air=0, }
eShips['20000021'] = { title='轻巡Η级Ⅱ型', rarity=3, lv=21, type='轻巡', rec=11, speed=33, air=0, }
eShips['20000022'] = { title='轻巡Η级Ⅲ型', rarity=5, lv=41, type='轻巡', rec=11, speed=36, air=0, }
eShips['20000023'] = { title='轻巡Ζ级Ⅰ型', rarity=1, lv=1, type='轻巡', rec=11, speed=30, air=0, }
eShips['20000024'] = { title='轻巡Ζ级Ⅱ型', rarity=3, lv=17, type='轻巡', rec=11, speed=33, air=0, }
eShips['20000025'] = { title='轻巡Ζ级Ⅲ型', rarity=5, lv=47, type='轻巡', rec=29, speed=36, air=0, }
eShips['20000026'] = { title='轻巡Ζ级Ⅳ型', rarity=6, lv=65, type='轻巡', rec=45, speed=36, air=0, }
eShips['20000027'] = { title='轻巡Ε级Ⅰ型', rarity=1, lv=2, type='轻巡', rec=11, speed=30, air=0, }
eShips['20000028'] = { title='轻巡Ε级Ⅱ型', rarity=3, lv=16, type='轻巡', rec=11, speed=33, air=0, }
eShips['20000029'] = { title='轻巡Ε级Ⅲ型', rarity=5, lv=33, type='轻巡', rec=20, speed=36, air=0, }
eShips['20000030'] = { title='轻巡Ε级Ⅳ型', rarity=6, lv=73, type='轻巡', rec=34, speed=36, air=0, }
eShips['20000031'] = { title='轻母Ξ级Ⅰ型', rarity=1, lv=4, type='轻母', rec=35, speed=25, air=4.605170185988092, }
eShips['20000032'] = { title='轻母Ξ级Ⅱ型', rarity=3, lv=23, type='轻母', rec=35, speed=30, air=12.424533248940001, }
eShips['20000033'] = { title='轻母Ξ级Ⅲ型', rarity=5, lv=41, type='轻母', rec=45, speed=35, air=14.451858789480823, }
eShips['20000034'] = { title='轻母Ξ级Ⅳ型', rarity=6, lv=64, type='轻母', rec=55, speed=40, air=27.819382080224845, }
eShips['20000035'] = { title='重巡Ι级Ⅰ型', rarity=1, lv=3, type='重巡', rec=15, speed=25, air=0, }
eShips['20000036'] = { title='重巡Ι级Ⅱ型', rarity=3, lv=21, type='重巡', rec=25, speed=30, air=0, }
eShips['20000037'] = { title='重巡Ι级Ⅲ型', rarity=5, lv=51, type='重巡', rec=25, speed=35, air=0, }
eShips['20000038'] = { title='重巡Ι级Ⅳ型', rarity=6, lv=84, type='重巡', rec=40, speed=35, air=0, }
eShips['20000039'] = { title='战列Μ级Ⅰ型', rarity=1, lv=8, type='战列', rec=30, speed=27, air=0, }
eShips['20000040'] = { title='战列Μ级Ⅱ型', rarity=3, lv=33, type='战列', rec=30, speed=30, air=0, }
eShips['20000041'] = { title='战列Μ级Ⅲ型', rarity=5, lv=61, type='战列', rec=40, speed=33, air=0, }
eShips['20000042'] = { title='战列Μ级Ⅳ型', rarity=6, lv=77, type='战列', rec=45, speed=36, air=0, }
eShips['20000043'] = { title='战列Λ级Ⅰ型', rarity=1, lv=1, type='战列', rec=25, speed=18, air=0, }
eShips['20000044'] = { title='战列Λ级Ⅱ型', rarity=3, lv=21, type='战列', rec=20, speed=21, air=0, }
eShips['20000045'] = { title='战列Λ级Ⅲ型', rarity=5, lv=41, type='战列', rec=35, speed=24, air=0, }
eShips['20000046'] = { title='战列Λ级Ⅳ型', rarity=6, lv=98, type='战列', rec=56, speed=24, air=0, }
eShips['20000047'] = { title='旗舰Ν级Ⅰ型', rarity=4, lv=101, type='旗舰', rec=50, speed=30, air=27.2095790533, }
eShips['20000048'] = { title='旗舰Ν级Ⅱ型', rarity=5, lv=148, type='旗舰', rec=70, speed=33, air=29.1006892778, }
eShips['20000049'] = { title='旗舰Ν级Ⅲ型', rarity=6, lv=196, type='旗舰', rec=90, speed=36, air=29.9013569463, }
eShips['20000050'] = { title='潜艇Π级Ⅰ型', rarity=1, lv=1, type='潜艇', rec=6, speed=15, air=0, }
eShips['20000051'] = { title='潜艇Π级Ⅱ型', rarity=3, lv=17, type='潜艇', rec=8, speed=20, air=0, }
eShips['20000052'] = { title='潜艇Π级Ⅲ型', rarity=5, lv=35, type='潜艇', rec=10, speed=25, air=0, }
eShips['20000053'] = { title='潜艇Π级Ⅳ型', rarity=6, lv=53, type='潜艇', rec=12, speed=25, air=0, }
eShips['20000054'] = { title='潜艇Σ级Ⅰ型', rarity=1, lv=9, type='潜艇', rec=10, speed=15, air=0, }
eShips['20000055'] = { title='潜艇Σ级Ⅱ型', rarity=3, lv=36, type='潜艇', rec=15, speed=20, air=0, }
eShips['20000056'] = { title='潜艇Σ级Ⅲ型', rarity=5, lv=64, type='潜艇', rec=20, speed=25, air=0, }
eShips['20000057'] = { title='潜艇Ρ级Ⅰ型', rarity=1, lv=14, type='潜艇', rec=7, speed=15, air=0, }
eShips['20000058'] = { title='潜艇Ρ级Ⅱ型', rarity=3, lv=45, type='潜艇', rec=9, speed=20, air=0, }
eShips['20000059'] = { title='潜艇Ρ级Ⅲ型', rarity=5, lv=64, type='潜艇', rec=10, speed=25, air=0, }
eShips['20000060'] = { title='潜艇Ρ级Ⅳ型', rarity=6, lv=80, type='潜艇', rec=11, speed=25, air=0, }
eShips['20000061'] = { title='雷巡Θ级Ⅰ型', rarity=1, lv=9, type='雷巡', rec=4, speed=30, air=0, }
eShips['20000062'] = { title='雷巡Θ级Ⅱ型', rarity=3, lv=35, type='雷巡', rec=10, speed=35, air=0, }
eShips['20000063'] = { title='雷巡Θ级Ⅲ型', rarity=5, lv=61, type='雷巡', rec=15, speed=40, air=0, }
eShips['20000064'] = { title='雷巡Θ级Ⅳ型', rarity=6, lv=79, type='雷巡', rec=20, speed=40, air=0, }
eShips['20000065'] = { title='战巡Κ级Ⅰ型', rarity=1, lv=15, type='战巡', rec=15, speed=27, air=0, }
eShips['20000066'] = { title='战巡Κ级Ⅱ型', rarity=3, lv=32, type='战巡', rec=15, speed=30, air=0, }
eShips['20000067'] = { title='战巡Κ级Ⅲ型', rarity=5, lv=59, type='战巡', rec=25, speed=33, air=0, }
eShips['20000068'] = { title='战巡Κ级Ⅳ型', rarity=6, lv=85, type='战巡', rec=40, speed=33, air=0, }
eShips['20000069'] = { title='补给Υ级Ⅰ型', rarity=1, lv=1, type='补给', rec=5, speed=25, air=0, }
eShips['20000070'] = { title='补给Υ级Ⅱ型', rarity=3, lv=20, type='补给', rec=10, speed=30, air=0, }
eShips['20000071'] = { title='补给Υ级Ⅲ型', rarity=5, lv=40, type='补给', rec=15, speed=35, air=0, }
eShips['20000072'] = { title='补给Υ级Ⅳ型', rarity=6, lv=66, type='补给', rec=20, speed=35, air=0, }
eShips['20000073'] = { title='驱逐Τ级Ⅰ型', rarity=3, lv=41, type='驱逐', rec=8, speed=35, air=0, }
eShips['20000074'] = { title='驱逐Τ级Ⅱ型', rarity=4, lv=59, type='驱逐', rec=16, speed=35, air=0, }
eShips['20000075'] = { title='驱逐Τ级Ⅲ型', rarity=5, lv=77, type='驱逐', rec=35, speed=35, air=0, }
eShips['20000076'] = { title='驱逐Τ级Ⅳ型', rarity=6, lv=89, type='驱逐', rec=42, speed=35, air=0, }
eShips['20000077'] = { title='潜艇Φ级Ⅰ型', rarity=3, lv=42, type='潜艇', rec=10, speed=18, air=0, }
eShips['20000078'] = { title='潜艇Φ级Ⅱ型', rarity=4, lv=61, type='潜艇', rec=10, speed=20, air=0, }
eShips['20000079'] = { title='潜艇Φ级Ⅲ型', rarity=5, lv=75, type='潜艇', rec=12, speed=22, air=0, }
eShips['20000080'] = { title='潜艇Φ级Ⅳ型', rarity=6, lv=89, type='潜艇', rec=15, speed=25, air=0, }
eShips['20000081'] = { title='航母Χ级Ⅰ型', rarity=3, lv=20, type='航母', rec=40, speed=32, air=14.978661367769954, }
eShips['20000082'] = { title='航母Χ级Ⅱ型', rarity=4, lv=36, type='航母', rec=50, speed=32, air=15.45521226679158, }
eShips['20000083'] = { title='航母Χ级Ⅲ型', rarity=5, lv=61, type='航母', rec=55, speed=32, air=31.780538303479457, }
eShips['20000084'] = { title='航母Χ级Ⅳ型', rarity=6, lv=76, type='航母', rec=60, speed=32, air=46.65086314245285, }
eShips['20000085'] = { title='战列Ψ级Ⅰ型', rarity=3, lv=42, type='战列', rec=30, speed=30, air=0, }
eShips['20000086'] = { title='战列Ψ级Ⅱ型', rarity=4, lv=59, type='战列', rec=35, speed=33, air=0, }
eShips['20000087'] = { title='战列Ψ级Ⅲ型', rarity=5, lv=77, type='战列', rec=45, speed=36, air=0, }
eShips['20000088'] = { title='战列Ψ级Ⅳ型', rarity=6, lv=92, type='战列', rec=50, speed=40, air=0, }
eShips['20000089'] = { title='重巡Ω级Ⅰ型', rarity=3, lv=41, type='重巡', rec=20, speed=30, air=0, }
eShips['20000090'] = { title='重巡Ω级Ⅱ型', rarity=4, lv=54, type='重巡', rec=25, speed=30, air=0, }
eShips['20000091'] = { title='重巡Ω级Ⅲ型', rarity=5, lv=72, type='重巡', rec=30, speed=35, air=0, }
eShips['20000092'] = { title='重巡Ω级Ⅳ型', rarity=6, lv=86, type='重巡', rec=35, speed=35, air=0, }
eShips['20000093'] = { title='轻巡ei级Ⅰ型', rarity=3, lv=42, type='轻巡', rec=41, speed=30, air=0, }
eShips['20000094'] = { title='轻巡ei级Ⅱ型', rarity=4, lv=63, type='轻巡', rec=49, speed=30, air=0, }
eShips['20000095'] = { title='轻巡ei级Ⅲ型', rarity=5, lv=73, type='轻巡', rec=52, speed=36, air=0, }
eShips['20000096'] = { title='轻巡ei级Ⅳ型', rarity=6, lv=85, type='轻巡', rec=62, speed=36, air=0, }
eShips['20000100'] = { title='导驱au级Ⅰ型', rarity=3, lv=40, type='导驱', rec=20, speed=35, air=0, }
eShips['20000101'] = { title='导驱au级Ⅱ型', rarity=4, lv=60, type='导驱', rec=30, speed=35, air=0, }
eShips['20000102'] = { title='导驱au级Ⅲ型', rarity=5, lv=75, type='导驱', rec=35, speed=35, air=0, }
eShips['20000103'] = { title='导驱au级Ⅳ型', rarity=6, lv=85, type='导驱', rec=40, speed=35, air=0, }
eShips['20000200'] = { title='防驱be级Ⅰ型', rarity=3, lv=40, type='防驱', rec=20, speed=35, air=0, }
eShips['20000201'] = { title='防驱be级Ⅱ型', rarity=4, lv=60, type='防驱', rec=30, speed=35, air=0, }
eShips['20000202'] = { title='防驱be级Ⅲ型', rarity=5, lv=75, type='防驱', rec=35, speed=35, air=0, }
eShips['20000203'] = { title='防驱be级Ⅳ型', rarity=6, lv=85, type='防驱', rec=40, speed=35, air=0, }
eShips['20000205'] = { title='大巡ce级Ⅱ型', rarity=4, lv=60, type='大巡', rec=15, speed=30, air=0, }
eShips['20000206'] = { title='大巡ce级Ⅲ型', rarity=5, lv=75, type='大巡', rec=20, speed=33, air=0, }
eShips['20000207'] = { title='大巡ce级Ⅳ型', rarity=5, lv=90, type='大巡', rec=30, speed=33, air=0, }
eShips['20000208'] = { title='导战de级Ⅰ型', rarity=4, lv=40, type='导战', rec=30, speed=30, air=0, }
eShips['20000209'] = { title='导战de级Ⅱ型', rarity=4, lv=60, type='导战', rec=35, speed=33, air=0, }
eShips['20000210'] = { title='导战de级Ⅲ型', rarity=5, lv=75, type='导战', rec=40, speed=36, air=0, }
eShips['20000211'] = { title='导战de级Ⅳ型', rarity=5, lv=90, type='导战', rec=45, speed=40, air=0, }
eShips['20100001'] = { title='补给Sükhbaatar', rarity=5, lv=1, type='补给', rec=10, speed=10, air=0, }
eShips['20100002'] = { title='航战(′?ω?｀)', rarity=6, lv=100, type='航战', rec=1004, speed=45, air=98.78109296453569, }
eShips['20100003'] = { title='迷路的运输舰', rarity=5, lv=1, type='补给', rec=15, speed=15, air=0, }
eShips['20100004'] = { title='补给Odin', rarity=5, lv=1, type='补给', rec=10, speed=10, air=0, }
eShips['20100005'] = { title='航战(′???｀)', rarity=6, lv=100, type='航战', rec=1004, speed=45, air=98.78109296453569, }
eShips['20100016'] = { title='补给Vestal', rarity=5, lv=1, type='补给', rec=10, speed=10, air=0, }
eShips['20100018'] = { title='航战( *^▽^* )', rarity=6, lv=100, type='航战', rec=1004, speed=45, air=98.78109296453569, }
eShips['29016109'] = { title='旗舰Zeppelin', rarity=6, lv=101, type='旗舰', rec=50, speed=30, air=29.1006892778, }
eShips['29016110'] = { title='战巡Scharnhorst', rarity=6, lv=101, type='战巡', rec=50, speed=33, air=0, }
eShips['29016111'] = { title='战巡Gneisenau', rarity=6, lv=101, type='战巡', rec=50, speed=33, air=0, }
eShips['29016112'] = { title='轻巡Dresden', rarity=6, lv=101, type='轻巡', rec=62, speed=35, air=0, }
eShips['29016113'] = { title='轻巡Leipzig', rarity=6, lv=101, type='轻巡', rec=62, speed=35, air=0, }
eShips['29016114'] = { title='轻巡Emden', rarity=6, lv=101, type='轻巡', rec=62, speed=35, air=0, }
eShips['29019902'] = { title='要塞Sub-A', rarity=5, lv=100, type='要塞', rec=63, speed=1, air=45.06, }
eShips['22010501'] = { title='战列Yamato', rarity=5, lv=73, type='战列', rec=35, speed=36, air=0, }
eShips['28010405'] = { title='雷巡Dimonno Vaalmonica', rarity=5, lv=233, type='雷巡', rec=30, speed=30, air=0, }
eShips['28010404'] = { title='战列GoldenCatCat', rarity=5, lv=233, type='战列', rec=40, speed=20, air=0, }


eFleets['1-1/'] = { }

eFleets['1-1/A'] = { }
eFleets['1-1/A'][1] = { formation='单纵', eShips={'20000001'} }
eFleets['1-1/A'][2] = { formation='单纵', eShips={'20000001'} }
eFleets['1-1/A'][3] = { formation='单纵', eShips={'20000027'} }

eFleets['1-1/B'] = { }
eFleets['1-1/B'][1] = { formation='单纵', eShips={'20000012', '20000001', '20000001'} }
eFleets['1-1/B'][2] = { formation='单纵', eShips={'20000027', '20000027', '20000001'} }
eFleets['1-1/B'][3] = { formation='单纵', eShips={'20000027', '20000027', '20000027', '20000001'} }

eFleets['1-1/C'] = { }
eFleets['1-1/C'][1] = { formation='单纵', eShips={'20000001', '20000001'} }
eFleets['1-1/C'][2] = { formation='单纵', eShips={'20000001', '20000001', '20000001'} }
eFleets['1-1/C'][3] = { formation='单纵', eShips={'20000027', '20000027', '20000001'} }

eFleets['1-2/'] = { }

eFleets['1-2/A'] = { }
eFleets['1-2/A'][1] = { formation='单纵', eShips={'20000008', '20000001'} }
eFleets['1-2/A'][2] = { formation='单纵', eShips={'20000008', '20000001'} }
eFleets['1-2/A'][3] = { formation='单纵', eShips={'20000027', '20000027'} }

eFleets['1-2/B'] = { }
eFleets['1-2/B'][1] = { formation='单纵', eShips={'20000008', '20000001'} }
eFleets['1-2/B'][2] = { formation='单纵', eShips={'20000008', '20000001'} }
eFleets['1-2/B'][3] = { formation='单纵', eShips={'20000027', '20000027'} }

eFleets['1-2/C'] = { }
eFleets['1-2/C'][1] = { formation='单纵', eShips={'20000023', '20000027', '20000012', '20000012'} }
eFleets['1-2/C'][2] = { formation='单纵', eShips={'20000035', '20000027', '20000027', '20000012'} }
eFleets['1-2/C'][3] = { formation='单纵', eShips={'20000023', '20000027', '20000027', '20000008', '20000012'} }

eFleets['1-2/D'] = { }
eFleets['1-2/D'][1] = { formation='单纵', eShips={'20000005', '20000008', '20000001', '20000001'} }
eFleets['1-2/D'][2] = { formation='单纵', eShips={'20000005', '20000008', '20000001', '20000001'} }
eFleets['1-2/D'][3] = { formation='单纵', eShips={'20000027', '20000027', '20000001', '20000001'} }

eFleets['1-3/'] = { }

eFleets['1-3/A'] = { }
eFleets['1-3/A'][1] = { formation='单纵', eShips={'20000005', '20000008'} }
eFleets['1-3/A'][2] = { formation='单纵', eShips={'20000005', '20000008', '20000012'} }
eFleets['1-3/A'][3] = { formation='单纵', eShips={'20000023', '20000027', '20000012'} }

eFleets['1-3/B'] = { }
eFleets['1-3/B'][1] = { formation='单纵', eShips={'20000005', '20000008'} }
eFleets['1-3/B'][2] = { formation='单纵', eShips={'20000005', '20000008', '20000012'} }
eFleets['1-3/B'][3] = { formation='单纵', eShips={'20000023', '20000027', '20000012'} }

eFleets['1-3/C'] = { }

eFleets['1-3/D'] = { }
eFleets['1-3/D'][1] = { formation='单纵', eShips={'20000020', '20000023', '20000008', '20000008'} }
eFleets['1-3/D'][2] = { formation='复纵', eShips={'20000020', '20000023', '20000027', '20000008'} }
eFleets['1-3/D'][3] = { formation='复纵', eShips={'20000035', '20000020', '20000023', '20000005', '20000008'} }

eFleets['1-3/E'] = { }
eFleets['1-3/E'][1] = { formation='单纵', eShips={'20000020', '20000023', '20000008', '20000008'} }
eFleets['1-3/E'][2] = { formation='复纵', eShips={'20000020', '20000023', '20000027', '20000008'} }
eFleets['1-3/E'][3] = { formation='复纵', eShips={'20000035', '20000020', '20000023', '20000005', '20000008'} }

eFleets['1-3/F'] = { }
eFleets['1-3/F'][1] = { formation='单纵', eShips={'20000020', '20000020', '20000005', '20000005'} }
eFleets['1-3/F'][2] = { formation='复纵', eShips={'20000020', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-3/F'][3] = { formation='单纵', eShips={'20000035', '20000020', '20000020', '20000005', '20000005'} }

eFleets['1-4/'] = { }

eFleets['1-4/A'] = { }
eFleets['1-4/A'][1] = { formation='单纵', eShips={'20000005', '20000005', '20000008'} }
eFleets['1-4/A'][2] = { formation='复纵', eShips={'20000005', '20000005', '20000008', '20000008'} }
eFleets['1-4/A'][3] = { formation='复纵', eShips={'20000020', '20000023', '20000008', '20000008'} }

eFleets['1-4/B'] = { }
eFleets['1-4/B'][1] = { formation='单纵', eShips={'20000005', '20000005', '20000008'} }
eFleets['1-4/B'][2] = { formation='复纵', eShips={'20000005', '20000005', '20000008', '20000008'} }
eFleets['1-4/B'][3] = { formation='复纵', eShips={'20000020', '20000023', '20000008', '20000008'} }

eFleets['1-4/C'] = { }
eFleets['1-4/C'][1] = { formation='轮形', eShips={'20000035', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-4/C'][2] = { formation='轮形', eShips={'20000020', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-4/C'][3] = { formation='轮形', eShips={'20000020', '20000020', '20000005', '20000005', '20000005', '20000005'} }

eFleets['1-4/D'] = { }
eFleets['1-4/D'][1] = { formation='单纵', eShips={'20000005', '20000005', '20000005', '20000005'} }
eFleets['1-4/D'][2] = { formation='单纵', eShips={'20000005', '20000005', '20000005', '20000005'} }
eFleets['1-4/D'][3] = { formation='单纵', eShips={'20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['1-4/E'] = { }
eFleets['1-4/E'][1] = { formation='轮形', eShips={'20000020', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-4/E'][2] = { formation='轮形', eShips={'20000031', '20000031', '20000035', '20000020', '20000020', '20000005'} }
eFleets['1-4/E'][3] = { formation='单纵', eShips={'20000043', '20000035', '20000020', '20000020', '20000005', '20000005'} }

eFleets['1-4/F'] = { }
eFleets['1-4/F'][1] = { formation='轮形', eShips={'20000035', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-4/F'][2] = { formation='轮形', eShips={'20000020', '20000020', '20000020', '20000005', '20000005'} }
eFleets['1-4/F'][3] = { formation='轮形', eShips={'20000020', '20000020', '20000005', '20000005', '20000005', '20000005'} }

eFleets['1-4/G'] = { }

eFleets['1-5/'] = { }

eFleets['1-5/A'] = { }
eFleets['1-5/A'][1] = { formation='单纵', eShips={'20100001', '20100004', '20100016'} }

eFleets['1-5/A*'] = { }
eFleets['1-5/A*'][1] = { formation='单纵', eShips={'20100002', '20100005', '20100018'} }

eFleets['2-1/'] = { }

eFleets['2-1/A'] = { }
eFleets['2-1/A'][1] = { formation='复纵', eShips={'20000005', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-1/A'][2] = { formation='单纵', eShips={'20000020', '20000020', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-1/A'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-1/B'] = { }

eFleets['2-1/C'] = { }
eFleets['2-1/C'][1] = { formation='复纵', eShips={'20000020', '20000020', '20000020', '20000005', '20000005', '20000005'} }
eFleets['2-1/C'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000005', '20000005', '20000005'} }
eFleets['2-1/C'][3] = { formation='轮形', eShips={'20000031', '20000031', '20000020', '20000020', '20000005', '20000005'} }

eFleets['2-1/D'] = { }

eFleets['2-1/E'] = { }
eFleets['2-1/E'][1] = { formation='单纵', eShips={'20000043', '20000035', '20000020', '20000020', '20000005', '20000005'} }
eFleets['2-1/E'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000020', '20000020', '20000005'} }
eFleets['2-1/E'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000005', '20000005', '20000005'} }

eFleets['2-1/F'] = { }
eFleets['2-1/F'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000035', '20000020', '20000020', '20000005'} }
eFleets['2-1/F'][2] = { formation='单纵', eShips={'20000043', '20000035', '20000028', '20000020', '20000002', '20000005'} }
eFleets['2-1/F'][3] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000020', '20000020', '20000005'} }

eFleets['2-2/'] = { }

eFleets['2-2/A'] = { }
eFleets['2-2/A'][1] = { formation='复纵', eShips={'20000013', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-2/A'][2] = { formation='单纵', eShips={'20000020', '20000020', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-2/A'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-2/B'] = { }
eFleets['2-2/B'][1] = { formation='复纵', eShips={'20000013', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-2/B'][2] = { formation='单纵', eShips={'20000020', '20000020', '20000005', '20000005', '20000005', '20000005'} }
eFleets['2-2/B'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-2/C'] = { }

eFleets['2-2/D'] = { }

eFleets['2-2/E'] = { }
eFleets['2-2/E'][1] = { formation='单纵', eShips={'20000043', '20000035', '20000020', '20000020', '20000002', '20000002'} }
eFleets['2-2/E'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000020', '20000020', '20000002'} }
eFleets['2-2/E'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000013', '20000002', '20000002'} }

eFleets['2-2/F'] = { }
eFleets['2-2/F'][1] = { formation='复纵', eShips={'20000028', '20000020', '20000020', '20000005', '20000005', '20000005'} }
eFleets['2-2/F'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000002', '20000005', '20000005'} }
eFleets['2-2/F'][3] = { formation='轮形', eShips={'20000032', '20000031', '20000020', '20000020', '20000005', '20000005'} }

eFleets['2-2/G'] = { }
eFleets['2-2/G'][1] = { formation='轮形', eShips={'20000065', '20000065', '20000016', '20000035', '20000020', '20000013'} }
eFleets['2-2/G'][2] = { formation='复纵', eShips={'20000016', '20000016', '20000032', '20000035', '20000020', '20000020'} }
eFleets['2-2/G'][3] = { formation='轮形', eShips={'20000039', '20000016', '20000032', '20000028', '20000020', '20000020'} }

eFleets['2-2/H'] = { }
eFleets['2-2/H'][1] = { formation='单纵', eShips={'20000043', '20000035', '20000020', '20000020', '20000002', '20000002'} }
eFleets['2-2/H'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000020', '20000020', '20000002'} }
eFleets['2-2/H'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000013', '20000002', '20000002'} }

eFleets['2-3/'] = { }

eFleets['2-3/A'] = { }
eFleets['2-3/A'][1] = { formation='复纵', eShips={'20000009', '20000013', '20000002', '20000005', '20000005'} }
eFleets['2-3/A'][2] = { formation='单纵', eShips={'20000028', '20000020', '20000002', '20000005', '20000005', '20000005'} }
eFleets['2-3/A'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-3/B'] = { }
eFleets['2-3/B'][1] = { formation='复纵', eShips={'20000009', '20000013', '20000002', '20000005', '20000005'} }
eFleets['2-3/B'][2] = { formation='单纵', eShips={'20000028', '20000020', '20000002', '20000005', '20000005', '20000005'} }
eFleets['2-3/B'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-3/C'] = { }
eFleets['2-3/C'][1] = { formation='复纵', eShips={'20000024', '20000020', '20000020', '20000002', '20000002', '20000002'} }
eFleets['2-3/C'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000013', '20000002', '20000002'} }
eFleets['2-3/C'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000020', '20000020', '20000002', '20000002'} }

eFleets['2-3/D'] = { }
eFleets['2-3/D'][1] = { formation='复纵', eShips={'20000024', '20000020', '20000020', '20000002', '20000002', '20000002'} }
eFleets['2-3/D'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000013', '20000002', '20000002'} }
eFleets['2-3/D'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000020', '20000020', '20000002', '20000002'} }

eFleets['2-3/E'] = { }
eFleets['2-3/E'][1] = { formation='复纵', eShips={'20000024', '20000020', '20000020', '20000002', '20000002', '20000002'} }
eFleets['2-3/E'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000013', '20000002', '20000002'} }
eFleets['2-3/E'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000020', '20000020', '20000002', '20000002'} }

eFleets['2-3/F'] = { }

eFleets['2-3/G'] = { }
eFleets['2-3/G'][1] = { formation='单纵', eShips={'20000039', '20000035', '20000028', '20000020', '20000013', '20000013'} }
eFleets['2-3/G'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000028', '20000020', '20000013'} }
eFleets['2-3/G'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000009', '20000013', '20000013'} }

eFleets['2-3/H'] = { }
eFleets['2-3/H'][1] = { formation='复纵', eShips={'20000024', '20000020', '20000020', '20000002', '20000002', '20000002'} }
eFleets['2-3/H'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000020', '20000013', '20000002', '20000002'} }
eFleets['2-3/H'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000020', '20000020', '20000002', '20000002'} }

eFleets['2-3/I'] = { }

eFleets['2-3/J'] = { }
eFleets['2-3/J'][1] = { formation='轮形', eShips={'20000065', '20000065', '20000016', '20000035', '20000020', '20000009'} }
eFleets['2-3/J'][2] = { formation='复纵', eShips={'20000016', '20000016', '20000032', '20000035', '20000028', '20000020'} }
eFleets['2-3/J'][3] = { formation='轮形', eShips={'20000039', '20000016', '20000032', '20000024', '20000028', '20000020'} }

eFleets['2-3/K'] = { }

eFleets['2-4/'] = { }

eFleets['2-4/A'] = { }
eFleets['2-4/A'][1] = { formation='复纵', eShips={'20000009', '20000013', '20000013', '20000005', '20000005'} }
eFleets['2-4/A'][2] = { formation='单纵', eShips={'20000028', '20000020', '20000013', '20000005', '20000005', '20000005'} }
eFleets['2-4/A'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-4/B'] = { }
eFleets['2-4/B'][1] = { formation='复纵', eShips={'20000009', '20000013', '20000013', '20000005', '20000005'} }
eFleets['2-4/B'][2] = { formation='单纵', eShips={'20000028', '20000020', '20000013', '20000005', '20000005', '20000005'} }
eFleets['2-4/B'][3] = { formation='复纵', eShips={'20000065', '20000020', '20000020', '20000005', '20000005', '20000005'} }

eFleets['2-4/C'] = { }
eFleets['2-4/C'][1] = { formation='复纵', eShips={'20000021', '20000028', '20000028', '20000013', '20000013', '20000013'} }
eFleets['2-4/C'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000028', '20000009', '20000013', '20000013'} }
eFleets['2-4/C'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000028', '20000028', '20000013', '20000013'} }

eFleets['2-4/D'] = { }
eFleets['2-4/D'][1] = { formation='复纵', eShips={'20000021', '20000028', '20000028', '20000013', '20000013', '20000013'} }
eFleets['2-4/D'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000028', '20000009', '20000013', '20000013'} }
eFleets['2-4/D'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000028', '20000028', '20000013', '20000013'} }

eFleets['2-4/E'] = { }
eFleets['2-4/E'][1] = { formation='复纵', eShips={'20000021', '20000028', '20000028', '20000013', '20000013', '20000013'} }
eFleets['2-4/E'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000028', '20000009', '20000013', '20000013'} }
eFleets['2-4/E'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000028', '20000028', '20000013', '20000013'} }

eFleets['2-4/F'] = { }

eFleets['2-4/G'] = { }
eFleets['2-4/G'][1] = { formation='复纵', eShips={'20000021', '20000028', '20000028', '20000013', '20000013', '20000013'} }
eFleets['2-4/G'][2] = { formation='单纵', eShips={'20000065', '20000065', '20000028', '20000009', '20000013', '20000013'} }
eFleets['2-4/G'][3] = { formation='轮形', eShips={'20000032', '20000032', '20000028', '20000028', '20000013', '20000013'} }

eFleets['2-4/H'] = { }
eFleets['2-4/H'][1] = { formation='单纵', eShips={'20000039', '20000035', '20000028', '20000028', '20000009', '20000009'} }
eFleets['2-4/H'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000028', '20000028', '20000009'} }
eFleets['2-4/H'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000009', '20000009', '20000009'} }

eFleets['2-4/I'] = { }
eFleets['2-4/I'][1] = { formation='单纵', eShips={'20000039', '20000035', '20000028', '20000028', '20000009', '20000009'} }
eFleets['2-4/I'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000028', '20000028', '20000009'} }
eFleets['2-4/I'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000009', '20000009', '20000009'} }

eFleets['2-4/J'] = { }
eFleets['2-4/J'][1] = { formation='单纵', eShips={'20000039', '20000035', '20000028', '20000028', '20000009', '20000009'} }
eFleets['2-4/J'][2] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000028', '20000028', '20000009'} }
eFleets['2-4/J'][3] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000009', '20000009', '20000009'} }

eFleets['2-4/K'] = { }

eFleets['2-4/L'] = { }
eFleets['2-4/L'][1] = { formation='复纵', eShips={'20000044', '20000044', '20000032', '20000032', '20000024', '20000024'} }
eFleets['2-4/L'][2] = { formation='轮形', eShips={'20000044', '20000017', '20000017', '20000032', '20000035', '20000024'} }
eFleets['2-4/L'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000017', '20000036', '20000035', '20000009'} }

eFleets['2-5/'] = { }

eFleets['2-5/A'] = { }
eFleets['2-5/A'][1] = { formation='复纵', eShips={'20000067', '20000036', '20000036', '20000022', '20000074'} }
eFleets['2-5/A'][2] = { formation='复纵', eShips={'20000067', '20000036', '20000025', '20000022', '20000074', '20000074'} }
eFleets['2-5/A'][3] = { formation='梯形', eShips={'20000067', '20000025', '20000025', '20000074', '20000074', '20000074'} }

eFleets['2-5/B'] = { }
eFleets['2-5/B'][1] = { formation='复纵', eShips={'20000033', '20000033', '20000025', '20000025', '20000074', '20000074'} }
eFleets['2-5/B'][2] = { formation='轮形', eShips={'20000033', '20000037', '20000025', '20000025', '20000074', '20000074'} }
eFleets['2-5/B'][3] = { formation='单纵', eShips={'20000067', '20000037', '20000025', '20000025', '20000074', '20000074'} }

eFleets['2-5/C'] = { }

eFleets['2-5/D'] = { }
eFleets['2-5/D'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000045', '20000025', '20000025', '20000074'} }
eFleets['2-5/D'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000067', '20000037', '20000025', '20000074'} }
eFleets['2-5/D'][3] = { formation='单纵', eShips={'20000045', '20000045', '20000037', '20000025', '20000025', '20000074'} }

eFleets['2-5/E'] = { }

eFleets['2-5/F'] = { }
eFleets['2-5/F'][1] = { formation='单纵', eShips={'20000042', '20000042', '20000067', '20000067', '20000074', '20000074'} }
eFleets['2-5/F'][2] = { formation='复纵', eShips={'20000042', '20000042', '20000033', '20000033', '20000074', '20000074'} }
eFleets['2-5/F'][3] = { formation='轮形', eShips={'20000033', '20000033', '20000033', '20000026', '20000074', '20000074'} }

eFleets['2-5/G'] = { }
eFleets['2-5/G'][1] = { formation='梯形', eShips={'20000067', '20000067', '20000033', '20000033', '20000074', '20000074'} }
eFleets['2-5/G'][2] = { formation='梯形', eShips={'20000042', '20000042', '20000033', '20000033', '20000074', '20000074'} }
eFleets['2-5/G'][3] = { formation='梯形', eShips={'20000045', '20000045', '20000033', '20000033', '20000074', '20000074'} }

eFleets['2-5/H'] = { }
eFleets['2-5/H'][1] = { formation='单纵', eShips={'20000045', '20000041', '20000067', '20000025', '20000025', '20000007'} }
eFleets['2-5/H'][2] = { formation='单纵', eShips={'20000045', '20000067', '20000033', '20000025', '20000007', '20000007'} }
eFleets['2-5/H'][3] = { formation='单纵', eShips={'20000045', '20000045', '20000033', '20000037', '20000025', '20000007'} }

eFleets['2-5/I'] = { }
eFleets['2-5/I'][1] = { formation='复纵', eShips={'20000045', '20000045', '20000033', '20000032', '20000074', '20000074'} }
eFleets['2-5/I'][2] = { formation='复纵', eShips={'20000018', '20000033', '20000037', '20000037', '20000066', '20000066'} }
eFleets['2-5/I'][3] = { formation='复纵', eShips={'20000067', '20000067', '20000040', '20000040', '20000074', '20000074'} }

eFleets['2-5/J'] = { }
eFleets['2-5/J'][1] = { formation='梯形', eShips={'20000045', '20000045', '20000075', '20000075', '20000033', '20000033'} }
eFleets['2-5/J'][2] = { formation='复纵', eShips={'20000042', '20000042', '20000075', '20000075', '20000067', '20000067'} }
eFleets['2-5/J'][3] = { formation='复纵', eShips={'20000019', '20000034', '20000075', '20000075', '20000033', '20000033'} }

eFleets['2-5/K'] = { }
eFleets['2-5/K'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000045', '20000025', '20000025', '20000074'} }
eFleets['2-5/K'][2] = { formation='单纵', eShips={'20000045', '20000041', '20000040', '20000037', '20000025', '20000074'} }
eFleets['2-5/K'][3] = { formation='单纵', eShips={'20000045', '20000018', '20000018', '20000025', '20000025', '20000074'} }

eFleets['2-5/L'] = { }
eFleets['2-5/L'][1] = { formation='梯形', eShips={'20000019', '20000034', '20000033', '20000033', '20000074', '20000074'} }
eFleets['2-5/L'][2] = { formation='梯形', eShips={'20000019', '20000034', '20000033', '20000030', '20000074', '20000074'} }
eFleets['2-5/L'][3] = { formation='梯形', eShips={'20000042', '20000034', '20000033', '20000033', '20000074', '20000074'} }

eFleets['2-5/M'] = { }
eFleets['2-5/M'][1] = { formation='梯形', eShips={'20000068', '20000068', '20000037', '20000037', '20000074', '20000074'} }
eFleets['2-5/M'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000030', '20000030', '20000074', '20000074'} }
eFleets['2-5/M'][3] = { formation='梯形', eShips={'20000068', '20000068', '20000033', '20000033', '20000033', '20000074'} }

eFleets['2-5/N'] = { }
eFleets['2-5/N'][1] = { formation='梯形', eShips={'20000045', '20000045', '20000018', '20000018', '20000026', '20000026'} }
eFleets['2-5/N'][2] = { formation='梯形', eShips={'20000045', '20000045', '20000033', '20000037', '20000037', '20000074'} }
eFleets['2-5/N'][3] = { formation='梯形', eShips={'20000045', '20000045', '20000067', '20000030', '20000026', '20000074'} }

eFleets['2-5/O'] = { }
eFleets['2-5/O'][1] = { formation='复纵', eShips={'20000042', '20000042', '20000018', '20000033', '20000074', '20000074'} }
eFleets['2-5/O'][2] = { formation='复纵', eShips={'20000042', '20000042', '20000018', '20000033', '20000074', '20000074'} }
eFleets['2-5/O'][3] = { formation='复纵', eShips={'20000042', '20000042', '20000018', '20000033', '20000074', '20000074'} }

eFleets['2-6/'] = { }

eFleets['2-6/A'] = { }
eFleets['2-6/A'][1] = { formation='单纵', eShips={'20000067', '20000037', '20000025', '20000074', '20000078'} }
eFleets['2-6/A'][2] = { formation='复纵', eShips={'20000067', '20000030', '20000025', '20000074', '20000074', '20000074'} }
eFleets['2-6/A'][3] = { formation='梯形', eShips={'20000067', '20000037', '20000025', '20000025', '20000074', '20000078'} }

eFleets['2-6/B'] = { }
eFleets['2-6/B'][1] = { formation='复纵', eShips={'20000018', '20000018', '20000033', '20000025', '20000078'} }
eFleets['2-6/B'][2] = { formation='轮形', eShips={'20000033', '20000033', '20000025', '20000074', '20000074', '20000078'} }
eFleets['2-6/B'][3] = { formation='单纵', eShips={'20000037', '20000037', '20000025', '20000074', '20000078', '20000078'} }

eFleets['2-6/C'] = { }

eFleets['2-6/D'] = { }
eFleets['2-6/D'][1] = { formation='单纵', eShips={'20000034', '20000034', '20000087', '20000030', '20000074', '20000074'} }
eFleets['2-6/D'][2] = { formation='复纵', eShips={'20000034', '20000037', '20000030', '20000030', '20000074', '20000078'} }
eFleets['2-6/D'][3] = { formation='梯形', eShips={'20000068', '20000087', '20000030', '20000075', '20000074', '20000078'} }

eFleets['2-6/E'] = { }
eFleets['2-6/E'][1] = { formation='单纵', eShips={'20000041', '20000045', '20000045', '20000025', '20000074', '20000078'} }
eFleets['2-6/E'][2] = { formation='复纵', eShips={'20000067', '20000067', '20000086', '20000037', '20000025', '20000074'} }
eFleets['2-6/E'][3] = { formation='轮形', eShips={'20000045', '20000045', '20000037', '20000025', '20000025', '20000025'} }

eFleets['2-6/F'] = { }
eFleets['2-6/F'][1] = { formation='复纵', eShips={'20000091', '20000091', '20000091', '20000095', '20000074', '20000074'} }
eFleets['2-6/F'][2] = { formation='轮形', eShips={'20000087', '20000087', '20000091', '20000095', '20000074', '20000078'} }
eFleets['2-6/F'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000091', '20000095', '20000074', '20000078'} }

eFleets['2-6/G'] = { }
eFleets['2-6/G'][1] = { formation='单纵', eShips={'20000068', '20000045', '20000037', '20000037', '20000026', '20000074'} }
eFleets['2-6/G'][2] = { formation='复纵', eShips={'20000068', '20000045', '20000030', '20000030', '20000074', '20000074'} }
eFleets['2-6/G'][3] = { formation='梯形', eShips={'20000068', '20000045', '20000033', '20000033', '20000033', '20000074'} }

eFleets['2-6/H'] = { }

eFleets['2-6/I'] = { }
eFleets['2-6/I'][1] = { formation='单纵', eShips={'20000088', '20000088', '20000037', '20000037', '20000030', '20000004'} }
eFleets['2-6/I'][2] = { formation='复纵', eShips={'20000019', '20000019', '20000037', '20000037', '20000004', '20000004'} }
eFleets['2-6/I'][3] = { formation='梯形', eShips={'20000019', '20000034', '20000087', '20000037', '20000004', '20000079'} }

eFleets['2-6/J'] = { }
eFleets['2-6/J'][1] = { formation='单纵', eShips={'20000088', '20000088', '20000068', '20000037', '20000004', '20000004'} }
eFleets['2-6/J'][2] = { formation='复纵', eShips={'20000088', '20000019', '20000068', '20000037', '20000030', '20000004'} }
eFleets['2-6/J'][3] = { formation='轮形', eShips={'20000019', '20000088', '20000034', '20000068', '20000004', '20000079'} }

eFleets['2-6/K'] = { }
eFleets['2-6/K'][1] = { formation='单纵', eShips={'20000019', '20000045', '20000067', '20000030', '20000004', '20000079'} }
eFleets['2-6/K'][2] = { formation='复纵', eShips={'20000019', '20000045', '20000037', '20000067', '20000030', '20000079'} }
eFleets['2-6/K'][3] = { formation='梯形', eShips={'20000087', '20000045', '20000018', '20000004', '20000079', '20000079'} }

eFleets['2-6/L'] = { }
eFleets['2-6/L'][1] = { formation='单纵', eShips={'20000088', '20000087', '20000019', '20000019', '20000068', '20000004'} }
eFleets['2-6/L'][2] = { formation='复纵', eShips={'20000088', '20000087', '20000019', '20000034', '20000037', '20000004'} }
eFleets['2-6/L'][3] = { formation='轮形', eShips={'20000088', '20000083', '20000019', '20000019', '20000004', '20000004'} }

eFleets['2-6/M'] = { }
eFleets['2-6/M'][1] = { formation='单纵', eShips={'20000019', '20000019', '20000068', '20000087', '20000004', '20000079'} }
eFleets['2-6/M'][2] = { formation='复纵', eShips={'20000088', '20000088', '20000068', '20000004', '20000075', '20000079'} }
eFleets['2-6/M'][3] = { formation='轮形', eShips={'20000088', '20000019', '20000068', '20000068', '20000075', '20000075'} }

eFleets['3-1/'] = { }

eFleets['3-1/A'] = { }
eFleets['3-1/A'][1] = { formation='单纵', eShips={'20000024', '20000028', '20000013', '20000013', '20000013', '20000013'} }
eFleets['3-1/A'][2] = { formation='复纵', eShips={'20000065', '20000028', '20000020', '20000013', '20000013', '20000013'} }
eFleets['3-1/A'][3] = { formation='单纵', eShips={'20000035', '20000028', '20000020', '20000013', '20000013', '20000013'} }

eFleets['3-1/B'] = { }
eFleets['3-1/B'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000024', '20000009', '20000013', '20000013'} }
eFleets['3-1/B'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000024', '20000028', '20000013', '20000013'} }
eFleets['3-1/B'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000024', '20000009', '20000013', '20000013'} }

eFleets['3-1/C'] = { }

eFleets['3-1/D'] = { }
eFleets['3-1/D'][1] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000024', '20000028', '20000009'} }
eFleets['3-1/D'][2] = { formation='轮形', eShips={'20000017', '20000016', '20000065', '20000009', '20000009', '20000009'} }
eFleets['3-1/D'][3] = { formation='轮形', eShips={'20000044', '20000016', '20000032', '20000024', '20000028', '20000009'} }

eFleets['3-1/E'] = { }

eFleets['3-1/F'] = { }
eFleets['3-1/F'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000024', '20000009', '20000013', '20000013'} }
eFleets['3-1/F'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000024', '20000028', '20000013', '20000013'} }
eFleets['3-1/F'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000024', '20000009', '20000013', '20000013'} }

eFleets['3-1/G'] = { }
eFleets['3-1/G'][1] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000024', '20000028', '20000009'} }
eFleets['3-1/G'][2] = { formation='轮形', eShips={'20000017', '20000016', '20000065', '20000009', '20000009', '20000009'} }
eFleets['3-1/G'][3] = { formation='轮形', eShips={'20000044', '20000016', '20000032', '20000024', '20000028', '20000009'} }

eFleets['3-1/H'] = { }
eFleets['3-1/H'][1] = { formation='复纵', eShips={'20000065', '20000065', '20000035', '20000024', '20000028', '20000009'} }
eFleets['3-1/H'][2] = { formation='轮形', eShips={'20000017', '20000016', '20000065', '20000009', '20000009', '20000009'} }
eFleets['3-1/H'][3] = { formation='轮形', eShips={'20000044', '20000016', '20000032', '20000024', '20000028', '20000009'} }

eFleets['3-1/I'] = { }
eFleets['3-1/I'][1] = { formation='复纵', eShips={'20000017', '20000017', '20000032', '20000036', '20000021', '20000024'} }
eFleets['3-1/I'][2] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000021', '20000024'} }
eFleets['3-1/I'][3] = { formation='单纵', eShips={'20000044', '20000065', '20000065', '20000021', '20000021', '20000009'} }

eFleets['3-2/'] = { }

eFleets['3-2/A'] = { }
eFleets['3-2/A'][1] = { formation='单纵', eShips={'20000021', '20000024', '20000009', '20000013', '20000013', '20000013'} }
eFleets['3-2/A'][2] = { formation='复纵', eShips={'20000065', '20000024', '20000028', '20000013', '20000013', '20000013'} }
eFleets['3-2/A'][3] = { formation='单纵', eShips={'20000035', '20000024', '20000028', '20000013', '20000013', '20000013'} }

eFleets['3-2/B'] = { }
eFleets['3-2/B'][1] = { formation='单纵', eShips={'20000021', '20000024', '20000009', '20000013', '20000013', '20000013'} }
eFleets['3-2/B'][2] = { formation='复纵', eShips={'20000065', '20000024', '20000028', '20000013', '20000013', '20000013'} }
eFleets['3-2/B'][3] = { formation='单纵', eShips={'20000035', '20000024', '20000028', '20000013', '20000013', '20000013'} }

eFleets['3-2/C'] = { }
eFleets['3-2/C'][1] = { formation='单纵', eShips={'20000021', '20000024', '20000009', '20000013', '20000013', '20000013'} }
eFleets['3-2/C'][2] = { formation='复纵', eShips={'20000065', '20000024', '20000028', '20000013', '20000013', '20000013'} }
eFleets['3-2/C'][3] = { formation='单纵', eShips={'20000035', '20000024', '20000028', '20000013', '20000013', '20000013'} }

eFleets['3-2/D'] = { }
eFleets['3-2/D'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000009', '20000009', '20000009'} }
eFleets['3-2/D'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000024', '20000009', '20000009'} }
eFleets['3-2/D'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000009', '20000009', '20000009'} }

eFleets['3-2/E'] = { }
eFleets['3-2/E'][1] = { formation='复纵', eShips={'20000065', '20000065', '20000036', '20000021', '20000024', '20000009'} }
eFleets['3-2/E'][2] = { formation='轮形', eShips={'20000017', '20000017', '20000065', '20000006', '20000009', '20000009'} }
eFleets['3-2/E'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000024', '20000009'} }

eFleets['3-2/F'] = { }

eFleets['3-2/G'] = { }
eFleets['3-2/G'][1] = { formation='复纵', eShips={'20000017', '20000017', '20000032', '20000036', '20000021', '20000021'} }
eFleets['3-2/G'][2] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000021', '20000021'} }
eFleets['3-2/G'][3] = { formation='单纵', eShips={'20000044', '20000066', '20000066', '20000021', '20000021', '20000006'} }

eFleets['3-3/'] = { }

eFleets['3-3/A'] = { }
eFleets['3-3/A'][1] = { formation='单纵', eShips={'20000021', '20000024', '20000009', '20000009', '20000009', '20000009'} }
eFleets['3-3/A'][2] = { formation='复纵', eShips={'20000065', '20000024', '20000028', '20000009', '20000009', '20000009'} }
eFleets['3-3/A'][3] = { formation='单纵', eShips={'20000036', '20000024', '20000028', '20000009', '20000009', '20000009'} }

eFleets['3-3/B'] = { }
eFleets['3-3/B'][1] = { formation='单纵', eShips={'20000021', '20000024', '20000009', '20000009', '20000009', '20000009'} }
eFleets['3-3/B'][2] = { formation='复纵', eShips={'20000065', '20000024', '20000028', '20000009', '20000009', '20000009'} }
eFleets['3-3/B'][3] = { formation='单纵', eShips={'20000036', '20000024', '20000028', '20000009', '20000009', '20000009'} }

eFleets['3-3/C'] = { }
eFleets['3-3/C'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000006', '20000009', '20000009'} }
eFleets['3-3/C'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000009', '20000009'} }
eFleets['3-3/C'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000009', '20000009'} }

eFleets['3-3/D'] = { }
eFleets['3-3/D'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000006', '20000009', '20000009'} }
eFleets['3-3/D'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000009', '20000009'} }
eFleets['3-3/D'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000009', '20000009'} }

eFleets['3-3/E'] = { }
eFleets['3-3/E'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000006', '20000009', '20000009'} }
eFleets['3-3/E'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000009', '20000009'} }
eFleets['3-3/E'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000009', '20000009'} }

eFleets['3-3/F'] = { }
eFleets['3-3/F'][1] = { formation='复纵', eShips={'20000031', '20000031', '20000031', '20000035', '20000035', '20000006'} }
eFleets['3-3/F'][2] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000006', '20000006', '20000006'} }
eFleets['3-3/F'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000031', '20000021', '20000021', '20000006'} }

eFleets['3-3/G'] = { }
eFleets['3-3/G'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000006', '20000009', '20000009'} }
eFleets['3-3/G'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000009', '20000009'} }
eFleets['3-3/G'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000009', '20000009'} }

eFleets['3-3/H'] = { }
eFleets['3-3/H'][1] = { formation='单纵', eShips={'20000065', '20000065', '20000021', '20000006', '20000009', '20000009'} }
eFleets['3-3/H'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000009', '20000009'} }
eFleets['3-3/H'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000009', '20000009'} }

eFleets['3-3/I'] = { }

eFleets['3-3/J'] = { }
eFleets['3-3/J'][1] = { formation='复纵', eShips={'20000031', '20000031', '20000031', '20000035', '20000035', '20000006'} }
eFleets['3-3/J'][2] = { formation='轮形', eShips={'20000016', '20000016', '20000065', '20000006', '20000006', '20000006'} }
eFleets['3-3/J'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000031', '20000021', '20000021', '20000006'} }

eFleets['3-3/K'] = { }
eFleets['3-3/K'][1] = { formation='复纵', eShips={'20000017', '20000016', '20000032', '20000036', '20000021', '20000021'} }
eFleets['3-3/K'][2] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000021', '20000021'} }
eFleets['3-3/K'][3] = { formation='单纵', eShips={'20000044', '20000066', '20000066', '20000021', '20000021', '20000006'} }

eFleets['3-4/'] = { }

eFleets['3-4/A'] = { }
eFleets['3-4/A'][1] = { formation='单纵', eShips={'20000021', '20000021', '20000009', '20000009', '20000009', '20000009'} }
eFleets['3-4/A'][2] = { formation='复纵', eShips={'20000065', '20000021', '20000024', '20000009', '20000009', '20000009'} }
eFleets['3-4/A'][3] = { formation='单纵', eShips={'20000036', '20000021', '20000024', '20000009', '20000009', '20000009'} }

eFleets['3-4/B'] = { }
eFleets['3-4/B'][1] = { formation='单纵', eShips={'20000066', '20000065', '20000021', '20000006', '20000006', '20000006'} }
eFleets['3-4/B'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['3-4/B'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }

eFleets['3-4/C'] = { }
eFleets['3-4/C'][1] = { formation='单纵', eShips={'20000066', '20000065', '20000021', '20000006', '20000006', '20000006'} }
eFleets['3-4/C'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['3-4/C'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }

eFleets['3-4/D'] = { }
eFleets['3-4/D'][1] = { formation='单纵', eShips={'20000066', '20000065', '20000021', '20000006', '20000006', '20000006'} }
eFleets['3-4/D'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['3-4/D'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }

eFleets['3-4/E'] = { }

eFleets['3-4/F'] = { }

eFleets['3-4/G'] = { }
eFleets['3-4/G'][1] = { formation='单纵', eShips={'20000066', '20000065', '20000021', '20000006', '20000006', '20000006'} }
eFleets['3-4/G'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['3-4/G'][3] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }

eFleets['3-4/H'] = { }
eFleets['3-4/H'][1] = { formation='复纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000021', '20000006'} }
eFleets['3-4/H'][2] = { formation='轮形', eShips={'20000017', '20000017', '20000065', '20000006', '20000006', '20000006'} }
eFleets['3-4/H'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000021', '20000006'} }

eFleets['3-4/I'] = { }
eFleets['3-4/I'][1] = { formation='复纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000021', '20000006'} }
eFleets['3-4/I'][2] = { formation='轮形', eShips={'20000017', '20000017', '20000065', '20000006', '20000006', '20000006'} }
eFleets['3-4/I'][3] = { formation='轮形', eShips={'20000044', '20000017', '20000032', '20000021', '20000021', '20000006'} }

eFleets['3-4/J'] = { }
eFleets['3-4/J'][1] = { formation='轮形', eShips={'20000085', '20000017', '20000017', '20000032', '20000036', '20000021'} }
eFleets['3-4/J'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000017', '20000036', '20000036', '20000006'} }
eFleets['3-4/J'][3] = { formation='单纵', eShips={'20000085', '20000085', '20000036', '20000036', '20000029', '20000021'} }

eFleets['4-1/'] = { }

eFleets['4-1/A'] = { }
eFleets['4-1/A'][1] = { formation='复纵', eShips={'20000065', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-1/A'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-1/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000024', '20000009', '20000009'} }

eFleets['4-1/B'] = { }
eFleets['4-1/B'][1] = { formation='复纵', eShips={'20000065', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-1/B'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-1/B'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000024', '20000009', '20000009'} }

eFleets['4-1/C'] = { }
eFleets['4-1/C'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-1/C'][2] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-1/C'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-1/D'] = { }
eFleets['4-1/D'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-1/D'][2] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-1/D'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-1/E'] = { }
eFleets['4-1/E'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-1/E'][2] = { formation='梯形', eShips={'20000032', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-1/E'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-1/F'] = { }
eFleets['4-1/F'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000006', '20000006', '20000006'} }
eFleets['4-1/F'][2] = { formation='轮形', eShips={'20000040', '20000017', '20000032', '20000021', '20000021', '20000006'} }
eFleets['4-1/F'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-1/G'] = { }

eFleets['4-1/H'] = { }

eFleets['4-1/I'] = { }
eFleets['4-1/I'][1] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000022', '20000029', '20000021'} }
eFleets['4-1/I'][2] = { formation='单纵', eShips={'20000085', '20000066', '20000066', '20000022', '20000029', '20000006'} }
eFleets['4-1/I'][3] = { formation='复纵', eShips={'20000085', '20000085', '20000017', '20000017', '20000036', '20000021'} }

eFleets['4-1/J'] = { }
eFleets['4-1/J'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000006', '20000006', '20000006'} }
eFleets['4-1/J'][2] = { formation='轮形', eShips={'20000040', '20000017', '20000032', '20000021', '20000021', '20000006'} }
eFleets['4-1/J'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-2/'] = { }

eFleets['4-2/A'] = { }
eFleets['4-2/A'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-2/A'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-2/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000024', '20000009', '20000009'} }

eFleets['4-2/B'] = { }
eFleets['4-2/B'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-2/B'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000009', '20000009', '20000009'} }
eFleets['4-2/B'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000024', '20000009', '20000009'} }

eFleets['4-2/C'] = { }
eFleets['4-2/C'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-2/C'][2] = { formation='梯形', eShips={'20000032', '20000029', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-2/C'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-2/D'] = { }
eFleets['4-2/D'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-2/D'][2] = { formation='梯形', eShips={'20000032', '20000029', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-2/D'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-2/E'] = { }

eFleets['4-2/F'] = { }
eFleets['4-2/F'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['4-2/F'][2] = { formation='梯形', eShips={'20000032', '20000029', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-2/F'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-2/G'] = { }
eFleets['4-2/G'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000006', '20000006', '20000006'} }
eFleets['4-2/G'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000021', '20000021', '20000006'} }
eFleets['4-2/G'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-2/H'] = { }
eFleets['4-2/H'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000006', '20000006', '20000006'} }
eFleets['4-2/H'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000021', '20000021', '20000006'} }
eFleets['4-2/H'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-2/I'] = { }
eFleets['4-2/I'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000006', '20000006', '20000006'} }
eFleets['4-2/I'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000021', '20000021', '20000006'} }
eFleets['4-2/I'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-2/J'] = { }
eFleets['4-2/J'][1] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000022', '20000029', '20000021'} }
eFleets['4-2/J'][2] = { formation='单纵', eShips={'20000045', '20000066', '20000066', '20000022', '20000029', '20000006'} }
eFleets['4-2/J'][3] = { formation='复纵', eShips={'20000045', '20000045', '20000017', '20000017', '20000036', '20000021'} }

eFleets['4-3/'] = { }

eFleets['4-3/A'] = { }
eFleets['4-3/A'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-3/A'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-3/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['4-3/B'] = { }
eFleets['4-3/B'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-3/B'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-3/B'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['4-3/C'] = { }
eFleets['4-3/C'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-3/C'][2] = { formation='梯形', eShips={'20000032', '20000029', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-3/C'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-3/D'] = { }

eFleets['4-3/E'] = { }
eFleets['4-3/E'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-3/E'][2] = { formation='梯形', eShips={'20000032', '20000029', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-3/E'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-3/F'] = { }
eFleets['4-3/F'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000014', '20000006', '20000006'} }
eFleets['4-3/F'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000029', '20000021', '20000006'} }
eFleets['4-3/F'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-3/G'] = { }
eFleets['4-3/G'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000014', '20000006', '20000006'} }
eFleets['4-3/G'][2] = { formation='轮形', eShips={'20000085', '20000017', '20000032', '20000029', '20000021', '20000006'} }
eFleets['4-3/G'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-3/H'] = { }
eFleets['4-3/H'][1] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000022', '20000022', '20000029'} }
eFleets['4-3/H'][2] = { formation='单纵', eShips={'20000045', '20000066', '20000066', '20000022', '20000022', '20000006'} }
eFleets['4-3/H'][3] = { formation='复纵', eShips={'20000045', '20000045', '20000017', '20000017', '20000036', '20000029'} }

eFleets['4-4/'] = { }

eFleets['4-4/A'] = { }
eFleets['4-4/A'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-4/A'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-4/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['4-4/B'] = { }
eFleets['4-4/B'][1] = { formation='复纵', eShips={'20000066', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-4/B'][2] = { formation='单纵', eShips={'20000036', '20000021', '20000021', '20000006', '20000006', '20000006'} }
eFleets['4-4/B'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['4-4/C'] = { }
eFleets['4-4/C'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-4/C'][2] = { formation='梯形', eShips={'20000032', '20000022', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-4/C'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-4/D'] = { }
eFleets['4-4/D'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-4/D'][2] = { formation='梯形', eShips={'20000032', '20000022', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-4/D'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-4/E'] = { }
eFleets['4-4/E'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-4/E'][2] = { formation='梯形', eShips={'20000032', '20000022', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-4/E'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-4/F'] = { }

eFleets['4-4/G'] = { }

eFleets['4-4/H'] = { }
eFleets['4-4/H'][1] = { formation='轮形', eShips={'20000032', '20000032', '20000029', '20000021', '20000006', '20000006'} }
eFleets['4-4/H'][2] = { formation='梯形', eShips={'20000032', '20000022', '20000029', '20000006', '20000006', '20000006'} }
eFleets['4-4/H'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000021', '20000006', '20000006'} }

eFleets['4-4/I'] = { }
eFleets['4-4/I'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000010', '20000006', '20000006'} }
eFleets['4-4/I'][2] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000029', '20000021', '20000006'} }
eFleets['4-4/I'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-4/J'] = { }

eFleets['4-4/K'] = { }
eFleets['4-4/K'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000010', '20000006', '20000006'} }
eFleets['4-4/K'][2] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000029', '20000021', '20000006'} }
eFleets['4-4/K'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000006', '20000006'} }

eFleets['4-4/L'] = { }
eFleets['4-4/L'][1] = { formation='轮形', eShips={'20000041', '20000018', '20000018', '20000036', '20000036', '20000010'} }
eFleets['4-4/L'][2] = { formation='单纵', eShips={'20000041', '20000041', '20000037', '20000036', '20000025', '20000022'} }
eFleets['4-4/L'][3] = { formation='复纵', eShips={'20000041', '20000041', '20000045', '20000025', '20000025', '20000022'} }

eFleets['5-1/'] = { }

eFleets['5-1/A'] = { }
eFleets['5-1/A'][1] = { formation='单纵', eShips={'20000036', '20000029', '20000021', '20000006', '20000006', '20000006'} }
eFleets['5-1/A'][2] = { formation='单纵', eShips={'20000066', '20000032', '20000021', '20000021', '20000021', '20000006'} }
eFleets['5-1/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['5-1/B'] = { }
eFleets['5-1/B'][1] = { formation='复纵', eShips={'20000036', '20000036', '20000021', '20000021', '20000006', '20000006'} }
eFleets['5-1/B'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000021', '20000021', '20000006', '20000006'} }
eFleets['5-1/B'][3] = { formation='梯形', eShips={'20000032', '20000029', '20000021', '20000006', '20000006', '20000006'} }

eFleets['5-1/C'] = { }
eFleets['5-1/C'][1] = { formation='梯形', eShips={'20000053', '20000052', '20000052', '20000052'} }
eFleets['5-1/C'][2] = { formation='复纵', eShips={'20000032', '20000032', '20000022', '20000052', '20000054', '20000054'} }
eFleets['5-1/C'][3] = { formation='单纵', eShips={'20000053', '20000052', '20000036', '20000029', '20000021', '20000006'} }

eFleets['5-1/D'] = { }
eFleets['5-1/D'][1] = { formation='单纵', eShips={'20000066', '20000017', '20000036', '20000036', '20000021', '20000021'} }
eFleets['5-1/D'][2] = { formation='复纵', eShips={'20000066', '20000032', '20000032', '20000036', '20000021', '20000054'} }
eFleets['5-1/D'][3] = { formation='轮形', eShips={'20000066', '20000066', '20000032', '20000032', '20000006', '20000006'} }

eFleets['5-1/E'] = { }
eFleets['5-1/E'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000032', '20000032', '20000022', '20000029'} }
eFleets['5-1/E'][2] = { formation='复纵', eShips={'20000066', '20000017', '20000032', '20000032', '20000010', '20000006'} }
eFleets['5-1/E'][3] = { formation='梯形', eShips={'20000017', '20000032', '20000032', '20000036', '20000036', '20000029'} }

eFleets['5-1/F'] = { }
eFleets['5-1/F'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000066', '20000066', '20000022', '20000029'} }
eFleets['5-1/F'][2] = { formation='复纵', eShips={'20000045', '20000066', '20000066', '20000036', '20000022', '20000029'} }
eFleets['5-1/F'][3] = { formation='轮形', eShips={'20000045', '20000045', '20000032', '20000032', '20000010', '20000006'} }

eFleets['5-1/G'] = { }
eFleets['5-1/G'][1] = { formation='轮形', eShips={'20000045', '20000017', '20000017', '20000032', '20000022', '20000029'} }
eFleets['5-1/G'][2] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000032', '20000036', '20000006'} }
eFleets['5-1/G'][3] = { formation='轮形', eShips={'20000066', '20000066', '20000017', '20000032', '20000032', '20000052'} }

eFleets['5-1/H'] = { }
eFleets['5-1/H'][1] = { formation='单纵', eShips={'20000041', '20000067', '20000066', '20000036', '20000036', '20000052'} }
eFleets['5-1/H'][2] = { formation='复纵', eShips={'20000067', '20000067', '20000017', '20000032', '20000022', '20000052'} }
eFleets['5-1/H'][3] = { formation='轮形', eShips={'20000041', '20000018', '20000017', '20000032', '20000032', '20000052'} }

eFleets['5-2/'] = { }

eFleets['5-2/A'] = { }
eFleets['5-2/A'][1] = { formation='单纵', eShips={'20000036', '20000022', '20000029', '20000006', '20000006', '20000006'} }
eFleets['5-2/A'][2] = { formation='单纵', eShips={'20000066', '20000032', '20000029', '20000021', '20000021', '20000006'} }
eFleets['5-2/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000021', '20000006', '20000006'} }

eFleets['5-2/B'] = { }
eFleets['5-2/B'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000032', '20000032', '20000021', '20000021'} }
eFleets['5-2/B'][2] = { formation='复纵', eShips={'20000066', '20000017', '20000032', '20000032', '20000006', '20000006'} }
eFleets['5-2/B'][3] = { formation='梯形', eShips={'20000017', '20000032', '20000032', '20000036', '20000036', '20000021'} }

eFleets['5-2/C'] = { }
eFleets['5-2/C'][1] = { formation='梯形', eShips={'20000052', '20000052', '20000052', '20000054'} }
eFleets['5-2/C'][2] = { formation='复纵', eShips={'20000032', '20000022', '20000052', '20000054', '20000054'} }
eFleets['5-2/C'][3] = { formation='单纵', eShips={'20000032', '20000022', '20000036', '20000054', '20000054', '20000054'} }

eFleets['5-2/D'] = { }
eFleets['5-2/D'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000010', '20000010', '20000006'} }
eFleets['5-2/D'][2] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000022', '20000029', '20000006'} }
eFleets['5-2/D'][3] = { formation='复纵', eShips={'20000017', '20000017', '20000032', '20000036', '20000029', '20000021'} }

eFleets['5-2/E'] = { }
eFleets['5-2/E'][1] = { formation='轮形', eShips={'20000066', '20000066', '20000017', '20000032', '20000032', '20000054'} }
eFleets['5-2/E'][2] = { formation='单纵', eShips={'20000045', '20000066', '20000066', '20000036', '20000036', '20000054'} }
eFleets['5-2/E'][3] = { formation='复纵', eShips={'20000066', '20000066', '20000017', '20000032', '20000029', '20000054'} }

eFleets['5-2/F'] = { }
eFleets['5-2/F'][1] = { formation='轮形', eShips={'20000045', '20000017', '20000017', '20000032', '20000029', '20000021'} }
eFleets['5-2/F'][2] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000032', '20000036', '20000006'} }
eFleets['5-2/F'][3] = { formation='轮形', eShips={'20000066', '20000066', '20000017', '20000032', '20000032', '20000054'} }

eFleets['5-2/G'] = { }
eFleets['5-2/G'][1] = { formation='梯形', eShips={'20000059', '20000059', '20000053', '20000053'} }
eFleets['5-2/G'][2] = { formation='梯形', eShips={'20000018', '20000018', '20000053', '20000053', '20000052'} }
eFleets['5-2/G'][3] = { formation='梯形', eShips={'20000059', '20000059', '20000053', '20000053', '20000052'} }

eFleets['5-2/H'] = { }
eFleets['5-2/H'][1] = { formation='单纵', eShips={'20000045', '20000067', '20000066', '20000036', '20000036', '20000029'} }
eFleets['5-2/H'][2] = { formation='复纵', eShips={'20000067', '20000067', '20000017', '20000032', '20000022', '20000010'} }
eFleets['5-2/H'][3] = { formation='轮形', eShips={'20000045', '20000018', '20000017', '20000032', '20000032', '20000029'} }

eFleets['5-2/I'] = { }
eFleets['5-2/I'][1] = { formation='复纵', eShips={'20000018', '20000018', '20000032', '20000036', '20000022', '20000029'} }
eFleets['5-2/I'][2] = { formation='轮形', eShips={'20000067', '20000067', '20000017', '20000032', '20000032', '20000052'} }
eFleets['5-2/I'][3] = { formation='单纵', eShips={'20000045', '20000067', '20000066', '20000036', '20000036', '20000052'} }

eFleets['5-2/J'] = { }
eFleets['5-2/J'][1] = { formation='轮形', eShips={'20000042', '20000041', '20000045', '20000017', '20000017', '20000017'} }
eFleets['5-2/J'][2] = { formation='单纵', eShips={'20000042', '20000041', '20000067', '20000066', '20000036', '20000036'} }
eFleets['5-2/J'][3] = { formation='复纵', eShips={'20000042', '20000018', '20000018', '20000066', '20000066', '20000053'} }

eFleets['5-3/'] = { }

eFleets['5-3/A'] = { }
eFleets['5-3/A'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000032', '20000036', '20000036', '20000054'} }
eFleets['5-3/A'][2] = { formation='轮形', eShips={'20000017', '20000032', '20000032', '20000065', '20000036', '20000054'} }
eFleets['5-3/A'][3] = { formation='轮形', eShips={'20000017', '20000017', '20000032', '20000032', '20000021', '20000021'} }

eFleets['5-3/B'] = { }
eFleets['5-3/B'][1] = { formation='单纵', eShips={'20000066', '20000066', '20000036', '20000036', '20000021', '20000021'} }
eFleets['5-3/B'][2] = { formation='复纵', eShips={'20000085', '20000066', '20000066', '20000036', '20000021', '20000021'} }
eFleets['5-3/B'][3] = { formation='单纵', eShips={'20000066', '20000066', '20000066', '20000006', '20000006', '20000054'} }

eFleets['5-3/C'] = { }
eFleets['5-3/C'][1] = { formation='梯形', eShips={'20000059', '20000059', '20000059', '20000053'} }
eFleets['5-3/C'][2] = { formation='梯形', eShips={'20000018', '20000018', '20000059', '20000053', '20000052'} }
eFleets['5-3/C'][3] = { formation='梯形', eShips={'20000086', '20000025', '20000025', '20000053', '20000052', '20000052'} }

eFleets['5-3/D'] = { }

eFleets['5-3/E'] = { }
eFleets['5-3/E'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000036', '20000036', '20000036', '20000052'} }
eFleets['5-3/E'][2] = { formation='复纵', eShips={'20000045', '20000066', '20000066', '20000007', '20000010', '20000052'} }
eFleets['5-3/E'][3] = { formation='复纵', eShips={'20000066', '20000007', '20000007', '20000007', '20000010', '20000052'} }

eFleets['5-3/F'] = { }
eFleets['5-3/F'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000045', '20000036', '20000036', '20000010'} }
eFleets['5-3/F'][2] = { formation='复纵', eShips={'20000018', '20000018', '20000017', '20000036', '20000036', '20000010'} }
eFleets['5-3/F'][3] = { formation='梯形', eShips={'20000067', '20000067', '20000066', '20000036', '20000036', '20000010'} }

eFleets['5-3/G'] = { }
eFleets['5-3/G'][1] = { formation='复纵', eShips={'20000086', '20000018', '20000017', '20000036', '20000036', '20000010'} }
eFleets['5-3/G'][2] = { formation='单纵', eShips={'20000086', '20000067', '20000066', '20000036', '20000036', '20000010'} }
eFleets['5-3/G'][3] = { formation='轮形', eShips={'20000086', '20000033', '20000032', '20000032', '20000036', '20000010'} }

eFleets['5-3/H'] = { }
eFleets['5-3/H'][1] = { formation='复纵', eShips={'20000067', '20000067', '20000033', '20000033', '20000007', '20000053'} }
eFleets['5-3/H'][2] = { formation='轮形', eShips={'20000067', '20000067', '20000033', '20000033', '20000007', '20000053'} }
eFleets['5-3/H'][3] = { formation='梯形', eShips={'20000067', '20000067', '20000033', '20000033', '20000007', '20000053'} }

eFleets['5-4/'] = { }

eFleets['5-4/A'] = { }
eFleets['5-4/A'][1] = { formation='单纵', eShips={'20000036', '20000022', '20000022', '20000006', '20000006', '20000006'} }
eFleets['5-4/A'][2] = { formation='单纵', eShips={'20000066', '20000032', '20000022', '20000029', '20000021', '20000006'} }
eFleets['5-4/A'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000029', '20000006', '20000006'} }

eFleets['5-4/B'] = { }
eFleets['5-4/B'][1] = { formation='复纵', eShips={'20000036', '20000036', '20000022', '20000022', '20000006', '20000006'} }
eFleets['5-4/B'][2] = { formation='轮形', eShips={'20000032', '20000032', '20000022', '20000022', '20000006', '20000006'} }
eFleets['5-4/B'][3] = { formation='梯形', eShips={'20000032', '20000025', '20000022', '20000010', '20000006', '20000006'} }

eFleets['5-4/C'] = { }
eFleets['5-4/C'][1] = { formation='轮形', eShips={'20000017', '20000033', '20000066', '20000007', '20000010', '20000014'} }
eFleets['5-4/C'][2] = { formation='轮形', eShips={'20000045', '20000033', '20000032', '20000025', '20000022', '20000014'} }
eFleets['5-4/C'][3] = { formation='复纵', eShips={'20000017', '20000033', '20000032', '20000036', '20000022', '20000029'} }

eFleets['5-4/D'] = { }
eFleets['5-4/D'][1] = { formation='复纵', eShips={'20000045', '20000066', '20000066', '20000032', '20000062', '20000014'} }
eFleets['5-4/D'][2] = { formation='单纵', eShips={'20000017', '20000033', '20000032', '20000062', '20000062', '20000014'} }
eFleets['5-4/D'][3] = { formation='梯形', eShips={'20000066', '20000066', '20000036', '20000036', '20000062', '20000014'} }

eFleets['5-4/E'] = { }
eFleets['5-4/E'][1] = { formation='梯形', eShips={'20000041', '20000067', '20000067', '20000007', '20000007', '20000010'} }
eFleets['5-4/E'][2] = { formation='梯形', eShips={'20000041', '20000037', '20000037', '20000007', '20000007', '20000010'} }
eFleets['5-4/E'][3] = { formation='梯形', eShips={'20000041', '20000026', '20000025', '20000007', '20000007', '20000010'} }

eFleets['5-4/F'] = { }

eFleets['5-4/G'] = { }
eFleets['5-4/G'][1] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000036', '20000036', '20000052'} }
eFleets['5-4/G'][2] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000066', '20000036', '20000052'} }
eFleets['5-4/G'][3] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000025', '20000025', '20000022'} }

eFleets['5-4/H'] = { }
eFleets['5-4/H'][1] = { formation='单纵', eShips={'20000087', '20000041', '20000041', '20000015', '20000007', '20000007'} }
eFleets['5-4/H'][2] = { formation='复纵', eShips={'20000087', '20000041', '20000041', '20000015', '20000007', '20000007'} }
eFleets['5-4/H'][3] = { formation='梯形', eShips={'20000087', '20000041', '20000041', '20000015', '20000007', '20000007'} }

eFleets['5-5/'] = { }

eFleets['5-5/A'] = { }
eFleets['5-5/A'][1] = { formation='轮形', eShips={'20000036', '20000032', '20000032', '20000032', '20000006', '20000006'} }
eFleets['5-5/A'][2] = { formation='轮形', eShips={'20000066', '20000036', '20000032', '20000032', '20000021', '20000021'} }
eFleets['5-5/A'][3] = { formation='轮形', eShips={'20000017', '20000032', '20000032', '20000036', '20000021', '20000021'} }

eFleets['5-5/B'] = { }
eFleets['5-5/B'][1] = { formation='单纵', eShips={'20000036', '20000036', '20000022', '20000029', '20000006', '20000006'} }
eFleets['5-5/B'][2] = { formation='单纵', eShips={'20000066', '20000036', '20000036', '20000029', '20000021', '20000006'} }
eFleets['5-5/B'][3] = { formation='单纵', eShips={'20000036', '20000062', '20000022', '20000029', '20000006', '20000006'} }

eFleets['5-5/C'] = { }
eFleets['5-5/C'][1] = { formation='梯形', eShips={'20000053', '20000055', '20000052', '20000052'} }
eFleets['5-5/C'][2] = { formation='梯形', eShips={'20000017', '20000017', '20000052', '20000052', '20000054'} }
eFleets['5-5/C'][3] = { formation='梯形', eShips={'20000066', '20000025', '20000022', '20000052', '20000054', '20000054'} }

eFleets['5-5/D'] = { }
eFleets['5-5/D'][1] = { formation='轮形', eShips={'20000018', '20000033', '20000036', '20000036', '20000052', '20000052'} }
eFleets['5-5/D'][2] = { formation='轮形', eShips={'20000018', '20000033', '20000032', '20000036', '20000036', '20000052'} }
eFleets['5-5/D'][3] = { formation='轮形', eShips={'20000067', '20000018', '20000032', '20000032', '20000022', '20000052'} }

eFleets['5-5/E'] = { }
eFleets['5-5/E'][1] = { formation='轮形', eShips={'20000045', '20000018', '20000032', '20000025', '20000022', '20000010'} }
eFleets['5-5/E'][2] = { formation='复纵', eShips={'20000018', '20000033', '20000032', '20000036', '20000022', '20000029'} }
eFleets['5-5/E'][3] = { formation='轮形', eShips={'20000067', '20000067', '20000017', '20000032', '20000032', '20000052'} }

eFleets['5-5/F'] = { }
eFleets['5-5/F'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000067', '20000007', '20000007', '20000007'} }
eFleets['5-5/F'][2] = { formation='单纵', eShips={'20000067', '20000067', '20000037', '20000037', '20000007', '20000007'} }
eFleets['5-5/F'][3] = { formation='复纵', eShips={'20000041', '20000067', '20000067', '20000007', '20000007', '20000007'} }

eFleets['5-5/G'] = { }
eFleets['5-5/G'][1] = { formation='复纵', eShips={'20000041', '20000041', '20000033', '20000032', '20000007', '20000007'} }
eFleets['5-5/G'][2] = { formation='复纵', eShips={'20000041', '20000067', '20000067', '20000025', '20000025', '20000007'} }
eFleets['5-5/G'][3] = { formation='轮形', eShips={'20000041', '20000018', '20000033', '20000032', '20000007', '20000007'} }

eFleets['5-5/H'] = { }
eFleets['5-5/H'][1] = { formation='单纵', eShips={'20000041', '20000041', '20000037', '20000037', '20000025', '20000022'} }
eFleets['5-5/H'][2] = { formation='复纵', eShips={'20000041', '20000041', '20000086', '20000025', '20000025', '20000022'} }
eFleets['5-5/H'][3] = { formation='单纵', eShips={'20000041', '20000018', '20000018', '20000032', '20000025', '20000052'} }

eFleets['5-5/I'] = { }
eFleets['5-5/I'][1] = { formation='单纵', eShips={'20000047', '20000067', '20000067', '20000018', '20000018', '20000015'} }

eFleets['6-1/'] = { }

eFleets['6-1/A'] = { }
eFleets['6-1/A'][1] = { formation='梯形', eShips={'20000053', '20000053', '20000052', '20000062', '20000062'} }
eFleets['6-1/A'][2] = { formation='梯形', eShips={'20000032', '20000032', '20000052', '20000052', '20000058'} }
eFleets['6-1/A'][3] = { formation='梯形', eShips={'20000053', '20000053', '20000052', '20000052', '20000058'} }

eFleets['6-1/B'] = { }
eFleets['6-1/B'][1] = { formation='单纵', eShips={'20000036', '20000025', '20000022', '20000010', '20000006', '20000006'} }
eFleets['6-1/B'][2] = { formation='单纵', eShips={'20000066', '20000032', '20000022', '20000029', '20000021', '20000006'} }
eFleets['6-1/B'][3] = { formation='复纵', eShips={'20000036', '20000032', '20000032', '20000029', '20000006', '20000006'} }

eFleets['6-1/C'] = { }
eFleets['6-1/C'][1] = { formation='单横', eShips={'20000025', '20000025', '20000007', '20000010', '20000006', '20000006'} }
eFleets['6-1/C'][2] = { formation='单横', eShips={'20000066', '20000025', '20000022', '20000010', '20000006', '20000006'} }
eFleets['6-1/C'][3] = { formation='单横', eShips={'20000036', '20000025', '20000022', '20000010', '20000006', '20000006'} }

eFleets['6-1/D'] = { }
eFleets['6-1/D'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000033', '20000032', '20000022', '20000022'} }
eFleets['6-1/D'][2] = { formation='复纵', eShips={'20000067', '20000018', '20000033', '20000032', '20000007', '20000010'} }
eFleets['6-1/D'][3] = { formation='梯形', eShips={'20000018', '20000033', '20000033', '20000036', '20000036', '20000022'} }

eFleets['6-1/E'] = { }
eFleets['6-1/E'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000037', '20000036', '20000022', '20000022'} }
eFleets['6-1/E'][2] = { formation='复纵', eShips={'20000086', '20000067', '20000066', '20000036', '20000022', '20000022'} }
eFleets['6-1/E'][3] = { formation='单纵', eShips={'20000067', '20000067', '20000066', '20000007', '20000007', '20000052'} }

eFleets['6-1/F'] = { }
eFleets['6-1/F'][1] = { formation='梯形', eShips={'20000086', '20000067', '20000066', '20000007', '20000007', '20000010'} }
eFleets['6-1/F'][2] = { formation='梯形', eShips={'20000086', '20000037', '20000037', '20000007', '20000007', '20000010'} }
eFleets['6-1/F'][3] = { formation='梯形', eShips={'20000086', '20000025', '20000025', '20000007', '20000007', '20000010'} }

eFleets['6-1/G'] = { }
eFleets['6-1/G'][1] = { formation='轮形', eShips={'20000041', '20000018', '20000033', '20000033', '20000007', '20000007'} }
eFleets['6-1/G'][2] = { formation='复纵', eShips={'20000041', '20000067', '20000067', '20000025', '20000025', '20000007'} }
eFleets['6-1/G'][3] = { formation='复纵', eShips={'20000041', '20000067', '20000018', '20000033', '20000032', '20000007'} }

eFleets['6-1/H'] = { }
eFleets['6-1/H'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000067', '20000015', '20000007', '20000052'} }
eFleets['6-1/H'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000033', '20000037', '20000036', '20000052'} }
eFleets['6-1/H'][3] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000067', '20000036', '20000052'} }

eFleets['6-1/I'] = { }
eFleets['6-1/I'][1] = { formation='单纵', eShips={'20000030', '20000030', '20000015', '20000015', '20000007', '20000007'} }
eFleets['6-1/I'][2] = { formation='单纵', eShips={'20000037', '20000030', '20000026', '20000015', '20000007', '20000007'} }
eFleets['6-1/I'][3] = { formation='复纵', eShips={'20000030', '20000030', '20000026', '20000015', '20000007', '20000007'} }

eFleets['6-1/J'] = { }

eFleets['6-1/K'] = { }
eFleets['6-1/K'][1] = { formation='梯形', eShips={'20000087', '20000067', '20000067', '20000026', '20000025', '20000015'} }
eFleets['6-1/K'][2] = { formation='梯形', eShips={'20000087', '20000067', '20000067', '20000037', '20000037', '20000059'} }
eFleets['6-1/K'][3] = { formation='梯形', eShips={'20000068', '20000067', '20000037', '20000026', '20000015', '20000015'} }

eFleets['6-1/L'] = { }

eFleets['6-2/'] = { }

eFleets['6-2/A'] = { }
eFleets['6-2/A'][1] = { formation='复纵', eShips={'20000017', '20000017', '20000032', '20000032', '20000029', '20000029'} }
eFleets['6-2/A'][2] = { formation='复纵', eShips={'20000066', '20000017', '20000032', '20000032', '20000006', '20000006'} }
eFleets['6-2/A'][3] = { formation='复纵', eShips={'20000017', '20000032', '20000032', '20000036', '20000036', '20000029'} }

eFleets['6-2/B'] = { }
eFleets['6-2/B'][1] = { formation='单纵', eShips={'20000045', '20000066', '20000066', '20000006', '20000006', '20000006'} }
eFleets['6-2/B'][2] = { formation='单纵', eShips={'20000045', '20000036', '20000036', '20000006', '20000006', '20000006'} }
eFleets['6-2/B'][3] = { formation='单纵', eShips={'20000045', '20000022', '20000022', '20000006', '20000006', '20000006'} }

eFleets['6-2/C'] = { }
eFleets['6-2/C'][1] = { formation='轮形', eShips={'20000007', '20000007', '20000010', '20000006', '20000006', '20000006'} }
eFleets['6-2/C'][2] = { formation='轮形', eShips={'20000025', '20000022', '20000010', '20000006', '20000006', '20000006'} }
eFleets['6-2/C'][3] = { formation='轮形', eShips={'20000066', '20000022', '20000022', '20000006', '20000006', '20000006'} }

eFleets['6-2/D'] = { }
eFleets['6-2/D'][1] = { formation='复纵', eShips={'20000067', '20000025', '20000025', '20000007', '20000010', '20000010'} }
eFleets['6-2/D'][2] = { formation='轮形', eShips={'20000037', '20000025', '20000025', '20000007', '20000010', '20000010'} }
eFleets['6-2/D'][3] = { formation='复纵', eShips={'20000037', '20000033', '20000032', '20000025', '20000010', '20000010'} }

eFleets['6-2/E'] = { }
eFleets['6-2/E'][1] = { formation='单纵', eShips={'20000067', '20000033', '20000025', '20000025', '20000022', '20000010'} }
eFleets['6-2/E'][2] = { formation='单纵', eShips={'20000037', '20000025', '20000025', '20000007', '20000010', '20000010'} }
eFleets['6-2/E'][3] = { formation='复纵', eShips={'20000026', '20000025', '20000025', '20000007', '20000010', '20000010'} }

eFleets['6-2/F'] = { }
eFleets['6-2/F'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000025', '20000007', '20000010', '20000010'} }
eFleets['6-2/F'][2] = { formation='复纵', eShips={'20000033', '20000033', '20000025', '20000025', '20000010', '20000010'} }
eFleets['6-2/F'][3] = { formation='梯形', eShips={'20000033', '20000025', '20000025', '20000007', '20000010', '20000010'} }

eFleets['6-2/G'] = { }
eFleets['6-2/G'][1] = { formation='轮形', eShips={'20000026', '20000025', '20000007', '20000007', '20000052', '20000052'} }
eFleets['6-2/G'][2] = { formation='轮形', eShips={'20000067', '20000025', '20000025', '20000007', '20000070', '20000070'} }
eFleets['6-2/G'][3] = { formation='复纵', eShips={'20000067', '20000025', '20000025', '20000007', '20000010', '20000010'} }

eFleets['6-2/H'] = { }
eFleets['6-2/H'][1] = { formation='轮形', eShips={'20000037', '20000025', '20000025', '20000007', '20000052', '20000052'} }
eFleets['6-2/H'][2] = { formation='复纵', eShips={'20000037', '20000033', '20000032', '20000025', '20000010', '20000010'} }
eFleets['6-2/H'][3] = { formation='单纵', eShips={'20000067', '20000033', '20000025', '20000025', '20000070', '20000070'} }

eFleets['6-2/I'] = { }
eFleets['6-2/I'][1] = { formation='单纵', eShips={'20000037', '20000030', '20000026', '20000015', '20000007', '20000071'} }
eFleets['6-2/I'][2] = { formation='复纵', eShips={'20000030', '20000030', '20000026', '20000015', '20000007', '20000007'} }
eFleets['6-2/I'][3] = { formation='单纵', eShips={'20000067', '20000067', '20000026', '20000015', '20000007', '20000055'} }

eFleets['6-2/J'] = { }
eFleets['6-2/J'][1] = { formation='复纵', eShips={'20000041', '20000041', '20000018', '20000018', '20000036', '20000025'} }
eFleets['6-2/J'][2] = { formation='轮形', eShips={'20000041', '20000041', '20000041', '20000037', '20000025', '20000025'} }
eFleets['6-2/J'][3] = { formation='单纵', eShips={'20000041', '20000041', '20000037', '20000025', '20000007', '20000007'} }

eFleets['6-2/K'] = { }
eFleets['6-2/K'][1] = { formation='复纵', eShips={'20000041', '20000045', '20000032', '20000032', '20000022', '20000022'} }
eFleets['6-2/K'][2] = { formation='复纵', eShips={'20000041', '20000018', '20000017', '20000032', '20000036', '20000022'} }
eFleets['6-2/K'][3] = { formation='复纵', eShips={'20000041', '20000018', '20000017', '20000036', '20000036', '20000010'} }

eFleets['6-2/L'] = { }
eFleets['6-2/L'][1] = { formation='单纵', eShips={'20000041', '20000041', '20000037', '20000037', '20000025', '20000025'} }
eFleets['6-2/L'][2] = { formation='复纵', eShips={'20000041', '20000041', '20000041', '20000025', '20000025', '20000025'} }
eFleets['6-2/L'][3] = { formation='单纵', eShips={'20000041', '20000018', '20000018', '20000033', '20000025', '20000055'} }

eFleets['6-2/M'] = { }
eFleets['6-2/M'][1] = { formation='复纵', eShips={'20000037', '20000037', '20000033', '20000033', '20000015', '20000015'} }
eFleets['6-2/M'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000018', '20000025', '20000025'} }
eFleets['6-2/M'][3] = { formation='单纵', eShips={'20000068', '20000067', '20000033', '20000033', '20000037', '20000037'} }

eFleets['6-3/'] = { }

eFleets['6-3/A'] = { }
eFleets['6-3/A'][1] = { formation='单纵', eShips={'20000037', '20000025', '20000022', '20000014', '20000014', '20000014'} }
eFleets['6-3/A'][2] = { formation='单纵', eShips={'20000066', '20000032', '20000022', '20000029', '20000029', '20000014'} }
eFleets['6-3/A'][3] = { formation='复纵', eShips={'20000037', '20000032', '20000032', '20000029', '20000014', '20000014'} }

eFleets['6-3/B'] = { }
eFleets['6-3/B'][1] = { formation='复纵', eShips={'20000037', '20000036', '20000022', '20000029', '20000014', '20000014'} }
eFleets['6-3/B'][2] = { formation='轮形', eShips={'20000033', '20000032', '20000022', '20000029', '20000014', '20000014'} }
eFleets['6-3/B'][3] = { formation='梯形', eShips={'20000033', '20000025', '20000022', '20000014', '20000014', '20000014'} }

eFleets['6-3/C'] = { }
eFleets['6-3/C'][1] = { formation='轮形', eShips={'20000017', '20000017', '20000066', '20000014', '20000014', '20000014'} }
eFleets['6-3/C'][2] = { formation='轮形', eShips={'20000045', '20000017', '20000032', '20000029', '20000029', '20000014'} }
eFleets['6-3/C'][3] = { formation='复纵', eShips={'20000017', '20000017', '20000032', '20000036', '20000029', '20000029'} }

eFleets['6-3/D'] = { }
eFleets['6-3/D'][1] = { formation='复纵', eShips={'20000041', '20000067', '20000066', '20000032', '20000062', '20000010'} }
eFleets['6-3/D'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000032', '20000062', '20000062', '20000010'} }
eFleets['6-3/D'][3] = { formation='梯形', eShips={'20000067', '20000067', '20000036', '20000036', '20000062', '20000010'} }

eFleets['6-3/E'] = { }
eFleets['6-3/E'][1] = { formation='梯形', eShips={'20000041', '20000067', '20000066', '20000007', '20000010', '20000010'} }
eFleets['6-3/E'][2] = { formation='梯形', eShips={'20000041', '20000037', '20000036', '20000007', '20000010', '20000010'} }
eFleets['6-3/E'][3] = { formation='梯形', eShips={'20000041', '20000025', '20000025', '20000007', '20000010', '20000010'} }

eFleets['6-3/F'] = { }
eFleets['6-3/F'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000036', '20000036', '20000022', '20000022'} }
eFleets['6-3/F'][2] = { formation='复纵', eShips={'20000041', '20000067', '20000066', '20000036', '20000022', '20000022'} }
eFleets['6-3/F'][3] = { formation='单纵', eShips={'20000067', '20000067', '20000066', '20000007', '20000010', '20000052'} }

eFleets['6-3/G'] = { }

eFleets['6-3/H'] = { }
eFleets['6-3/H'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000033', '20000037', '20000037', '20000053'} }
eFleets['6-3/H'][2] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000067', '20000037', '20000053'} }
eFleets['6-3/H'][3] = { formation='轮形', eShips={'20000018', '20000018', '20000033', '20000033', '20000025', '20000025'} }

eFleets['6-3/I'] = { }

eFleets['6-3/J'] = { }
eFleets['6-3/J'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000033', '20000033', '20000015', '20000015'} }
eFleets['6-3/J'][2] = { formation='复纵', eShips={'20000087', '20000087', '20000037', '20000030', '20000025', '20000015'} }
eFleets['6-3/J'][3] = { formation='梯形', eShips={'20000087', '20000068', '20000037', '20000033', '20000033', '20000015'} }

eFleets['6-4/'] = { }

eFleets['6-4/A'] = { }
eFleets['6-4/A'][1] = { formation='轮形', eShips={'20000037', '20000032', '20000032', '20000032', '20000014', '20000014'} }
eFleets['6-4/A'][2] = { formation='轮形', eShips={'20000067', '20000036', '20000032', '20000032', '20000029', '20000029'} }
eFleets['6-4/A'][3] = { formation='轮形', eShips={'20000017', '20000032', '20000032', '20000036', '20000029', '20000029'} }

eFleets['6-4/B'] = { }
eFleets['6-4/B'][1] = { formation='单纵', eShips={'20000037', '20000037', '20000025', '20000025', '20000007', '20000007'} }
eFleets['6-4/B'][2] = { formation='单纵', eShips={'20000067', '20000037', '20000037', '20000025', '20000022', '20000007'} }
eFleets['6-4/B'][3] = { formation='单纵', eShips={'20000037', '20000062', '20000025', '20000025', '20000007', '20000007'} }

eFleets['6-4/C'] = { }
eFleets['6-4/C'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000066', '20000007', '20000007', '20000007'} }
eFleets['6-4/C'][2] = { formation='单纵', eShips={'20000067', '20000067', '20000037', '20000036', '20000007', '20000007'} }
eFleets['6-4/C'][3] = { formation='复纵', eShips={'20000041', '20000067', '20000066', '20000007', '20000007', '20000007'} }

eFleets['6-4/D'] = { }
eFleets['6-4/D'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000037', '20000037', '20000059', '20000053'} }
eFleets['6-4/D'][2] = { formation='轮形', eShips={'20000018', '20000033', '20000033', '20000037', '20000037', '20000053'} }
eFleets['6-4/D'][3] = { formation='轮形', eShips={'20000067', '20000018', '20000033', '20000033', '20000025', '20000053'} }

eFleets['6-4/E'] = { }
eFleets['6-4/E'][1] = { formation='轮形', eShips={'20000042', '20000018', '20000033', '20000026', '20000025', '20000007'} }
eFleets['6-4/E'][2] = { formation='复纵', eShips={'20000018', '20000018', '20000033', '20000037', '20000025', '20000025'} }
eFleets['6-4/E'][3] = { formation='轮形', eShips={'20000067', '20000067', '20000018', '20000033', '20000033', '20000053'} }

eFleets['6-4/F'] = { }
eFleets['6-4/F'][1] = { formation='单纵', eShips={'20000059', '20000059', '20000059', '20000053'} }
eFleets['6-4/F'][2] = { formation='单纵', eShips={'20000059', '20000059', '20000059', '20000053', '20000052'} }
eFleets['6-4/F'][3] = { formation='复纵', eShips={'20000059', '20000059', '20000059', '20000053', '20000052', '20000052'} }

eFleets['6-4/G'] = { }
eFleets['6-4/G'][1] = { formation='复纵', eShips={'20000042', '20000042', '20000033', '20000033', '20000007', '20000007'} }
eFleets['6-4/G'][2] = { formation='复纵', eShips={'20000042', '20000067', '20000067', '20000026', '20000025', '20000007'} }
eFleets['6-4/G'][3] = { formation='轮形', eShips={'20000042', '20000018', '20000033', '20000033', '20000007', '20000007'} }

eFleets['6-4/H'] = { }
eFleets['6-4/H'][1] = { formation='单纵', eShips={'20000041', '20000086', '20000037', '20000036', '20000022', '20000022'} }
eFleets['6-4/H'][2] = { formation='复纵', eShips={'20000041', '20000086', '20000045', '20000025', '20000022', '20000022'} }
eFleets['6-4/H'][3] = { formation='单纵', eShips={'20000041', '20000018', '20000017', '20000032', '20000022', '20000052'} }

eFleets['6-4/I'] = { }
eFleets['6-4/I'][1] = { formation='轮形', eShips={'20000067', '20000030', '20000030', '20000015', '20000071', '20000071'} }
eFleets['6-4/I'][2] = { formation='复纵', eShips={'20000067', '20000030', '20000030', '20000015', '20000007', '20000007'} }
eFleets['6-4/I'][3] = { formation='轮形', eShips={'20000037', '20000030', '20000030', '20000015', '20000059', '20000053'} }

eFleets['6-4/J'] = { }

eFleets['6-4/K'] = { }
eFleets['6-4/K'][1] = { formation='单纵', eShips={'20000047', '20000087', '20000087', '20000037', '20000037', '20000004'} }

eFleets['6-4/L'] = { }
eFleets['6-4/L'][1] = { formation='复纵', eShips={'20000037', '20000033', '20000033', '20000026', '20000007', '20000007'} }
eFleets['6-4/L'][2] = { formation='单纵', eShips={'20000067', '20000033', '20000030', '20000026', '20000071', '20000071'} }
eFleets['6-4/L'][3] = { formation='单纵', eShips={'20000037', '20000030', '20000030', '20000015', '20000007', '20000071'} }

eFleets['7-1/'] = { }

eFleets['7-1/A'] = { }
eFleets['7-1/A'][1] = { formation='单纵', eShips={'20000078', '20000078', '20000093', '20000093', '20000089', '20000074'} }
eFleets['7-1/A'][2] = { formation='单纵', eShips={'20000078', '20000078', '20000077', '20000093', '20000093', '20000093'} }
eFleets['7-1/A'][3] = { formation='单纵', eShips={'20000078', '20000078', '20000077', '20000077', '20000017', '20000074'} }

eFleets['7-1/B'] = { }
eFleets['7-1/B'][1] = { formation='梯形', eShips={'20000090', '20000089', '20000093', '20000077', '20000093', '20000093'} }
eFleets['7-1/B'][2] = { formation='梯形', eShips={'20000090', '20000089', '20000093', '20000077', '20000074', '20000074'} }
eFleets['7-1/B'][3] = { formation='梯形', eShips={'20000094', '20000093', '20000093', '20000077', '20000093', '20000074'} }

eFleets['7-1/C'] = { }
eFleets['7-1/C'][1] = { formation='单纵', eShips={'20000086', '20000090', '20000094', '20000093', '20000093', '20000074'} }
eFleets['7-1/C'][2] = { formation='复纵', eShips={'20000086', '20000086', '20000074', '20000074', '20000078', '20000074'} }
eFleets['7-1/C'][3] = { formation='梯形', eShips={'20000086', '20000090', '20000090', '20000093', '20000078', '20000074'} }

eFleets['7-1/D'] = { }
eFleets['7-1/D'][1] = { formation='轮形', eShips={'20000033', '20000090', '20000094', '20000093', '20000074', '20000077'} }
eFleets['7-1/D'][2] = { formation='轮形', eShips={'20000033', '20000033', '20000094', '20000093', '20000074', '20000074'} }
eFleets['7-1/D'][3] = { formation='轮形', eShips={'20000033', '20000094', '20000094', '20000074', '20000074', '20000077'} }

eFleets['7-1/E'] = { }

eFleets['7-1/F'] = { }
eFleets['7-1/F'][1] = { formation='单纵', eShips={'20000018', '20000090', '20000094', '20000093', '20000074', '20000077'} }
eFleets['7-1/F'][2] = { formation='复纵', eShips={'20000018', '20000090', '20000094', '20000093', '20000074', '20000077'} }
eFleets['7-1/F'][3] = { formation='梯形', eShips={'20000018', '20000090', '20000094', '20000093', '20000074', '20000077'} }

eFleets['7-1/G'] = { }
eFleets['7-1/G'][1] = { formation='单纵', eShips={'20000086', '20000090', '20000094', '20000093', '20000074', '20000074'} }
eFleets['7-1/G'][2] = { formation='复纵', eShips={'20000086', '20000090', '20000094', '20000093', '20000074', '20000074'} }
eFleets['7-1/G'][3] = { formation='梯形', eShips={'20000086', '20000090', '20000094', '20000093', '20000074', '20000074'} }

eFleets['7-1/H'] = { }
eFleets['7-1/H'][1] = { formation='轮形', eShips={'20000086', '20000086', '20000094', '20000093', '20000093', '20000093'} }
eFleets['7-1/H'][2] = { formation='轮形', eShips={'20000086', '20000090', '20000090', '20000093', '20000074', '20000074'} }
eFleets['7-1/H'][3] = { formation='轮形', eShips={'20000086', '20000086', '20000074', '20000074', '20000074', '20000074'} }

eFleets['7-1/I'] = { }
eFleets['7-1/I'][1] = { formation='复纵', eShips={'20000018', '20000086', '20000095', '20000094', '20000074', '20000078'} }
eFleets['7-1/I'][2] = { formation='复纵', eShips={'20000018', '20000086', '20000095', '20000074', '20000074', '20000074'} }
eFleets['7-1/I'][3] = { formation='复纵', eShips={'20000018', '20000086', '20000095', '20000094', '20000094', '20000078'} }

eFleets['7-1/J'] = { }
eFleets['7-1/J'][1] = { formation='单纵', eShips={'20000018', '20000086', '20000086', '20000094', '20000074', '20000078'} }
eFleets['7-1/J'][2] = { formation='复纵', eShips={'20000018', '20000086', '20000086', '20000094', '20000094', '20000074'} }
eFleets['7-1/J'][3] = { formation='梯形', eShips={'20000018', '20000086', '20000086', '20000074', '20000074', '20000078'} }

eFleets['7-1/K'] = { }
eFleets['7-1/K'][1] = { formation='单纵', eShips={'20000018', '20000033', '20000090', '20000094', '20000074', '20000078'} }
eFleets['7-1/K'][2] = { formation='复纵', eShips={'20000018', '20000033', '20000095', '20000094', '20000074', '20000074'} }
eFleets['7-1/K'][3] = { formation='梯形', eShips={'20000018', '20000033', '20000095', '20000094', '20000074', '20000078'} }

eFleets['7-1/L'] = { }
eFleets['7-1/L'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000089', '20000093', '20000074'} }
eFleets['7-1/L'][2] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000089', '20000078', '20000074'} }
eFleets['7-1/L'][3] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000089', '20000078', '20000077'} }

eFleets['7-1/M'] = { }
eFleets['7-1/M'][1] = { formation='单纵', eShips={'20000018', '20000033', '20000086', '20000090', '20000094', '20000078'} }
eFleets['7-1/M'][2] = { formation='复纵', eShips={'20000018', '20000033', '20000086', '20000094', '20000094', '20000074'} }
eFleets['7-1/M'][3] = { formation='梯形', eShips={'20000018', '20000033', '20000086', '20000090', '20000074', '20000078'} }

eFleets['7-1/N'] = { }
eFleets['7-1/N'][1] = { formation='单纵', eShips={'20000019', '20000034', '20000087', '20000090', '20000094', '20000074'} }
eFleets['7-1/N'][2] = { formation='复纵', eShips={'20000019', '20000034', '20000087', '20000090', '20000094', '20000074'} }
eFleets['7-1/N'][3] = { formation='梯形', eShips={'20000019', '20000034', '20000087', '20000090', '20000094', '20000074'} }

eFleets['7-2/'] = { }

eFleets['7-2/A'] = { }
eFleets['7-2/A'][1] = { formation='单纵', eShips={'20000067', '20000085', '20000089', '20000093', '20000074', '20000077'} }
eFleets['7-2/A'][2] = { formation='单纵', eShips={'20000067', '20000085', '20000093', '20000093', '20000074', '20000074'} }
eFleets['7-2/A'][3] = { formation='单纵', eShips={'20000067', '20000085', '20000093', '20000074', '20000074', '20000077'} }

eFleets['7-2/B'] = { }
eFleets['7-2/B'][1] = { formation='单纵', eShips={'20000033', '20000032', '20000093', '20000093', '20000074', '20000074'} }
eFleets['7-2/B'][2] = { formation='单纵', eShips={'20000033', '20000089', '20000093', '20000093', '20000074', '20000077'} }
eFleets['7-2/B'][3] = { formation='单纵', eShips={'20000067', '20000089', '20000093', '20000093', '20000074', '20000074'} }

eFleets['7-2/C'] = { }

eFleets['7-2/D'] = { }
eFleets['7-2/D'][1] = { formation='单纵', eShips={'20000018', '20000090', '20000094', '20000094', '20000074', '20000077'} }
eFleets['7-2/D'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000094', '20000094', '20000074', '20000074'} }
eFleets['7-2/D'][3] = { formation='单纵', eShips={'20000018', '20000090', '20000090', '20000094', '20000078', '20000077'} }

eFleets['7-2/E'] = { }
eFleets['7-2/E'][1] = { formation='单纵', eShips={'20000018', '20000090', '20000094', '20000094', '20000078', '20000077'} }
eFleets['7-2/E'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000094', '20000094', '20000074', '20000074'} }
eFleets['7-2/E'][3] = { formation='单纵', eShips={'20000018', '20000090', '20000090', '20000094', '20000074', '20000074'} }

eFleets['7-2/F'] = { }
eFleets['7-2/F'][1] = { formation='单纵', eShips={'20000085', '20000085', '20000089', '20000089', '20000093', '20000074'} }
eFleets['7-2/F'][2] = { formation='单纵', eShips={'20000085', '20000085', '20000089', '20000089', '20000077', '20000074'} }
eFleets['7-2/F'][3] = { formation='单纵', eShips={'20000085', '20000085', '20000089', '20000089', '20000077', '20000077'} }

eFleets['7-2/G'] = { }
eFleets['7-2/G'][1] = { formation='单纵', eShips={'20000079', '20000079', '20000079', '20000079', '20000094', '20000093'} }
eFleets['7-2/G'][2] = { formation='单纵', eShips={'20000079', '20000079', '20000079', '20000094', '20000085', '20000017'} }
eFleets['7-2/G'][3] = { formation='单纵', eShips={'20000079', '20000079', '20000079', '20000079', '20000085', '20000085'} }

eFleets['7-2/H'] = { }
eFleets['7-2/H'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000018', '20000090', '20000093', '20000093'} }
eFleets['7-2/H'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000033', '20000090', '20000089', '20000074'} }
eFleets['7-2/H'][3] = { formation='单纵', eShips={'20000045', '20000045', '20000067', '20000094', '20000093', '20000074'} }

eFleets['7-2/I'] = { }

eFleets['7-2/J'] = { }
eFleets['7-2/J'][1] = { formation='单纵', eShips={'20000018', '20000033', '20000079', '20000079', '20000078', '20000078'} }
eFleets['7-2/J'][2] = { formation='单纵', eShips={'20000018', '20000087', '20000079', '20000079', '20000078', '20000078'} }
eFleets['7-2/J'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000079', '20000079', '20000078', '20000078'} }

eFleets['7-2/K'] = { }
eFleets['7-2/K'][1] = { formation='单纵', eShips={'20000087', '20000018', '20000018', '20000090', '20000090', '20000074'} }
eFleets['7-2/K'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000090', '20000094', '20000078'} }
eFleets['7-2/K'][3] = { formation='单纵', eShips={'20000018', '20000033', '20000033', '20000094', '20000094', '20000078'} }

eFleets['7-2/L'] = { }
eFleets['7-2/L'][1] = { formation='单纵', eShips={'20000018', '20000018', '20000086', '20000094', '20000074', '20000078'} }
eFleets['7-2/L'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000033', '20000094', '20000074', '20000078'} }
eFleets['7-2/L'][3] = { formation='单纵', eShips={'20000018', '20000033', '20000033', '20000033', '20000074', '20000078'} }

eFleets['7-2/M'] = { }
eFleets['7-2/M'][1] = { formation='单纵', eShips={'20000019', '20000034', '20000087', '20000090', '20000094', '20000079'} }
eFleets['7-2/M'][2] = { formation='单纵', eShips={'20000088', '20000087', '20000018', '20000090', '20000079', '20000079'} }
eFleets['7-2/M'][3] = { formation='单纵', eShips={'20000019', '20000019', '20000087', '20000095', '20000094', '20000079'} }

eFleets['7-3/'] = { }

eFleets['7-3/A'] = { }
eFleets['7-3/A'][1] = { formation='单纵', eShips={'20000067', '20000086', '20000090', '20000094', '20000074', '20000077'} }
eFleets['7-3/A'][2] = { formation='单纵', eShips={'20000018', '20000086', '20000094', '20000094', '20000078', '20000074'} }
eFleets['7-3/A'][3] = { formation='单纵', eShips={'20000067', '20000086', '20000094', '20000074', '20000074', '20000077'} }

eFleets['7-3/B'] = { }
eFleets['7-3/B'][1] = { formation='单纵', eShips={'20000033', '20000032', '20000089', '20000093', '20000074', '20000074'} }
eFleets['7-3/B'][2] = { formation='单纵', eShips={'20000033', '20000089', '20000089', '20000093', '20000074', '20000077'} }
eFleets['7-3/B'][3] = { formation='单纵', eShips={'20000067', '20000089', '20000089', '20000093', '20000074', '20000074'} }

eFleets['7-3/C'] = { }
eFleets['7-3/C'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000017', '20000032', '20000093', '20000100'} }
eFleets['7-3/C'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000032', '20000066', '20000089', '20000074'} }
eFleets['7-3/C'][3] = { formation='单纵', eShips={'20000045', '20000045', '20000066', '20000093', '20000093', '20000100'} }

eFleets['7-3/D'] = { }
eFleets['7-3/D'][1] = { formation='单纵', eShips={'20000086', '20000033', '20000101', '20000094', '20000093', '20000093'} }
eFleets['7-3/D'][2] = { formation='单纵', eShips={'20000086', '20000067', '20000101', '20000094', '20000078', '20000093'} }
eFleets['7-3/D'][3] = { formation='单纵', eShips={'20000033', '20000095', '20000101', '20000074', '20000093', '20000093'} }

eFleets['7-3/E'] = { }
eFleets['7-3/E'][1] = { formation='单纵', eShips={'20000018', '20000090', '20000094', '20000094', '20000074', '20000077'} }
eFleets['7-3/E'][2] = { formation='单纵', eShips={'20000018', '20000018', '20000090', '20000094', '20000074', '20000074'} }
eFleets['7-3/E'][3] = { formation='单纵', eShips={'20000018', '20000033', '20000094', '20000074', '20000074', '20000077'} }

eFleets['7-3/F'] = { }
eFleets['7-3/F'][1] = { formation='单纵', eShips={'20000018', '20000090', '20000094', '20000094', '20000074', '20000077'} }
eFleets['7-3/F'][2] = { formation='单纵', eShips={'20000086', '20000090', '20000094', '20000094', '20000074', '20000074'} }
eFleets['7-3/F'][3] = { formation='单纵', eShips={'20000086', '20000090', '20000094', '20000094', '20000074', '20000074'} }

eFleets['7-3/G'] = { }
eFleets['7-3/G'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000090', '20000078', '20000100'} }
eFleets['7-3/G'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000086', '20000090', '20000093', '20000100'} }
eFleets['7-3/G'][3] = { formation='单纵', eShips={'20000018', '20000033', '20000086', '20000094', '20000093', '20000100'} }

eFleets['7-3/H'] = { }
eFleets['7-3/H'][1] = { formation='单纵', eShips={'20000018', '20000087', '20000095', '20000094', '20000101', '20000101'} }
eFleets['7-3/H'][2] = { formation='单纵', eShips={'20000018', '20000091', '20000090', '20000094', '20000101', '20000101'} }
eFleets['7-3/H'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000090', '20000090', '20000101', '20000101'} }

eFleets['7-3/I'] = { }
eFleets['7-3/I'][1] = { formation='单纵', eShips={'20000086', '20000090', '20000094', '20000094', '20000074', '20000074'} }
eFleets['7-3/I'][2] = { formation='单纵', eShips={'20000086', '20000086', '20000094', '20000094', '20000093', '20000093'} }
eFleets['7-3/I'][3] = { formation='单纵', eShips={'20000086', '20000090', '20000090', '20000094', '20000074', '20000074'} }

eFleets['7-3/J'] = { }

eFleets['7-3/K'] = { }
eFleets['7-3/K'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000101', '20000101', '20000101'} }

eFleets['7-3/L'] = { }
eFleets['7-3/L'][1] = { formation='单纵', eShips={'20000087', '20000091', '20000095', '20000094', '20000094', '20000101'} }
eFleets['7-3/L'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000075', '20000075', '20000078', '20000101'} }
eFleets['7-3/L'][3] = { formation='单纵', eShips={'20000087', '20000091', '20000090', '20000094', '20000078', '20000101'} }

eFleets['7-3/M'] = { }

eFleets['7-3/N'] = { }
eFleets['7-3/N'][1] = { formation='单纵', eShips={'20000019', '20000087', '20000087', '20000091', '20000094', '20000101'} }
eFleets['7-3/N'][2] = { formation='单纵', eShips={'20000088', '20000087', '20000018', '20000091', '20000079', '20000101'} }
eFleets['7-3/N'][3] = { formation='单纵', eShips={'20000019', '20000034', '20000087', '20000095', '20000101', '20000101'} }

eFleets['7-4/'] = { }

eFleets['7-4/A'] = { }
eFleets['7-4/A'][1] = { formation='单纵', eShips={'20000090', '20000085', '20000093', '20000093', '20000074', '20000074'} }
eFleets['7-4/A'][2] = { formation='单纵', eShips={'20000045', '20000090', '20000089', '20000093', '20000074', '20000077'} }
eFleets['7-4/A'][3] = { formation='单纵', eShips={'20000074', '20000094', '20000089', '20000093', '20000074', '20000074'} }

eFleets['7-4/B'] = { }
eFleets['7-4/B'][1] = { formation='单纵', eShips={'20000045', '20000090', '20000093', '20000074', '20000093', '20000074'} }
eFleets['7-4/B'][2] = { formation='单纵', eShips={'20000045', '20000090', '20000089', '20000066', '20000077', '20000077'} }
eFleets['7-4/B'][3] = { formation='单纵', eShips={'20000045', '20000090', '20000093', '20000093', '20000093', '20000074'} }

eFleets['7-4/C'] = { }
eFleets['7-4/C'][1] = { formation='复纵', eShips={'20000086', '20000067', '20000090', '20000090', '20000093', '20000093'} }
eFleets['7-4/C'][2] = { formation='梯形', eShips={'20000086', '20000067', '20000090', '20000094', '20000078', '20000077'} }
eFleets['7-4/C'][3] = { formation='单纵', eShips={'20000086', '20000067', '20000090', '20000090', '20000074', '20000077'} }

eFleets['7-4/D'] = { }
eFleets['7-4/D'][1] = { formation='复纵', eShips={'20000045', '20000045', '20000045', '20000094', '20000074', '20000074'} }
eFleets['7-4/D'][2] = { formation='梯形', eShips={'20000045', '20000045', '20000090', '20000094', '20000074', '20000077'} }
eFleets['7-4/D'][3] = { formation='单纵', eShips={'20000045', '20000090', '20000094', '20000074', '20000074', '20000077'} }

eFleets['7-4/E'] = { }
eFleets['7-4/E'][1] = { formation='复纵', eShips={'20000086', '20000090', '20000090', '20000094', '20000078', '20000077'} }
eFleets['7-4/E'][2] = { formation='梯形', eShips={'20000086', '20000090', '20000090', '20000094', '20000074', '20000074'} }
eFleets['7-4/E'][3] = { formation='单纵', eShips={'20000086', '20000102', '20000075', '20000094', '20000074', '20000093'} }

eFleets['7-4/F'] = { }
eFleets['7-4/F'][1] = { formation='复纵', eShips={'20000086', '20000086', '20000090', '20000090', '20000078', '20000077'} }
eFleets['7-4/F'][2] = { formation='梯形', eShips={'20000018', '20000090', '20000086', '20000094', '20000093', '20000074'} }
eFleets['7-4/F'][3] = { formation='轮形', eShips={'20000018', '20000090', '20000086', '20000094', '20000093', '20000074'} }

eFleets['7-4/G'] = { }

eFleets['7-4/H'] = { }

eFleets['7-4/I'] = { }
eFleets['7-4/I'][1] = { formation='复纵', eShips={'20000018', '20000087', '20000091', '20000090', '20000090', '20000089'} }
eFleets['7-4/I'][2] = { formation='梯形', eShips={'20000018', '20000091', '20000091', '20000095', '20000074', '20000101'} }
eFleets['7-4/I'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000091', '20000095', '20000078', '20000101'} }

eFleets['7-4/J'] = { }
eFleets['7-4/J'][1] = { formation='复纵', eShips={'20000087', '20000087', '20000018', '20000090', '20000090', '20000078'} }
eFleets['7-4/J'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000018', '20000090', '20000090', '20000101'} }
eFleets['7-4/J'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000102', '20000090', '20000090', '20000078'} }

eFleets['7-4/K'] = { }
eFleets['7-4/K'][1] = { formation='复纵', eShips={'20000087', '20000091', '20000095', '20000095', '20000094', '20000101'} }
eFleets['7-4/K'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000075', '20000075', '20000078', '20000101'} }
eFleets['7-4/K'][3] = { formation='轮形', eShips={'20000087', '20000091', '20000091', '20000095', '20000078', '20000101'} }

eFleets['7-4/L'] = { }
eFleets['7-4/L'][1] = { formation='复纵', eShips={'20000087', '20000018', '20000086', '20000095', '20000078', '20000078'} }
eFleets['7-4/L'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000086', '20000090', '20000090', '20000089'} }
eFleets['7-4/L'][3] = { formation='梯形', eShips={'20000018', '20000018', '20000091', '20000090', '20000094', '20000093'} }

eFleets['7-4/M'] = { }
eFleets['7-4/M'][1] = { formation='复纵', eShips={'20000019', '20000087', '20000087', '20000091', '20000101', '20000101'} }
eFleets['7-4/M'][2] = { formation='单纵', eShips={'20000088', '20000087', '20000018', '20000091', '20000079', '20000101'} }
eFleets['7-4/M'][3] = { formation='轮形', eShips={'20000019', '20000019', '20000018', '20000091', '20000090', '20000095'} }

eFleets['7-5/'] = { }

eFleets['7-5/A'] = { }
eFleets['7-5/A'][1] = { formation='梯形', eShips={'20000037', '20000025', '20000025', '20000093', '20000074', '20000074'} }
eFleets['7-5/A'][2] = { formation='单纵', eShips={'20000037', '20000025', '20000025', '20000093', '20000074', '20000077'} }
eFleets['7-5/A'][3] = { formation='复纵', eShips={'20000037', '20000090', '20000025', '20000077', '20000077', '20000077'} }

eFleets['7-5/B'] = { }
eFleets['7-5/B'][1] = { formation='梯形', eShips={'20000037', '20000025', '20000025', '20000074', '20000074', '20000074'} }
eFleets['7-5/B'][2] = { formation='单纵', eShips={'20000067', '20000067', '20000025', '20000074', '20000074', '20000074'} }
eFleets['7-5/B'][3] = { formation='复纵', eShips={'20000033', '20000025', '20000025', '20000074', '20000074', '20000074'} }

eFleets['7-5/C'] = { }
eFleets['7-5/C'][1] = { formation='梯形', eShips={'20000090', '20000086', '20000094', '20000094', '20000074', '20000074'} }
eFleets['7-5/C'][2] = { formation='单纵', eShips={'20000045', '20000090', '20000090', '20000094', '20000074', '20000074'} }
eFleets['7-5/C'][3] = { formation='复纵', eShips={'20000075', '20000095', '20000090', '20000094', '20000074', '20000074'} }

eFleets['7-5/D'] = { }
eFleets['7-5/D'][1] = { formation='梯形', eShips={'20000067', '20000067', '20000037', '20000025', '20000007', '20000007'} }
eFleets['7-5/D'][2] = { formation='轮形', eShips={'20000041', '20000033', '20000033', '20000025', '20000025', '20000007'} }
eFleets['7-5/D'][3] = { formation='复纵', eShips={'20000041', '20000033', '20000004', '20000025', '20000025', '20000025'} }

eFleets['7-5/E'] = { }
eFleets['7-5/E'][1] = { formation='梯形', eShips={'20000041', '20000067', '20000004', '20000025', '20000059', '20000025'} }
eFleets['7-5/E'][2] = { formation='单纵', eShips={'20000033', '20000030', '20000004', '20000074', '20000025', '20000025'} }
eFleets['7-5/E'][3] = { formation='复纵', eShips={'20000067', '20000067', '20000026', '20000015', '20000007', '20000007'} }

eFleets['7-5/F'] = { }
eFleets['7-5/F'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000037', '20000095', '20000074', '20000074'} }
eFleets['7-5/F'][2] = { formation='单纵', eShips={'20000018', '20000034', '20000030', '20000075', '20000074', '20000078'} }
eFleets['7-5/F'][3] = { formation='复纵', eShips={'20000018', '20000091', '20000030', '20000030', '20000074', '20000078'} }

eFleets['7-5/G'] = { }
eFleets['7-5/G'][1] = { formation='梯形', eShips={'20000018', '20000033', '20000045', '20000037', '20000007', '20000077'} }
eFleets['7-5/G'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000067', '20000037', '20000032', '20000007'} }
eFleets['7-5/G'][3] = { formation='复纵', eShips={'20000018', '20000045', '20000033', '20000094', '20000074', '20000074'} }

eFleets['7-5/H'] = { }
eFleets['7-5/H'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000086', '20000094', '20000093', '20000074'} }
eFleets['7-5/H'][2] = { formation='单纵', eShips={'20000018', '20000018', '20000086', '20000090', '20000074', '20000077'} }
eFleets['7-5/H'][3] = { formation='复纵', eShips={'20000018', '20000018', '20000086', '20000090', '20000093', '20000074'} }

eFleets['7-5/I'] = { }
eFleets['7-5/I'][1] = { formation='单纵', eShips={'20000018', '20000018', '20000086', '20000090', '20000093', '20000074'} }
eFleets['7-5/I'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000086', '20000090', '20000093', '20000074'} }
eFleets['7-5/I'][3] = { formation='复纵', eShips={'20000018', '20000086', '20000086', '20000090', '20000093', '20000074'} }

eFleets['7-5/J'] = { }
eFleets['7-5/J'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000045', '20000045', '20000017', '20000044'} }
eFleets['7-5/J'][2] = { formation='梯形', eShips={'20000086', '20000086', '20000045', '20000045', '20000017', '20000044'} }
eFleets['7-5/J'][3] = { formation='复纵', eShips={'20000018', '20000045', '20000045', '20000090', '20000093', '20000074'} }

eFleets['7-5/K'] = { }
eFleets['7-5/K'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000018', '20000090', '20000078', '20000077'} }
eFleets['7-5/K'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000086', '20000094', '20000017', '20000077'} }
eFleets['7-5/K'][3] = { formation='梯形', eShips={'20000018', '20000018', '20000037', '20000094', '20000074', '20000074'} }

eFleets['7-5/L'] = { }
eFleets['7-5/L'][1] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }
eFleets['7-5/L'][2] = { formation='复纵', eShips={'20000018', '20000018', '20000018', '20000015', '20000089', '20000089'} }
eFleets['7-5/L'][3] = { formation='梯形', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }

eFleets['7-5/M'] = { }
eFleets['7-5/M'][1] = { formation='单纵', eShips={'20000018', '20000086', '20000086', '20000090', '20000093', '20000074'} }
eFleets['7-5/M'][2] = { formation='复纵', eShips={'20000086', '20000086', '20000018', '20000090', '20000078', '20000077'} }
eFleets['7-5/M'][3] = { formation='梯形', eShips={'20000033', '20000033', '20000086', '20000094', '20000017', '20000077'} }

eFleets['7-5/N'] = { }

eFleets['7-5/O'] = { }
eFleets['7-5/O'][1] = { formation='单纵', eShips={'20000087', '20000045', '20000045', '20000045', '20000078', '20000078'} }
eFleets['7-5/O'][2] = { formation='复纵', eShips={'20000087', '20000045', '20000045', '20000045', '20000078', '20000078'} }
eFleets['7-5/O'][3] = { formation='梯形', eShips={'20000087', '20000045', '20000045', '20000045', '20000078', '20000078'} }

eFleets['7-5/P'] = { }

eFleets['7-5/Q'] = { }
eFleets['7-5/Q'][1] = { formation='单纵', eShips={'29016109', '29016110', '29016111', '29016112', '29016113', '29016114'} }
eFleets['7-5/Q'][2] = { formation='复纵', eShips={'29016109', '29016110', '29016111', '29016112', '29016113', '29016114'} }
eFleets['7-5/Q'][3] = { formation='轮形', eShips={'29016109', '29016110', '29016111', '29016112', '29016113', '29016114'} }

eFleets['8-1/'] = { }

eFleets['8-1/A'] = { }
eFleets['8-1/A'][1] = { formation='梯形', eShips={'20000078', '20000078', '20000025', '20000093', '20000077', '20000077'} }
eFleets['8-1/A'][2] = { formation='单纵', eShips={'20000078', '20000078', '20000078', '20000077', '20000077'} }
eFleets['8-1/A'][3] = { formation='复纵', eShips={'20000037', '20000037', '20000078', '20000077', '20000077', '20000077'} }

eFleets['8-1/B'] = { }
eFleets['8-1/B'][1] = { formation='梯形', eShips={'20000037', '20000025', '20000025', '20000074', '20000074', '20000074'} }
eFleets['8-1/B'][2] = { formation='单纵', eShips={'20000067', '20000037', '20000025', '20000074', '20000074', '20000074'} }
eFleets['8-1/B'][3] = { formation='复纵', eShips={'20000033', '20000037', '20000025', '20000074', '20000074', '20000074'} }

eFleets['8-1/C'] = { }
eFleets['8-1/C'][1] = { formation='梯形', eShips={'20000091', '20000087', '20000095', '20000095', '20000074', '20000074'} }
eFleets['8-1/C'][2] = { formation='单纵', eShips={'20000045', '20000091', '20000091', '20000095', '20000074', '20000074'} }
eFleets['8-1/C'][3] = { formation='复纵', eShips={'20000075', '20000096', '20000091', '20000095', '20000074', '20000074'} }

eFleets['8-1/D'] = { }
eFleets['8-1/D'][1] = { formation='梯形', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000093'} }
eFleets['8-1/D'][2] = { formation='轮形', eShips={'20000086', '20000033', '20000033', '20000090', '20000093', '20000074'} }
eFleets['8-1/D'][3] = { formation='复纵', eShips={'20000086', '20000018', '20000018', '20000090', '20000074', '20000074'} }

eFleets['8-1/E'] = { }
eFleets['8-1/E'][1] = { formation='梯形', eShips={'20000041', '20000067', '20000004', '20000025', '20000059', '20000025'} }
eFleets['8-1/E'][2] = { formation='单纵', eShips={'20000033', '20000030', '20000004', '20000074', '20000025', '20000025'} }
eFleets['8-1/E'][3] = { formation='复纵', eShips={'20000067', '20000067', '20000026', '20000015', '20000007', '20000007'} }

eFleets['8-1/F'] = { }
eFleets['8-1/F'][1] = { formation='轮形', eShips={'20000033', '20000033', '20000075', '20000074', '20000007', '20000007'} }
eFleets['8-1/F'][2] = { formation='单纵', eShips={'20000033', '20000095', '20000094', '20000074', '20000007', '20000077'} }
eFleets['8-1/F'][3] = { formation='复纵', eShips={'20000033', '20000090', '20000026', '20000025', '20000074', '20000077'} }

eFleets['8-1/G'] = { }
eFleets['8-1/G'][1] = { formation='梯形', eShips={'20000018', '20000034', '20000045', '20000037', '20000015', '20000078'} }
eFleets['8-1/G'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000067', '20000037', '20000033', '20000007'} }
eFleets['8-1/G'][3] = { formation='复纵', eShips={'20000018', '20000045', '20000033', '20000095', '20000074', '20000074'} }

eFleets['8-1/H'] = { }
eFleets['8-1/H'][1] = { formation='轮形', eShips={'20000087', '20000096', '20000095', '20000095', '20000094', '20000074'} }
eFleets['8-1/H'][2] = { formation='单纵', eShips={'20000087', '20000091', '20000075', '20000075', '20000074', '20000078'} }
eFleets['8-1/H'][3] = { formation='复纵', eShips={'20000087', '20000091', '20000095', '20000095', '20000094', '20000074'} }

eFleets['8-1/I'] = { }
eFleets['8-1/I'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000074'} }
eFleets['8-1/I'][2] = { formation='轮形', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000074'} }
eFleets['8-1/I'][3] = { formation='复纵', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000074'} }

eFleets['8-1/J'] = { }
eFleets['8-1/J'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000045', '20000045', '20000018', '20000045'} }
eFleets['8-1/J'][2] = { formation='梯形', eShips={'20000087', '20000087', '20000045', '20000045', '20000018', '20000045'} }
eFleets['8-1/J'][3] = { formation='复纵', eShips={'20000018', '20000045', '20000045', '20000090', '20000094', '20000074'} }

eFleets['8-1/K'] = { }
eFleets['8-1/K'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000090', '20000078', '20000078'} }
eFleets['8-1/K'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000086', '20000095', '20000018', '20000078'} }
eFleets['8-1/K'][3] = { formation='梯形', eShips={'20000018', '20000018', '20000037', '20000095', '20000074', '20000074'} }

eFleets['8-1/L'] = { }
eFleets['8-1/L'][1] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }
eFleets['8-1/L'][2] = { formation='复纵', eShips={'20000088', '20000087', '20000045', '20000004', '20000090', '20000090'} }
eFleets['8-1/L'][3] = { formation='梯形', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }

eFleets['8-2/'] = { }

eFleets['8-2/A'] = { }
eFleets['8-2/A'][1] = { formation='复纵', eShips={'20000094', '20000094', '20000078', '20000077', '20000077', '20000077'} }
eFleets['8-2/A'][2] = { formation='单纵', eShips={'20000078', '20000078', '20000078', '20000077', '20000077'} }
eFleets['8-2/A'][3] = { formation='复纵', eShips={'20000037', '20000037', '20000078', '20000077', '20000077', '20000077'} }

eFleets['8-2/B'] = { }
eFleets['8-2/B'][1] = { formation='复纵', eShips={'20000074', '20000074', '20000074', '20000074', '20000074', '20000074'} }
eFleets['8-2/B'][2] = { formation='单纵', eShips={'20000094', '20000094', '20000093', '20000074', '20000074', '20000074'} }
eFleets['8-2/B'][3] = { formation='复纵', eShips={'20000094', '20000094', '20000074', '20000074', '20000074', '20000074'} }

eFleets['8-2/C'] = { }
eFleets['8-2/C'][1] = { formation='单纵', eShips={'20000094', '20000094', '20000093', '20000093', '20000093', '20000093'} }
eFleets['8-2/C'][2] = { formation='单纵', eShips={'20000094', '20000094', '20000093', '20000074', '20000074', '20000074'} }
eFleets['8-2/C'][3] = { formation='复纵', eShips={'20000094', '20000094', '20000074', '20000074', '20000074', '20000074'} }

eFleets['8-2/D'] = { }
eFleets['8-2/D'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000074'} }
eFleets['8-2/D'][2] = { formation='复纵', eShips={'20000086', '20000033', '20000033', '20000090', '20000093', '20000074'} }
eFleets['8-2/D'][3] = { formation='轮形', eShips={'20000086', '20000018', '20000018', '20000094', '20000074', '20000074'} }

eFleets['8-2/E'] = { }
eFleets['8-2/E'][1] = { formation='梯形', eShips={'20000086', '20000067', '20000067', '20000094', '20000093', '20000201'} }
eFleets['8-2/E'][2] = { formation='轮形', eShips={'20000018', '20000033', '20000090', '20000090', '20000093', '20000093'} }
eFleets['8-2/E'][3] = { formation='复纵', eShips={'20000067', '20000067', '20000090', '20000094', '20000093', '20000201'} }

eFleets['8-2/F'] = { }
eFleets['8-2/F'][1] = { formation='轮形', eShips={'20000086', '20000091', '20000033', '20000094', '20000074', '20000074'} }
eFleets['8-2/F'][2] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000090', '20000074', '20000074'} }
eFleets['8-2/F'][3] = { formation='复纵', eShips={'20000018', '20000018', '20000033', '20000033', '20000074', '20000074'} }

eFleets['8-2/G'] = { }
eFleets['8-2/G'][1] = { formation='梯形', eShips={'20000018', '20000034', '20000045', '20000090', '20000074', '20000078'} }
eFleets['8-2/G'][2] = { formation='单纵', eShips={'20000045', '20000045', '20000067', '20000090', '20000090', '20000074'} }
eFleets['8-2/G'][3] = { formation='复纵', eShips={'20000018', '20000034', '20000067', '20000090', '20000094', '20000074'} }

eFleets['8-2/H'] = { }
eFleets['8-2/H'][1] = { formation='轮形', eShips={'20000087', '20000096', '20000095', '20000095', '20000101', '20000074'} }
eFleets['8-2/H'][2] = { formation='单纵', eShips={'20000087', '20000091', '20000075', '20000075', '20000078', '20000078'} }
eFleets['8-2/H'][3] = { formation='复纵', eShips={'20000087', '20000091', '20000095', '20000095', '20000101', '20000074'} }

eFleets['8-2/I'] = { }
eFleets['8-2/I'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000091', '20000090', '20000074', '20000074'} }
eFleets['8-2/I'][2] = { formation='轮形', eShips={'20000068', '20000068', '20000091', '20000095', '20000094', '20000074'} }
eFleets['8-2/I'][3] = { formation='复纵', eShips={'20000068', '20000068', '20000095', '20000095', '20000094', '20000074'} }

eFleets['8-2/J'] = { }
eFleets['8-2/J'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000095', '20000095', '20000018', '20000032'} }
eFleets['8-2/J'][2] = { formation='梯形', eShips={'20000087', '20000087', '20000075', '20000075', '20000018', '20000032'} }
eFleets['8-2/J'][3] = { formation='复纵', eShips={'20000018', '20000018', '20000045', '20000090', '20000094', '20000074'} }

eFleets['8-2/K'] = { }
eFleets['8-2/K'][1] = { formation='复纵', eShips={'20000018', '20000091', '20000067', '20000067', '20000093', '20000074'} }
eFleets['8-2/K'][2] = { formation='单纵', eShips={'20000086', '20000086', '20000095', '20000033', '20000093', '20000093'} }
eFleets['8-2/K'][3] = { formation='轮形', eShips={'20000018', '20000086', '20000033', '20000033', '20000093', '20000074'} }

eFleets['8-2/L'] = { }
eFleets['8-2/L'][1] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }
eFleets['8-2/L'][2] = { formation='复纵', eShips={'20000087', '20000087', '20000075', '20000075', '20000090', '20000089'} }
eFleets['8-2/L'][3] = { formation='梯形', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }

eFleets['8-2/M'] = { }
eFleets['8-2/M'][1] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }
eFleets['8-2/M'][2] = { formation='复纵', eShips={'20000088', '20000087', '20000045', '20000091', '20000090', '20000079'} }
eFleets['8-2/M'][3] = { formation='轮形', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }

eFleets['8-3/'] = { }

eFleets['8-3/A'] = { }
eFleets['8-3/A'][1] = { formation='单纵', eShips={'20000067', '20000067', '20000089', '20000089', '20000022', '20000074'} }
eFleets['8-3/A'][2] = { formation='单纵', eShips={'20000086', '20000033', '20000032', '20000089', '20000089', '20000074'} }
eFleets['8-3/A'][3] = { formation='单纵', eShips={'20000086', '20000067', '20000089', '20000089', '20000022', '20000074'} }

eFleets['8-3/B'] = { }
eFleets['8-3/B'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000066', '20000074', '20000074', '20000074'} }
eFleets['8-3/B'][2] = { formation='轮形', eShips={'20000086', '20000018', '20000032', '20000025', '20000022', '20000074'} }
eFleets['8-3/B'][3] = { formation='轮形', eShips={'20000018', '20000018', '20000032', '20000089', '20000022', '20000074'} }

eFleets['8-3/C'] = { }
eFleets['8-3/C'][1] = { formation='单纵', eShips={'20000086', '20000067', '20000089', '20000089', '20000077', '20000077'} }
eFleets['8-3/C'][2] = { formation='单纵', eShips={'20000086', '20000067', '20000089', '20000089', '20000077', '20000077'} }
eFleets['8-3/C'][3] = { formation='单纵', eShips={'20000086', '20000067', '20000089', '20000089', '20000077', '20000077'} }

eFleets['8-3/D'] = { }
eFleets['8-3/D'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000086', '20000025', '20000074', '20000074'} }
eFleets['8-3/D'][2] = { formation='轮形', eShips={'20000086', '20000018', '20000033', '20000090', '20000090', '20000074'} }
eFleets['8-3/D'][3] = { formation='轮形', eShips={'20000018', '20000018', '20000067', '20000025', '20000025', '20000074'} }

eFleets['8-3/E'] = { }
eFleets['8-3/E'][1] = { formation='单纵', eShips={'20000067', '20000086', '20000090', '20000090', '20000090', '20000201'} }
eFleets['8-3/E'][2] = { formation='单纵', eShips={'20000086', '20000018', '20000033', '20000090', '20000090', '20000025'} }
eFleets['8-3/E'][3] = { formation='单纵', eShips={'20000086', '20000067', '20000090', '20000090', '20000090', '20000201'} }

eFleets['8-3/F'] = { }
eFleets['8-3/F'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000067', '20000090', '20000090', '20000078'} }
eFleets['8-3/F'][2] = { formation='单纵', eShips={'20000086', '20000018', '20000018', '20000090', '20000090', '20000078'} }
eFleets['8-3/F'][3] = { formation='单纵', eShips={'20000086', '20000067', '20000086', '20000090', '20000090', '20000078'} }

eFleets['8-3/G'] = { }
eFleets['8-3/G'][1] = { formation='单纵', eShips={'20000086', '20000086', '20000067', '20000090', '20000090', '20000078'} }
eFleets['8-3/G'][2] = { formation='单纵', eShips={'20000086', '20000086', '20000090', '20000090', '20000078', '20000078'} }
eFleets['8-3/G'][3] = { formation='单纵', eShips={'20000086', '20000086', '20000018', '20000090', '20000090', '20000025'} }

eFleets['8-3/H'] = { }
eFleets['8-3/H'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000067', '20000067', '20000090', '20000025'} }
eFleets['8-3/H'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000067', '20000090', '20000025'} }
eFleets['8-3/H'][3] = { formation='单纵', eShips={'20000018', '20000034', '20000087', '20000067', '20000067', '20000025'} }

eFleets['8-3/I'] = { }
eFleets['8-3/I'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000067', '20000090', '20000078', '20000078'} }
eFleets['8-3/I'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000033', '20000078', '20000078'} }
eFleets['8-3/I'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000087', '20000090', '20000078', '20000078'} }

eFleets['8-3/J'] = { }
eFleets['8-3/J'][1] = { formation='轮形', eShips={'20000018', '20000018', '20000067', '20000090', '20000026', '20000078'} }
eFleets['8-3/J'][2] = { formation='轮形', eShips={'20000018', '20000018', '20000033', '20000067', '20000090', '20000090'} }
eFleets['8-3/J'][3] = { formation='轮形', eShips={'20000018', '20000034', '20000087', '20000067', '20000067', '20000025'} }

eFleets['8-3/K'] = { }
eFleets['8-3/K'][1] = { formation='单纵', eShips={'22010501', '20000087', '20000087', '20000086' ,'20000026' ,'20000074'} }

eFleets['8-3/K*'] = { }
eFleets['8-3/K*'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000087', '20000067', '20000090', '20000074'} }
eFleets['8-3/K*'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000033', '20000090', '20000090'} }
eFleets['8-3/K*'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000087', '20000086', '20000026', '20000074'} }

eFleets['8-3/L'] = { }
eFleets['8-3/L'][1] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }
eFleets['8-3/L'][2] = { formation='单纵', eShips={'20000088', '20000087', '20000019', '20000018', '20000090', '20000030'} }
eFleets['8-3/L'][3] = { formation='单纵', eShips={'20000083', '20000083', '20000083', '20000015', '20000089', '20000089'} }

eFleets['8-4/'] = { }

eFleets['8-4/A'] = { }
eFleets['8-4/A'][1] = { formation='单纵', eShips={'20000067', '20000086', '20000089', '20000089', '20000022', '20000022'} }
eFleets['8-4/A'][2] = { formation='单纵', eShips={'20000086', '20000067', '20000089', '20000089', '20000089', '20000074'} }
eFleets['8-4/A'][3] = { formation='单纵', eShips={'20000067', '20000067', '20000089', '20000089', '20000089', '20000022'} }

eFleets['8-4/B'] = { }
eFleets['8-4/B'][1] = { formation='单纵', eShips={'20000018', '20000067', '20000089', '20000025', '20000022', '20000200'} }
eFleets['8-4/B'][2] = { formation='单纵', eShips={'20000018', '20000033', '20000066', '20000025', '20000022', '20000200'} }
eFleets['8-4/B'][3] = { formation='单纵', eShips={'20000018', '20000086', '20000025', '20000025', '20000022', '20000200'} }

eFleets['8-4/C'] = { }
eFleets['8-4/C'][1] = { formation='单纵', eShips={'20000087', '20000018', '20000033', '20000067', '20000074', '20000078'} }
eFleets['8-4/C'][2] = { formation='单纵', eShips={'20000087', '20000067', '20000086', '20000026', '20000025', '20000078'} }
eFleets['8-4/C'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000067', '20000026', '20000025', '20000078'} }

eFleets['8-4/D'] = { }
eFleets['8-4/D'][1] = { formation='单纵', eShips={'20000087', '20000067', '20000086', '20000026', '20000025', '20000078'} }
eFleets['8-4/D'][2] = { formation='单纵', eShips={'20000087', '20000067', '20000086', '20000026', '20000025', '20000078'} }
eFleets['8-4/D'][3] = { formation='单纵', eShips={'20000067', '20000067', '20000086', '20000090', '20000025', '20000078'} }

eFleets['8-4/E'] = { }
eFleets['8-4/E'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000206', '20000075', '20000201'} }
eFleets['8-4/E'][2] = { formation='单纵', eShips={'20000087', '20000019', '20000018', '20000206', '20000075', '20000201'} }
eFleets['8-4/E'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000206', '20000075', '20000201'} }

eFleets['8-4/F'] = { }
eFleets['8-4/F'][1] = { formation='轮形', eShips={'20000019', '20000019', '20000033', '20000067', '20000078', '20000078'} }
eFleets['8-4/F'][2] = { formation='轮形', eShips={'20000019', '20000019', '20000067', '20000090', '20000078', '20000078'} }
eFleets['8-4/F'][3] = { formation='轮形', eShips={'20000019', '20000019', '20000018', '20000030', '20000078', '20000078'} }

eFleets['8-4/G'] = { }
eFleets['8-4/G'][1] = { formation='轮形', eShips={'20000019', '20000019', '20000067', '20000067', '20000090', '20000025'} }
eFleets['8-4/G'][2] = { formation='轮形', eShips={'20000019', '20000087', '20000087', '20000067', '20000026', '20000025'} }
eFleets['8-4/G'][3] = { formation='轮形', eShips={'20000019', '20000019', '20000087', '20000067', '20000026', '20000025'} }

eFleets['8-4/H'] = { }
eFleets['8-4/H'][1] = { formation='复纵', eShips={'20000087', '20000087', '20000067', '20000090', '20000078', '20000078'} }
eFleets['8-4/H'][2] = { formation='复纵', eShips={'20000087', '20000087', '20000067', '20000067', '20000075', '20000078'} }
eFleets['8-4/H'][3] = { formation='复纵', eShips={'20000087', '20000087', '20000067', '20000090', '20000078', '20000078'} }

eFleets['8-4/I'] = { }
eFleets['8-4/I'][1] = { formation='轮形', eShips={'20000019', '20000019', '20000087', '20000067', '20000026', '20000074'} }
eFleets['8-4/I'][2] = { formation='复纵', eShips={'20000087', '20000068', '20000067', '20000090', '20000090', '20000205'} }
eFleets['8-4/I'][3] = { formation='复纵', eShips={'20000087', '20000087', '20000067', '20000030', '20000201', '20000201'} }

eFleets['8-4/J'] = { }
eFleets['8-4/J'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000087', '20000018', '20000090', '20000090'} }
eFleets['8-4/J'][2] = { formation='轮形', eShips={'20000087', '20000019', '20000018', '20000018', '20000090', '20000090'} }
eFleets['8-4/J'][3] = { formation='复纵', eShips={'20000087', '20000087', '20000018', '20000018', '20000090', '20000090'} }

eFleets['8-4/K'] = { }
eFleets['8-4/K'][1] = { formation='单纵', eShips={'20000087', '20000087', '20000018', '20000090', '20000090', '20000205'} }
eFleets['8-4/K'][2] = { formation='单纵', eShips={'20000087', '20000087', '20000067', '20000067', '20000075', '20000205'} }
eFleets['8-4/K'][3] = { formation='单纵', eShips={'20000087', '20000087', '20000087', '20000030', '20000078', '20000205'} }

eFleets['8-4/L'] = { }
eFleets['8-4/L'][1] = { formation='单纵', eShips={'20000019', '20000019', '20000087', '20000090', '20000090', '20000101'} }
eFleets['8-4/L'][2] = { formation='单纵', eShips={'20000019', '20000068', '20000087', '20000030', '20000101', '20000101'} }
eFleets['8-4/L'][3] = { formation='单纵', eShips={'20000019', '20000019', '20000087', '20000090', '20000090', '20000101'} }

eFleets['8-4/M'] = { }
eFleets['8-4/M'][1] = { formation='单纵', eShips={'20000049', '20000068', '20000068', '20000038', '20000096', '20000076'} }
eFleets['8-4/M'][2] = { formation='单纵', eShips={'20000049', '20000068', '20000068', '20000038', '20000096', '20000076'} }
eFleets['8-4/M'][3] = { formation='单纵', eShips={'20000049', '20000068', '20000068', '20000038', '20000096', '20000076'} }

eFleets['8-5/'] = { }

eFleets['8-5/A'] = { }
eFleets['8-5/A'][1] = { formation='复纵', eShips={'20000090', '20000090', '20000089', '20000089', '20000089', '20000074'} }
eFleets['8-5/A'][2] = { formation='复纵', eShips={'20000090', '20000090', '20000089', '20000089', '20000093', '20000074'} }
eFleets['8-5/A'][3] = { formation='复纵', eShips={'20000090', '20000090', '20000089', '20000089', '20000093', '20000093'} }

eFleets['8-5/B'] = { }
eFleets['8-5/B'][1] = { formation='单纵', eShips={'20000090', '20000090', '20000094', '20000093', '20000093', '20000077'} }
eFleets['8-5/B'][2] = { formation='单纵', eShips={'20000086', '20000094', '20000094', '20000074', '20000074', '20000077'} }
eFleets['8-5/B'][3] = { formation='单纵', eShips={'20000090', '20000067', '20000094', '20000074', '20000074', '20000077'} }

eFleets['8-5/C'] = { }
eFleets['8-5/C'][1] = { formation='复纵', eShips={'20000090', '20000090', '20000094', '20000093', '20000093', '20000200'} }
eFleets['8-5/C'][2] = { formation='复纵', eShips={'20000033', '20000090', '20000089', '20000093', '20000074', '20000200'} }
eFleets['8-5/C'][3] = { formation='复纵', eShips={'20000090', '20000094', '20000094', '20000074', '20000200', '20000200'} }

eFleets['8-5/D'] = { }
eFleets['8-5/D'][1] = { formation='单纵', eShips={'20000087', '20000033', '20000206', '20000033', '20000094', '20000093'} }
eFleets['8-5/D'][2] = { formation='单纵', eShips={'20000018', '20000087', '20000206', '20000075', '20000074', '20000074'} }
eFleets['8-5/D'][3] = { formation='单纵', eShips={'20000018', '20000067', '20000206', '20000094', '20000074', '20000074'} }

eFleets['8-5/E'] = { }
eFleets['8-5/E'][1] = { formation='单纵', eShips={'20000087', '20000091', '20000090', '20000033', '20000074', '20000101'} }
eFleets['8-5/E'][2] = { formation='单纵', eShips={'20000087', '20000067', '20000095', '20000075', '20000074', '20000101'} }
eFleets['8-5/E'][3] = { formation='单纵', eShips={'20000087', '20000091', '20000090', '20000090', '20000074', '20000101'} }

eFleets['8-5/F'] = { }
eFleets['8-5/F'][1] = { formation='单纵', eShips={'20000087', '20000033', '20000067', '20000075', '20000074', '20000078'} }
eFleets['8-5/F'][2] = { formation='轮形', eShips={'20000067', '20000018', '20000090', '20000075', '20000074', '20000201'} }
eFleets['8-5/F'][3] = { formation='单纵', eShips={'20000087', '20000067', '20000090', '20000075', '20000074', '20000078'} }

eFleets['8-5/G'] = { }
eFleets['8-5/G'][1] = { formation='单纵', eShips={'20000019', '20000034', '20000067', '20000090', '20000079', '20000078'} }
eFleets['8-5/G'][2] = { formation='单纵', eShips={'20000068', '20000087', '20000018', '20000095', '20000075', '20000078'} }
eFleets['8-5/G'][3] = { formation='单纵', eShips={'20000019', '20000068', '20000087', '20000095', '20000075', '20000078'} }

eFleets['8-5/H'] = { }
eFleets['8-5/H'][1] = { formation='轮形', eShips={'20000087', '20000019', '20000018', '20000095', '20000094', '20000094'} }
eFleets['8-5/H'][2] = { formation='轮形', eShips={'20000019', '20000019', '20000087', '20000033', '20000094', '20000074'} }
eFleets['8-5/H'][3] = { formation='轮形', eShips={'20000068', '20000019', '20000018', '20000090', '20000094', '20000094'} }

eFleets['8-5/I'] = { }
eFleets['8-5/I'][1] = { formation='轮形', eShips={'20000019', '20000019', '20000018'} }

eFleets['8-5/J'] = { }
eFleets['8-5/J'][1] = { formation='单纵', eShips={'20000087', '20000019', '20000067', '20000090', '20000079', '20000074'} }
eFleets['8-5/J'][2] = { formation='单纵', eShips={'20000087', '20000019', '20000087', '20000033', '20000094', '20000094'} }
eFleets['8-5/J'][3] = { formation='单纵', eShips={'20000087', '20000019', '20000018', '20000095', '20000075', '20000201'} }

eFleets['8-5/K'] = { }
eFleets['8-5/K'][1] = { formation='单纵', eShips={'20000019', '20000068', '20000018', '20000090', '20000075', '20000094'} }
eFleets['8-5/K'][2] = { formation='单纵', eShips={'20000019', '20000034', '20000067', '20000090', '20000090', '20000201'} }
eFleets['8-5/K'][3] = { formation='单纵', eShips={'20000019', '20000019', '20000087', '20000075', '20000075', '20000074'} }

eFleets['8-5/L'] = { }
eFleets['8-5/L'][1] = { formation='单纵', eShips={'20000019', '20000087', '20000067', '20000095', '20000094', '20000094'} }
eFleets['8-5/L'][2] = { formation='单纵', eShips={'20000068', '20000068', '20000067', '20000033', '20000090', '20000094'} }
eFleets['8-5/L'][3] = { formation='单纵', eShips={'20000210', '20000087', '20000067', '20000090', '20000094', '20000074'} }

eFleets['8-5/M'] = { }
eFleets['8-5/M'][1] = { formation='单纵', eShips={'20000049', '20000047', '20000047', '20000207', '20000207', '20000076'} }

eFleets['9-1/'] = { }

eFleets['9-1/A'] = { }
eFleets['9-1/A'][1] = { formation='复纵', eShips={'20000067', '20000033', '20000090', '20000025', '20000025', '20000074'} }
eFleets['9-1/A'][2] = { formation='复纵', eShips={'20000067', '20000033', '20000090', '20000090', '20000025', '20000074'} }
eFleets['9-1/A'][3] = { formation='单纵', eShips={'20000067', '20000033', '20000090', '20000090', '20000025', '20000025'} }

eFleets['9-1/B'] = { }
eFleets['9-1/B'][1] = { formation='复纵', eShips={'20000079', '20000079', '20000079', '20000078', '20000078'} }
eFleets['9-1/B'][2] = { formation='复纵', eShips={'20000079', '20000079', '20000079', '20000078', '20000074', '20000074'} }
eFleets['9-1/B'][3] = { formation='单纵', eShips={'20000079', '20000079', '20000079', '20000078', '20000093', '20000093'} }

eFleets['9-1/C'] = { }
eFleets['9-1/C'][1] = { formation='复纵', eShips={'20000067', '20000033', '20000090', '20000062', '20000074', '20000074'} }
eFleets['9-1/C'][2] = { formation='复纵', eShips={'20000067', '20000033', '20000090', '20000090', '20000074', '20000093'} }
eFleets['9-1/C'][3] = { formation='单纵', eShips={'20000067', '20000033', '20000033', '20000062', '20000093', '20000093'} }

eFleets['9-1/D'] = { }
eFleets['9-1/D'][1] = { formation='复纵', eShips={'20000091', '20000091', '20000075', '20000075', '20000075', '20000074'} }
eFleets['9-1/D'][2] = { formation='复纵', eShips={'20000091', '20000096', '20000075', '20000075', '20000075', '20000074'} }
eFleets['9-1/D'][3] = { formation='单纵', eShips={'20000091', '20000091', '20000091', '20000075', '20000075', '20000074'} }

eFleets['9-1/E'] = { }
eFleets['9-1/E'][1] = { formation='复纵', eShips={'20000087', '20000034', '20000034', '20000063', '20000095', '20000094'} }
eFleets['9-1/E'][2] = { formation='复纵', eShips={'20000068', '20000034', '20000034', '20000091', '20000095', '20000094'} }
eFleets['9-1/E'][3] = { formation='单纵', eShips={'20000087', '20000034', '20000034', '20000063', '20000095', '20000074'} }

eFleets['9-1/F'] = { }
eFleets['9-1/F'][1] = { formation='复纵', eShips={'20000080', '20000080', '20000079', '20000079', '20000079', '20000078'} }
eFleets['9-1/F'][2] = { formation='复纵', eShips={'20000080', '20000080', '20000079', '20000079', '20000079', '20000078'} }
eFleets['9-1/F'][3] = { formation='单纵', eShips={'20000080', '20000080', '20000079', '20000079', '20000079', '20000078'} }

eFleets['9-1/G'] = { }
eFleets['9-1/G'][1] = { formation='复纵', eShips={'20000087', '20000034', '20000034', '20000063', '20000090', '20000074'} }
eFleets['9-1/G'][2] = { formation='复纵', eShips={'20000087', '20000034', '20000034', '20000091', '20000095', '20000074'} }
eFleets['9-1/G'][3] = { formation='单纵', eShips={'20000068', '20000034', '20000034', '20000063', '20000095', '20000074'} }

eFleets['9-1/H'] = { }
eFleets['9-1/H'][1] = { formation='复纵', eShips={'20000207', '20000034', '20000034', '20000091', '20000075', '20000079'} }
eFleets['9-1/H'][2] = { formation='复纵', eShips={'20000088', '20000034', '20000034', '20000091', '20000095', '20000079'} }
eFleets['9-1/H'][3] = { formation='单纵', eShips={'20000084', '20000034', '20000034', '20000091', '20000075', '20000079'} }

eFleets['9-1/I'] = { }
eFleets['9-1/I'][1] = { formation='复纵', eShips={'20000207', '20000034', '20000034', '20000063', '20000075', '20000075'} }
eFleets['9-1/I'][2] = { formation='复纵', eShips={'20000084', '20000034', '20000034', '20000063', '20000075', '20000075'} }
eFleets['9-1/I'][3] = { formation='单纵', eShips={'20000207', '20000034', '20000034', '20000063', '20000095', '20000075'} }

eFleets['9-1/J'] = { }
eFleets['9-1/J'][1] = { formation='复纵', eShips={'20000207', '20000068', '20000034', '20000063', '20000062', '20000094'} }
eFleets['9-1/J'][2] = { formation='复纵', eShips={'20000207', '20000087', '20000034', '20000091', '20000090', '20000094'} }
eFleets['9-1/J'][3] = { formation='单纵', eShips={'20000207', '20000087', '20000034', '20000033', '20000090', '20000094'} }

eFleets['9-1/K'] = { }
eFleets['9-1/K'][1] = { formation='复纵', eShips={'20000084', '20000207', '20000092', '20000063', '20000063', '20000090'} }
eFleets['9-1/K'][2] = { formation='复纵', eShips={'20000084', '20000207', '20000034', '20000091', '20000091', '20000090'} }
eFleets['9-1/K'][3] = { formation='单纵', eShips={'20000084', '20000207', '20000034', '20000063', '20000063', '20000062'} }

eFleets['9-1/L'] = { }
eFleets['9-1/L'][1] = { formation='复纵', eShips={'20000068', '20000068', '20000068', '20000063', '20000202', '20000202'} }
eFleets['9-1/L'][2] = { formation='复纵', eShips={'20000068', '20000068', '20000068', '20000091', '20000091', '20000202'} }
eFleets['9-1/L'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000068', '20000063', '20000063', '20000075'} }

eFleets['9-1/M'] = { }
eFleets['9-1/M'][1] = { formation='复纵', eShips={'20000088', '20000084', '20000034', '20000091', '20000063', '20000079'} }
eFleets['9-1/M'][2] = { formation='复纵', eShips={'20000207', '20000088', '20000092', '20000034', '20000095', '20000079'} }
eFleets['9-1/M'][3] = { formation='单纵', eShips={'20000084', '20000084', '20000034', '20000091', '20000063', '20000079'} }

eFleets['9-1/N'] = { }
eFleets['9-1/N'][1] = { formation='复纵', eShips={'20000084', '20000034', '20000034', '20000034', '20000095', '20000095'} }
eFleets['9-1/N'][2] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000034', '20000091', '20000079'} }
eFleets['9-1/N'][3] = { formation='单纵', eShips={'20000088', '20000088', '20000087', '20000091', '20000095', '20000075'} }

eFleets['9-1/O'] = { }
eFleets['9-1/O'][1] = { formation='复纵', eShips={'20000049', '29019902', '20000088', '20000088', '20000034', '20000080'} }
eFleets['9-1/O'][2] = { formation='复纵', eShips={'20000049', '29019902', '20000088', '20000088', '20000034', '20000080'} }
eFleets['9-1/O'][3] = { formation='单纵', eShips={'20000049', '29019902', '20000088', '20000088', '20000034', '20000080'} }

eFleets['9-2/'] = { }

eFleets['9-2/A'] = { }
eFleets['9-2/A'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000033', '20000026', '20000025', '20000074'} }
eFleets['9-2/A'][2] = { formation='复纵', eShips={'20000045', '20000045', '20000033', '20000090', '20000025', '20000074'} }
eFleets['9-2/A'][3] = { formation='单纵', eShips={'20000045', '20000045', '20000033', '20000090', '20000025', '20000025'} }

eFleets['9-2/B'] = { }
eFleets['9-2/B'][1] = { formation='单纵', eShips={'20000068', '20000067', '20000033', '20000033', '20000201', '20000201'} }
eFleets['9-2/B'][2] = { formation='复纵', eShips={'20000068', '20000067', '20000033', '20000033', '20000201', '20000201'} }
eFleets['9-2/B'][3] = { formation='单纵', eShips={'20000068', '20000067', '20000033', '20000033', '20000201', '20000201'} }

eFleets['9-2/C'] = { }
eFleets['9-2/C'][1] = { formation='单纵', eShips={'20000091', '20000091', '20000079', '20000078', '20000078'} }
eFleets['9-2/C'][2] = { formation='复纵', eShips={'20000096', '20000095', '20000079', '20000078', '20000078', '20000078'} }
eFleets['9-2/C'][3] = { formation='单纵', eShips={'20000079', '20000079', '20000079', '20000078'} }

eFleets['9-2/D'] = { }
eFleets['9-2/D'][1] = { formation='单纵', eShips={'20000045', '20000068', '20000068', '20000030', '20000030', '20000075'} }
eFleets['9-2/D'][2] = { formation='复纵', eShips={'20000045', '20000068', '20000068', '20000075', '20000075', '20000075'} }
eFleets['9-2/D'][3] = { formation='单纵', eShips={'20000068', '20000045', '20000045', '20000075', '20000075', '20000201'} }

eFleets['9-2/E'] = { }
eFleets['9-2/E'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000034', '20000091', '20000090', '20000090'} }
eFleets['9-2/E'][2] = { formation='复纵', eShips={'20000084', '20000088', '20000034', '20000091', '20000090', '20000090'} }
eFleets['9-2/E'][3] = { formation='单纵', eShips={'20000084', '20000088', '20000034', '20000091', '20000090', '20000090'} }

eFleets['9-2/F'] = { }
eFleets['9-2/F'][1] = { formation='单纵', eShips={'20000088', '20000034', '20000091', '20000091', '20000030', '20000078'} }
eFleets['9-2/F'][2] = { formation='复纵', eShips={'20000088', '20000034', '20000091', '20000091', '20000030', '20000078'} }
eFleets['9-2/F'][3] = { formation='单纵', eShips={'20000088', '20000034', '20000091', '20000091', '20000030', '20000078'} }

eFleets['9-2/G'] = { }
eFleets['9-2/G'][1] = { formation='单纵', eShips={'20000045', '20000084', '20000087', '20000091', '20000030', '20000075'} }
eFleets['9-2/G'][2] = { formation='复纵', eShips={'20000045', '20000084', '20000087', '20000091', '20000030', '20000075'} }
eFleets['9-2/G'][3] = { formation='单纵', eShips={'20000045', '20000084', '20000087', '20000091', '20000030', '20000075'} }

eFleets['9-2/H'] = { }
eFleets['9-2/H'][1] = { formation='单纵', eShips={'20000045', '20000045', '20000034', '20000030', '20000090', '20000090'} }
eFleets['9-2/H'][2] = { formation='复纵', eShips={'20000068', '20000045', '20000068', '20000091', '20000030', '20000026'} }
eFleets['9-2/H'][3] = { formation='单纵', eShips={'20000068', '20000045', '20000068', '20000091', '20000030', '20000026'} }

eFleets['9-2/I'] = { }
eFleets['9-2/I'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000083', '20000033', '20000095', '20000201'} }
eFleets['9-2/I'][2] = { formation='复纵', eShips={'20000084', '20000084', '20000083', '20000033', '20000095', '20000201'} }
eFleets['9-2/I'][3] = { formation='单纵', eShips={'20000084', '20000084', '20000083', '20000033', '20000095', '20000201'} }

eFleets['9-2/J'] = { }
eFleets['9-2/J'][1] = { formation='单纵', eShips={'20000207', '20000088', '20000034', '20000203', '20000202', '20000079'} }
eFleets['9-2/J'][2] = { formation='复纵', eShips={'20000207', '20000088', '20000034', '20000203', '20000202', '20000079'} }
eFleets['9-2/J'][3] = { formation='单纵', eShips={'20000207', '20000088', '20000034', '20000203', '20000202', '20000079'} }

eFleets['9-2/K'] = { }
eFleets['9-2/K'][1] = { formation='单纵', eShips={'20000207', '20000084', '20000034', '20000037', '20000202', '20000202'} }
eFleets['9-2/K'][2] = { formation='复纵', eShips={'20000207', '20000084', '20000034', '20000037', '20000202', '20000202'} }
eFleets['9-2/K'][3] = { formation='单纵', eShips={'20000207', '20000084', '20000034', '20000037', '20000202', '20000202'} }

eFleets['9-2/L'] = { }
eFleets['9-2/L'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000068', '20000063', '20000202', '20000202'} }
eFleets['9-2/L'][2] = { formation='复纵', eShips={'20000068', '20000068', '20000068', '20000091', '20000091', '20000202'} }
eFleets['9-2/L'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000068', '20000063', '20000063', '20000075'} }

eFleets['9-2/M'] = { }
eFleets['9-2/M'][1] = { formation='单纵', eShips={'20000046', '20000046', '20000034', '20000083', '20000096', '20000095'} }
eFleets['9-2/M'][2] = { formation='复纵', eShips={'20000046', '20000046', '20000034', '20000083', '20000096', '20000095'} }
eFleets['9-2/M'][3] = { formation='单纵', eShips={'20000046', '20000046', '20000034', '20000083', '20000096', '20000095'} }

eFleets['9-2/N'] = { }
eFleets['9-2/N'][1] = { formation='单纵', eShips={'20000084', '20000034', '20000034', '20000091', '20000096', '20000095'} }
eFleets['9-2/N'][2] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000034', '20000091', '20000075'} }
eFleets['9-2/N'][3] = { formation='单纵', eShips={'20000088', '20000088', '20000088', '20000091', '20000096', '20000075'} }

eFleets['9-2/O'] = { }
eFleets['9-2/O'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000207', '20000034', '20000088', '20000207'} }
eFleets['9-2/O'][2] = { formation='复纵', eShips={'20000048', '20000048', '20000207', '20000034', '20000088', '20000207'} }
eFleets['9-2/O'][3] = { formation='单纵', eShips={'20000048', '20000048', '20000207', '20000034', '20000088', '20000207'} }

eFleets['9-3/'] = { }

eFleets['9-3/A'] = { }
eFleets['9-3/A'][1] = { formation='单纵', eShips={'20000030', '20000030', '20000030', '20000004', '20000015', '20000015'} }
eFleets['9-3/A'][2] = { formation='梯形', eShips={'20000030', '20000030', '20000030', '20000004', '20000015', '20000015'} }
eFleets['9-3/A'][3] = { formation='单纵', eShips={'20000030', '20000030', '20000030', '20000004', '20000015', '20000015'} }

eFleets['9-3/B'] = { }
eFleets['9-3/B'][1] = { formation='单纵', eShips={'20000068', '20000034', '20000030', '20000026', '20000015', '20000201'} }
eFleets['9-3/B'][2] = { formation='梯形', eShips={'20000068', '20000034', '20000030', '20000026', '20000015', '20000201'} }
eFleets['9-3/B'][3] = { formation='单纵', eShips={'20000068', '20000034', '20000030', '20000026', '20000015', '20000201'} }

eFleets['9-3/C'] = { }
eFleets['9-3/C'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000033', '20000004', '20000015', '20000201'} }
eFleets['9-3/C'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000033', '20000004', '20000015', '20000201'} }
eFleets['9-3/C'][3] = { formation='单纵', eShips={'20000045', '20000068', '20000067', '20000004', '20000015', '20000201'} }

eFleets['9-3/D'] = { }
eFleets['9-3/D'][1] = { formation='单纵', eShips={'20000030', '20000030', '20000030', '20000030', '20000004', '20000004'} }
eFleets['9-3/D'][2] = { formation='梯形', eShips={'20000030', '20000030', '20000030', '20000030', '20000004', '20000004'} }
eFleets['9-3/D'][3] = { formation='单纵', eShips={'20000030', '20000030', '20000030', '20000030', '20000004', '20000004'} }

eFleets['9-3/E'] = { }
eFleets['9-3/E'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000034', '20000038', '20000091', '20000091'} }
eFleets['9-3/E'][2] = { formation='梯形', eShips={'20000084', '20000088', '20000034', '20000038', '20000091', '20000091'} }
eFleets['9-3/E'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000038', '20000004', '20000004'} }

eFleets['9-3/F'] = { }
eFleets['9-3/F'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000037', '20000004', '20000004'} }
eFleets['9-3/F'][2] = { formation='梯形', eShips={'20000068', '20000046', '20000034', '20000037', '20000079', '20000202'} }
eFleets['9-3/F'][3] = { formation='复纵', eShips={'20000068', '20000046', '20000092', '20000037', '20000079', '20000202'} }

eFleets['9-3/G'] = { }
eFleets['9-3/G'][1] = { formation='单纵', eShips={'20000068', '20000046', '20000092', '20000037', '20000079', '20000202'} }
eFleets['9-3/G'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000091', '20000004', '20000079'} }
eFleets['9-3/G'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000091', '20000004', '20000079'} }

eFleets['9-3/H'] = { }
eFleets['9-3/H'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000068', '20000092', '20000004', '20000079'} }
eFleets['9-3/H'][2] = { formation='梯形', eShips={'20000088', '20000034', '20000034', '20000092', '20000091', '20000004'} }
eFleets['9-3/H'][3] = { formation='复纵', eShips={'20000088', '20000034', '20000034', '20000092', '20000091', '20000004'} }

eFleets['9-3/I'] = { }
eFleets['9-3/I'][1] = { formation='单纵', eShips={'20000088', '20000034', '20000034', '20000091', '20000091', '20000004'} }
eFleets['9-3/I'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000091', '20000095', '20000075'} }
eFleets['9-3/I'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000091', '20000095', '20000075'} }

eFleets['9-3/J'] = { }
eFleets['9-3/J'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000068', '20000091', '20000095', '20000075'} }
eFleets['9-3/J'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000068', '20000091', '20000091', '20000090'} }
eFleets['9-3/J'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000068', '20000091', '20000091', '20000090'} }

eFleets['9-3/K'] = { }
eFleets['9-3/K'][1] = { formation='单纵', eShips={'20000088', '20000068', '20000068', '20000091', '20000091', '20000090'} }
eFleets['9-3/K'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000064', '20000063', '20000075', '20000202'} }
eFleets['9-3/K'][3] = { formation='复纵', eShips={'20000068', '20000068', '20000064', '20000063', '20000075', '20000202'} }

eFleets['9-3/L'] = { }
eFleets['9-3/L'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000064', '20000064', '20000076', '20000202'} }
eFleets['9-3/L'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000068', '20000092', '20000091', '20000079'} }
eFleets['9-3/L'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000068', '20000092', '20000091', '20000079'} }

eFleets['9-3/M'] = { }
eFleets['9-3/M'][1] = { formation='单纵', eShips={'20000088', '20000068', '20000068', '20000092', '20000091', '20000079'} }
eFleets['9-3/M'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000034', '20000076', '20000076', '20000202'} }
eFleets['9-3/M'][3] = { formation='复纵', eShips={'20000068', '20000068', '20000034', '20000076', '20000076', '20000202'} }

eFleets['9-3/N'] = { }
eFleets['9-3/N'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000076', '20000076', '20000202'} }
eFleets['9-3/N'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000092', '20000091', '20000075'} }
eFleets['9-3/N'][3] = { formation='复纵', eShips={'20000088', '20000088', '20000088', '20000092', '20000096', '20000075'} }

eFleets['9-3/O'] = { }
eFleets['9-3/O'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000048', '20000084', '20000084', '20000046'} }
eFleets['9-3/O'][2] = { formation='梯形', eShips={'20000048', '20000048', '20000048', '20000084', '20000084', '20000046'} }
eFleets['9-3/O'][3] = { formation='复纵', eShips={'20000048', '20000048', '20000048', '20000084', '20000084', '20000046'} }

eFleets['9-4/'] = { }

eFleets['9-4/A'] = { }
eFleets['9-4/A'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000030', '20000004', '20000004', '20000004'} }
eFleets['9-4/A'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000030', '20000004', '20000004', '20000004'} }
eFleets['9-4/A'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000030', '20000004', '20000004', '20000004'} }

eFleets['9-4/B'] = { }
eFleets['9-4/B'][1] = { formation='单纵', eShips={'20000088', '20000088', '20000087', '20000087', '20000041', '20000041'} }
eFleets['9-4/B'][2] = { formation='梯形', eShips={'20000088', '20000088', '20000087', '20000087', '20000041', '20000041'} }
eFleets['9-4/B'][3] = { formation='单纵', eShips={'20000088', '20000088', '20000087', '20000087', '20000041', '20000041'} }

eFleets['9-4/C'] = { }
eFleets['9-4/C'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000030', '20000080', '20000202'} }
eFleets['9-4/C'][2] = { formation='梯形', eShips={'20000088', '20000088', '20000034', '20000034', '20000080', '20000202'} }
eFleets['9-4/C'][3] = { formation='单纵', eShips={'20000046', '20000068', '20000068', '20000034', '20000080', '20000202'} }

eFleets['9-4/D'] = { }
eFleets['9-4/D'][1] = { formation='单纵', eShips={'20000046', '20000046', '20000046', '20000038', '20000038', '20000037'} }
eFleets['9-4/D'][2] = { formation='梯形', eShips={'20000046', '20000046', '20000046', '20000038', '20000038', '20000037'} }
eFleets['9-4/D'][3] = { formation='单纵', eShips={'20000046', '20000046', '20000046', '20000038', '20000038', '20000037'} }

eFleets['9-4/E'] = { }
eFleets['9-4/E'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000034', '20000038', '20000092', '20000091'} }
eFleets['9-4/E'][2] = { formation='梯形', eShips={'20000207', '20000207', '20000034', '20000038', '20000092', '20000091'} }
eFleets['9-4/E'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000038', '20000092', '20000004'} }

eFleets['9-4/F'] = { }
eFleets['9-4/F'][1] = { formation='单纵', eShips={'20000207', '20000068', '20000034', '20000034', '20000004', '20000004'} }
eFleets['9-4/F'][2] = { formation='梯形', eShips={'20000068', '20000046', '20000034', '20000038', '20000080', '20000203'} }
eFleets['9-4/F'][3] = { formation='复纵', eShips={'20000068', '20000046', '20000092', '20000038', '20000080', '20000203'} }

eFleets['9-4/G'] = { }
eFleets['9-4/G'][1] = { formation='单纵', eShips={'20000207', '20000207', '20000092', '20000038', '20000038', '20000004'} }
eFleets['9-4/G'][2] = { formation='梯形', eShips={'20000207', '20000084', '20000068', '20000092', '20000004', '20000004'} }
eFleets['9-4/G'][3] = { formation='复纵', eShips={'20000207', '20000207', '20000068', '20000092', '20000004', '20000079'} }

eFleets['9-4/H'] = { }
eFleets['9-4/H'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000068', '20000092', '20000004', '20000079'} }
eFleets['9-4/H'][2] = { formation='梯形', eShips={'20000207', '20000207', '20000034', '20000092', '20000092', '20000004'} }
eFleets['9-4/H'][3] = { formation='复纵', eShips={'20000088', '20000034', '20000034', '20000092', '20000092', '20000004'} }

eFleets['9-4/I'] = { }
eFleets['9-4/I'][1] = { formation='单纵', eShips={'20000088', '20000034', '20000092', '20000092', '20000092', '20000004'} }
eFleets['9-4/I'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000075'} }
eFleets['9-4/I'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000075'} }

eFleets['9-4/J'] = { }
eFleets['9-4/J'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000076'} }
eFleets['9-4/J'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000068', '20000092', '20000092', '20000092'} }
eFleets['9-4/J'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000068', '20000092', '20000092', '20000092'} }

eFleets['9-4/K'] = { }
eFleets['9-4/K'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000068', '20000092', '20000092', '20000092'} }
eFleets['9-4/K'][2] = { formation='梯形', eShips={'20000088', '20000207', '20000068', '20000092', '20000076', '20000203'} }
eFleets['9-4/K'][3] = { formation='复纵', eShips={'20000068', '20000068', '20000068', '20000092', '20000076', '20000203'} }

eFleets['9-4/L'] = { }
eFleets['9-4/L'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000064', '20000064', '20000076', '20000203'} }
eFleets['9-4/L'][2] = { formation='梯形', eShips={'20000207', '20000207', '20000068', '20000034', '20000092', '20000080'} }
eFleets['9-4/L'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000068', '20000034', '20000092', '20000080'} }

eFleets['9-4/M'] = { }
eFleets['9-4/M'][1] = { formation='单纵', eShips={'20000088', '20000084', '20000068', '20000092', '20000092', '20000080'} }
eFleets['9-4/M'][2] = { formation='梯形', eShips={'20000068', '20000207', '20000034', '20000076', '20000076', '20000203'} }
eFleets['9-4/M'][3] = { formation='复纵', eShips={'20000068', '20000084', '20000034', '20000076', '20000076', '20000203'} }

eFleets['9-4/N'] = { }
eFleets['9-4/N'][1] = { formation='单纵', eShips={'20000084', '20000207', '20000034', '20000076', '20000076', '20000203'} }
eFleets['9-4/N'][2] = { formation='梯形', eShips={'20000207', '20000088', '20000068', '20000092', '20000092', '20000076'} }
eFleets['9-4/N'][3] = { formation='复纵', eShips={'20000088', '20000088', '20000088', '20000092', '20000096', '20000076'} }

eFleets['9-4/O'] = { }
eFleets['9-4/O'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000048', '20000048', '20000034', '20000092'} }
eFleets['9-4/O'][2] = { formation='梯形', eShips={'20000048', '20000048', '20000048', '20000048', '20000034', '20000092'} }
eFleets['9-4/O'][3] = { formation='复纵', eShips={'20000048', '20000048', '20000048', '20000048', '20000034', '20000092'} }

eFleets['9-5/'] = { }

eFleets['9-5/A'] = { }
eFleets['9-5/A'][1] = { formation='单纵', eShips={'28010405', '28010405', '28010405', '28010405', '28010405', '28010405'} }
eFleets['9-5/A'][2] = { formation='梯形', eShips={'28010405', '28010405', '28010405', '28010405', '28010405', '28010405'} }
eFleets['9-5/A'][3] = { formation='单纵', eShips={'28010405', '28010405', '28010405', '28010405', '28010405', '28010405'} }

eFleets['9-5/B'] = { }
eFleets['9-5/B'][1] = { formation='单纵', eShips={'20000080', '20000080', '20000080', '20000079'} }
eFleets['9-5/B'][2] = { formation='梯形', eShips={'20000080', '20000080', '20000080', '20000079'} }
eFleets['9-5/B'][3] = { formation='单纵', eShips={'20000080', '20000080', '20000080', '20000079'} }

eFleets['9-5/C'] = { }
eFleets['9-5/C'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000034', '20000030', '20000079', '20000202'} }
eFleets['9-5/C'][2] = { formation='梯形', eShips={'20000088', '20000088', '20000034', '20000034', '20000079', '20000202'} }
eFleets['9-5/C'][3] = { formation='单纵', eShips={'20000046', '20000068', '20000068', '20000034', '20000079', '20000202'} }

eFleets['9-5/D'] = { }
eFleets['9-5/D'][1] = { formation='单纵', eShips={'20000046', '20000046', '20000046', '20000038', '20000004', '20000004'} }
eFleets['9-5/D'][2] = { formation='梯形', eShips={'20000046', '20000046', '20000046', '20000038', '20000004', '20000004'} }
eFleets['9-5/D'][3] = { formation='单纵', eShips={'20000046', '20000046', '20000046', '20000038', '20000004', '20000004'} }

eFleets['9-5/E'] = { }
eFleets['9-5/E'][1] = { formation='单纵', eShips={'20000080', '20000080', '20000080', '20000080'} }
eFleets['9-5/E'][2] = { formation='梯形', eShips={'20000080', '20000080', '20000080', '20000080'} }
eFleets['9-5/E'][3] = { formation='单纵', eShips={'20000080', '20000080', '20000080', '20000080'} }

eFleets['9-5/F'] = { }
eFleets['9-5/F'][1] = { formation='单纵', eShips={'20000207', '20000068', '20000034', '20000034', '20000004', '20000004'} }
eFleets['9-5/F'][2] = { formation='梯形', eShips={'20000068', '20000046', '20000034', '20000038', '20000080', '20000202'} }
eFleets['9-5/F'][3] = { formation='复纵', eShips={'20000068', '20000046', '20000092', '20000038', '20000080', '20000202'} }

eFleets['9-5/G'] = { }
eFleets['9-5/G'][1] = { formation='单纵', eShips={'20000207', '20000207', '20000092', '20000038', '20000038', '20000004'} }
eFleets['9-5/G'][2] = { formation='梯形', eShips={'20000207', '20000084', '20000068', '20000092', '20000004', '20000004'} }
eFleets['9-5/G'][3] = { formation='复纵', eShips={'20000207', '20000207', '20000068', '20000092', '20000004', '20000080'} }

eFleets['9-5/H'] = { }
eFleets['9-5/H'][1] = { formation='单纵', eShips={'20000084', '20000088', '20000068', '20000092', '20000004', '20000079'} }
eFleets['9-5/H'][2] = { formation='梯形', eShips={'20000207', '20000207', '20000034', '20000092', '20000092', '20000004'} }
eFleets['9-5/H'][3] = { formation='复纵', eShips={'20000088', '20000034', '20000034', '20000092', '20000092', '20000004'} }

eFleets['9-5/I'] = { }
eFleets['9-5/I'][1] = { formation='单纵', eShips={'20000088', '20000034', '20000092', '20000092', '20000092', '20000004'} }
eFleets['9-5/I'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000075'} }
eFleets['9-5/I'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000075'} }

eFleets['9-5/J'] = { }
eFleets['9-5/J'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000068', '20000092', '20000096', '20000076'} }
eFleets['9-5/J'][2] = { formation='梯形', eShips={'20000084', '20000068', '20000068', '20000092', '20000092', '20000092'} }
eFleets['9-5/J'][3] = { formation='复纵', eShips={'20000084', '20000088', '20000068', '20000092', '20000092', '20000092'} }

eFleets['9-5/K'] = { }
eFleets['9-5/K'][1] = { formation='单纵', eShips={'20000088', '20000207', '20000068', '20000092', '20000076', '20000092'} }
eFleets['9-5/K'][2] = { formation='梯形', eShips={'20000207', '20000207', '20000068', '20000092', '20000076', '20000203'} }
eFleets['9-5/K'][3] = { formation='复纵', eShips={'20000084', '20000088', '20000092', '20000092', '20000076', '20000203'} }

eFleets['9-5/L'] = { }
eFleets['9-5/L'][1] = { formation='单纵', eShips={'20000207', '20000207', '20000068', '20000034', '20000092', '20000203'} }
eFleets['9-5/L'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000068', '20000034', '20000092', '20000080'} }
eFleets['9-5/L'][3] = { formation='复纵', eShips={'20000088', '20000084', '20000068', '20000092', '20000092', '20000080'} }

eFleets['9-5/M'] = { }
eFleets['9-5/M'][1] = { formation='单纵', eShips={'20000068', '20000207', '20000034', '20000076', '20000076', '20000080'} }
eFleets['9-5/M'][2] = { formation='梯形', eShips={'20000068', '20000084', '20000034', '20000076', '20000076', '20000203'} }
eFleets['9-5/M'][3] = { formation='复纵', eShips={'20000068', '20000084', '20000034', '20000076', '20000076', '20000203'} }

eFleets['9-5/N'] = { }
eFleets['9-5/N'][1] = { formation='单纵', eShips={'20000084', '20000207', '20000034', '20000076', '20000076', '20000203'} }
eFleets['9-5/N'][2] = { formation='梯形', eShips={'20000207', '20000088', '20000068', '20000092', '20000092', '20000076'} }
eFleets['9-5/N'][3] = { formation='复纵', eShips={'20000068', '20000084', '20000034', '20000076', '20000076', '20000076'} }

eFleets['9-5/O'] = { }
eFleets['9-5/O'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000084', '20000084', '20000084', '20000092'} }
eFleets['9-5/O'][2] = { formation='梯形', eShips={'20000048', '20000048', '20000084', '20000084', '20000084', '20000092'} }
eFleets['9-5/O'][3] = { formation='复纵', eShips={'20000048', '20000048', '20000084', '20000084', '20000084', '20000092'} }

eFleets['10-1/'] = { }

eFleets['10-1/A'] = { }
eFleets['10-1/A'][1] = { formation='单纵', eShips={'28010404', '28010404', '28010404', '28010404', '28010404', '28010404'} }
eFleets['10-1/A'][2] = { formation='梯形', eShips={'28010404', '28010404', '28010404', '28010404', '28010404', '28010404'} }
eFleets['10-1/A'][3] = { formation='单纵', eShips={'28010404', '28010404', '28010404', '28010404', '28010404', '28010404'} }

eFleets['10-1/B'] = { }
eFleets['10-1/B'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000091', '20000091', '20000075', '20000079'} }
eFleets['10-1/B'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000091', '20000091', '20000075', '20000079'} }
eFleets['10-1/B'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000091', '20000091', '20000075', '20000079'} }

eFleets['10-1/C'] = { }
eFleets['10-1/C'][1] = { formation='单纵', eShips={'20000034', '20000034', '20000034'} }
eFleets['10-1/C'][2] = { formation='梯形', eShips={'20000034', '20000034', '20000034'} }
eFleets['10-1/C'][3] = { formation='单纵', eShips={'20000034', '20000034', '20000034'} }

eFleets['10-1/D'] = { }
eFleets['10-1/D'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000092', '20000092', '20000076', '20000079'} }
eFleets['10-1/D'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000092', '20000092', '20000076', '20000079'} }
eFleets['10-1/D'][3] = { formation='单纵', eShips={'20000068', '20000068', '20000092', '20000092', '20000076', '20000079'} }

eFleets['10-1/E'] = { }
eFleets['10-1/E'][1] = { formation='单纵', eShips={'20000047', '20000046', '20000034', '20000034', '20000076', '20000076'} }
eFleets['10-1/E'][2] = { formation='梯形', eShips={'20000047', '20000046', '20000034', '20000034', '20000076', '20000076'} }
eFleets['10-1/E'][3] = { formation='单纵', eShips={'20000047', '20000046', '20000034', '20000034', '20000076', '20000076'} }

eFleets['10-1/F'] = { }
eFleets['10-1/F'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000068', '20000068', '20000080', '20000079'} }
eFleets['10-1/F'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000068', '20000068', '20000080', '20000079'} }
eFleets['10-1/F'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000068', '20000068', '20000080', '20000079'} }

eFleets['10-1/G'] = { }
eFleets['10-1/G'][1] = { formation='单纵', eShips={'20000088', '20000034', '20000068', '20000068', '20000004', '20000079'} }
eFleets['10-1/G'][2] = { formation='梯形', eShips={'20000088', '20000034', '20000068', '20000068', '20000004', '20000079'} }
eFleets['10-1/G'][3] = { formation='复纵', eShips={'20000088', '20000034', '20000068', '20000068', '20000004', '20000079'} }

eFleets['10-1/H'] = { }
eFleets['10-1/H'][1] = { formation='单纵', eShips={'20000084', '20000084', '20000034', '20000034', '20000076', '20000075'} }
eFleets['10-1/H'][2] = { formation='梯形', eShips={'20000084', '20000084', '20000034', '20000034', '20000076', '20000075'} }
eFleets['10-1/H'][3] = { formation='复纵', eShips={'20000084', '20000084', '20000034', '20000034', '20000076', '20000075'} }

eFleets['10-1/I'] = { }
eFleets['10-1/I'][1] = { formation='单纵', eShips={'20000088', '20000068', '20000076', '20000076', '20000092', '20000091'} }
eFleets['10-1/I'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000076', '20000076', '20000092', '20000091'} }
eFleets['10-1/I'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000076', '20000076', '20000092', '20000091'} }

eFleets['10-1/J'] = { }
eFleets['10-1/J'][1] = { formation='单纵', eShips={'20000047', '20000046', '20000076', '20000076', '20000076', '20000076'} }
eFleets['10-1/J'][2] = { formation='梯形', eShips={'20000047', '20000046', '20000076', '20000076', '20000076', '20000076'} }
eFleets['10-1/J'][3] = { formation='复纵', eShips={'20000047', '20000046', '20000076', '20000076', '20000076', '20000076'} }

eFleets['10-1/K'] = { }
eFleets['10-1/K'][1] = { formation='单纵', eShips={'20000088', '20000068', '20000034', '20000034', '20000080', '20000080'} }
eFleets['10-1/K'][2] = { formation='梯形', eShips={'20000088', '20000068', '20000034', '20000034', '20000080', '20000080'} }
eFleets['10-1/K'][3] = { formation='复纵', eShips={'20000088', '20000068', '20000034', '20000034', '20000080', '20000080'} }

eFleets['10-1/L'] = { }
eFleets['10-1/L'][1] = { formation='单纵', eShips={'20000068', '20000068', '20000076', '20000076', '20000203', '20000202'} }
eFleets['10-1/L'][2] = { formation='梯形', eShips={'20000068', '20000068', '20000076', '20000076', '20000203', '20000202'} }
eFleets['10-1/L'][3] = { formation='复纵', eShips={'20000068', '20000068', '20000076', '20000076', '20000203', '20000202'} }

eFleets['10-1/M'] = { }
eFleets['10-1/M'][1] = { formation='单纵', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }
eFleets['10-1/M'][2] = { formation='梯形', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }
eFleets['10-1/M'][3] = { formation='复纵', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }

eFleets['10-1/N'] = { }
eFleets['10-1/N'][1] = { formation='单纵', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }
eFleets['10-1/N'][2] = { formation='梯形', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }
eFleets['10-1/N'][3] = { formation='复纵', eShips={'20000046', '20000046', '20000096', '20000096', '20000076', '20000076'} }

eFleets['10-1/O'] = { }
eFleets['10-1/O'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000048', '20000048', '20000084', '20000084'} }
eFleets['10-1/O'][2] = { formation='梯形', eShips={'20000048', '20000048', '20000048', '20000048', '20000084', '20000084'} }
eFleets['10-1/O'][3] = { formation='复纵', eShips={'20000048', '20000048', '20000048', '20000048', '20000084', '20000084'} }

eFleets['10-1/O*'] = { }
eFleets['10-1/O*'][1] = { formation='单纵', eShips={'20000048', '20000037', '20000048', '20000048', '20000084', '20000084'} }
eFleets['10-1/O*'][2] = { formation='梯形', eShips={'20000048', '20000037', '20000048', '20000048', '20000084', '20000084'} }
eFleets['10-1/O*'][3] = { formation='复纵', eShips={'20000048', '20000037', '20000048', '20000048', '20000084', '20000084'} }

eFleets['10-1/O**'] = { }
eFleets['10-1/O**'][1] = { formation='单纵', eShips={'20000048', '20000048', '20000037', '20000048', '20000084', '20000084'} }
eFleets['10-1/O**'][2] = { formation='梯形', eShips={'20000048', '20000048', '20000037', '20000048', '20000084', '20000084'} }
eFleets['10-1/O**'][3] = { formation='复纵', eShips={'20000048', '20000048', '20000037', '20000048', '20000084', '20000084'} }
------------------------------------------------------------------

return { eShips = eShips, eFleets = eFleets }