local maps = { }

maps['1-1'] = { }

maps['1-1']['1'] = {
    '白雪',
}

maps['1-1']['2'] = {
    '敷波', 'Z21', 'Z22', '标枪', '天后',
}

maps['1-1']['3'] = {
    '沃克兰', '绫波', '基阿特',
}

maps['1-1']['4'] = {
    '天龙', '龙田', '奥马哈', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', 'Z31',
}

maps['1-1']['5'] = {
    '紫石英',
}

maps['1-2'] = { }

maps['1-2']['1'] = {
    '白雪', '深雪',
}

maps['1-2']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '标枪', '天后',
}

maps['1-2']['3'] = {
    '沃克兰', '绫波', '基阿特',
}

maps['1-2']['4'] = {
    '天龙', '龙田', '奥马哈', 'Z1', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', 'Z31',
}

maps['1-2']['5'] = {
    '紫石英',
}

maps['1-3'] = { }

maps['1-3']['1'] = {
    '白雪', '深雪',
}

maps['1-3']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '标枪', '天后',
}

maps['1-3']['3'] = {
    '沃克兰', '天龙', '龙田', '奥马哈', '绫波', '基阿特', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['1-3']['4'] = {
    'Z1', '紫石英', '大井', 'Z31', '忠武',
}

maps['1-3']['5'] = { }

maps['1-4'] = { }

maps['1-4']['1'] = {
    '白雪', '深雪',
}

maps['1-4']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '标枪', '天后',
}

maps['1-4']['3'] = {
    '沃克兰', '天龙', '龙田', '奥马哈', '绫波', '基阿特', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['1-4']['4'] = {
    'Z1', '紫石英', '高雄', '爱宕', '亚特兰大', '朱诺(CL-52)', '布鲁克林', 'Z31', '威奇塔', '忠武',
}

maps['1-4']['5'] = {
    '弗兰克·诺克斯', '鲍尔', '日向', '百眼巨人', '兰利', '博格', '堪培拉', '突击者', '宁海', '平海', '胡德',
}

maps['1-5'] = { }

maps['1-5']['1'] = { }

maps['1-5']['2'] = { }

maps['1-5']['3'] = { }

maps['1-5']['4'] = { }

maps['1-5']['5'] = { }

maps['2-1'] = { }

maps['2-1']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['2-1']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '标枪', '天后',
}

maps['2-1']['3'] = {
    '沃克兰', '天龙', '龙田', '奥马哈', '绫波', '基阿特', '高雄', '爱宕', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['2-1']['4'] = {
    '峰风', '林仙', '加拉蒂亚', '佩内洛珀', 'Z1', '日向', '百眼巨人', '摩耶', '鸟海', '大井', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '罗伯茨', '阿贝克隆比', 'Z31', '田纳西', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '夕张', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '天狼星', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['2-1']['5'] = {
    '哥萨克人', '紫石英', '弗兰克·诺克斯', '鲍尔', '声望', '晓', '响', '雷', '电', '飞鹰', '隼鹰', '罗德尼', '空想',
}

maps['2-2'] = { }

maps['2-2']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['2-2']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '标枪', '天后',
}

maps['2-2']['3'] = {
    '沃克兰', '天龙', '龙田', '奥马哈', '绫波', '基阿特', '高雄', '爱宕', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['2-2']['4'] = {
    '哥萨克人', '峰风', '林仙', '加拉蒂亚', '佩内洛珀', 'Z1', '弗兰克·诺克斯', '鲍尔', '山城', '兰利', '摩耶', '鸟海', '曙光女神', '罗伯茨', '阿贝克隆比', '晓', '响', '雷', '电', 'Z31', '田纳西', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '夕张', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '天狼星', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['2-2']['5'] = {
    '紫石英', '扶桑', '日向', '飞鹰', '隼鹰', '肇和', '吕-34', '纳尔逊', '罗德尼', '祥凤', '瑞凤', '安德烈亚·多利亚', '空想',
}

maps['2-3'] = { }

maps['2-3']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['2-3']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '天龙', '龙田', '奥马哈', '标枪', '天后', '北上', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['2-3']['3'] = {
    '沃克兰', '峰风', '林仙', '加拉蒂亚', '佩内洛珀', '绫波', '基阿特', '百眼巨人', '鸟海', '大井', '五十铃', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['2-3']['4'] = {
    '哥萨克人', 'Z1', '紫石英', '弗兰克·诺克斯', '鲍尔', '扶桑', '伊势', '兰利', '希佩尔海军上将', '昆西', '罗伯茨', '阿贝克隆比', '晓', '响', '雷', '电', 'Z31', '田纳西', '盐湖城', '休斯顿', '圣胡安', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '瑞凤', '威奇塔', '夕张', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '天狼星', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['2-3']['5'] = {
    '山城', '俄克拉荷马', '飞鹰', '隼鹰', '应瑞', '吕-34', '纳尔逊', '祥凤', '突击者', '列克星敦(CV-2)', '初月', '胡德', '安德烈亚·多利亚', '空想',
}

maps['2-4'] = { }

maps['2-4']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['2-4']['2'] = {
    '敷波', 'Z21', 'Z22', '卡辛杨', '安东尼', '布雷恩', '天龙', '龙田', '奥马哈', '标枪', '天后', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['2-4']['3'] = {
    '哥萨克人', '沃克兰', '峰风', '林仙', '加拉蒂亚', '佩内洛珀', '绫波', '基阿特', '兰利', '高雄', '爱宕', '摩耶', '鸟海', '昆西', '大井', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '晓', '响', '雷', '电', '盐湖城', '休斯顿', '威奇塔',
}

maps['2-4']['4'] = {
    'Z1', '紫石英', '弗兰克·诺克斯', '鲍尔', '扶桑', '声望', '希佩尔海军上将', '罗伯茨', '阿贝克隆比', 'Z31', '田纳西', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '祥凤', '瑞凤', '突击者', '夕张', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '胡德', '欧根亲王', '天狼星', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['2-4']['5'] = {
    '吹雪', 'Z16', '萤火虫', '基林', '伊势', '博格', '飞鹰', '隼鹰', 'M2', '妙高', '吕-34', '新墨西哥', '纳尔逊', '宁海', '平海', '初月', '哥伦比亚', '空想', '鲃鱼',
}

maps['2-5'] = { }

maps['2-5']['1'] = {
    '天龙', '龙田', '北上', '大井', '五十铃',
}

maps['2-5']['2'] = {
    '高雄', '爱宕', '摩耶', '鸟海',
}

maps['2-5']['3'] = {
    '扶桑', '山城', '伊势', '日向', '晓', '响', '雷', '电', '古鹰', '加古', '青叶', '衣笠', '祥凤', '瑞凤',
}

maps['2-5']['4'] = {
    '那珂', '秋月', '凉月', '不知火', '黑潮', '阳炎', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '飞鹰', '隼鹰', '莱比锡', '吕-34', '新墨西哥', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '初月', '哥伦比亚', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '大淀', '鲃鱼', '兴登堡',
}

maps['2-5']['5'] = {
    '雪风', '鹦鹉螺',
}

maps['2-6'] = { }

maps['2-6']['1'] = {
    '天龙', '龙田', '北上', '大井', '五十铃',
}

maps['2-6']['2'] = {
    '高雄', '爱宕', '摩耶', '鸟海',
}

maps['2-6']['3'] = {
    '扶桑', '山城', '伊势', '日向', '晓', '响', '雷', '电', '古鹰', '加古', '青叶', '衣笠', '竹',
}

maps['2-6']['4'] = {
    '川内', '神通', '那珂', '秋月', '凉月', '不知火', '黑潮', '阳炎', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '飞鹰', '隼鹰', '凤翔', '莱比锡', '妙高', '吕-34', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '初月', '哥伦比亚', '亨廷顿', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '大淀', '鹦鹉螺', '鲃鱼', '兴登堡',
}

maps['2-6']['5'] = {
    '雾岛', '香取', '忠武',
}

maps['3-1'] = { }

maps['3-1']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['3-1']['2'] = {
    'Z21', 'Z22', '天龙', '龙田', '奥马哈', '标枪', '天后', '摩耶', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['3-1']['3'] = {
    '沃克兰', '峰风', '林仙', '加拉蒂亚', '佩内洛珀', 'Z1', '基阿特', '高雄', '爱宕', '鸟海', '希佩尔海军上将', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['3-1']['4'] = {
    '哥萨克人', '弗兰克·诺克斯', '鲍尔', '德·鲁伊特', '秋月', '凉月', '晓', '响', '雷', '电', 'Z31', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '纳尔逊', '罗德尼', '海伦娜', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '天狼星', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['3-1']['5'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '宵月', '扶桑', '日向', '果敢', '空想',
}

maps['3-2'] = { }

maps['3-2']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['3-2']['2'] = {
    'Z21', 'Z22', '天龙', '龙田', '奥马哈', '标枪', '天后', '摩耶', '鸟海', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['3-2']['3'] = {
    '哥萨克人', '沃克兰', '峰风', '林仙', '加拉蒂亚', '佩内洛珀', 'Z1', '基阿特', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '希佩尔海军上将', '大井', '曙光女神', '晓', '响', '雷', '电', '欧根亲王', '天狼星',
}

maps['3-2']['4'] = {
    '黑背豺', '德·鲁伊特', '山城', '伊势', '声望', '布吕歇尔(重巡洋舰)', '昆西', 'Z31', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '纳尔逊', '海伦娜', '果敢', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['3-2']['5'] = {
    '吹雪', 'Z16', '萤火虫', '基林', '宵月', '内华达', '榛名', '肇和', '突击者', '列克星敦(CV-2)', '胡德', '安德烈亚·多利亚', '加贺', '空想',
}

maps['3-3'] = { }

maps['3-3']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['3-3']['2'] = {
    'Z21', 'Z22', '天龙', '龙田', '林仙', '加拉蒂亚', '佩内洛珀', '奥马哈', '标枪', '天后', '高雄', '爱宕', '北上', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['3-3']['3'] = {
    '哥萨克人', '沃克兰', '峰风', 'Z1', '基阿特', '弗兰克·诺克斯', '鲍尔', '德·鲁伊特', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '晓', '响', '雷', '电', '海伦娜', '天狼星',
}

maps['3-3']['4'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '扶桑', '山城', '日向', '俄克拉荷马', '声望', '布吕歇尔(重巡洋舰)', 'Z31', '博格', '盐湖城', '休斯顿', '圣胡安', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '纳尔逊', '罗德尼', '祥凤', '瑞凤', '突击者', '威奇塔', '果敢', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '胡德', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['3-3']['5'] = {
    '伊势', '内华达', '榛名', '反击', '百眼巨人', '应瑞', '关岛', '赤城', '空想',
}

maps['3-4'] = { }

maps['3-4']['1'] = {
    '白雪', '初雪', '深雪',
}

maps['3-4']['2'] = {
    'Z21', 'Z22', '天龙', '龙田', '林仙', '加拉蒂亚', '佩内洛珀', '奥马哈', '标枪', '天后', '高雄', '爱宕', '昆西', '北上', '大井', '五十铃', '柯尼斯堡', '卡尔斯鲁厄', '科隆', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['3-4']['3'] = {
    '哥萨克人', '沃克兰', '峰风', 'Z1', '基阿特', '弗兰克·诺克斯', '鲍尔', '德·鲁伊特', '扶桑', '声望', '摩耶', '鸟海', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '盐湖城', '休斯顿', '威奇塔', '海伦娜', '果敢', '欧根亲王', '天狼星',
}

maps['3-4']['4'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '山城', '伊势', '日向', '反击', 'Z31', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '罗德尼', '瑞凤', '列克星敦(CV-2)', '安东尼奥·达诺利', '三隈', '熊野', '岚', '江原', '胡德', '关岛', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '彼得·施特拉塞尔', '兴登堡',
}

maps['3-4']['5'] = {
    'M2', '哈曼', '突击者', '宁海', '平海', '卡米契亚·内拉', '威尔士亲王', '安德烈亚·多利亚', '赤城', '加贺', '空想',
}

maps['4-1'] = { }

maps['4-1']['1'] = {
    '奥马哈', '白雪', '初雪', '深雪', '北上',
}

maps['4-1']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '摩耶', '鸟海', '希佩尔海军上将', '大井', '五十铃', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['4-1']['3'] = {
    'Z1', '弗兰克·诺克斯', '鲍尔', '扶桑', '高雄', '爱宕', '祥凤', '欧根亲王', '天狼星',
}

maps['4-1']['4'] = {
    '哥萨克人', '德·鲁伊特', '秋月', '凉月', '山城', '伊势', '内华达', '俄克拉荷马', '晓', '响', '雷', '电', 'Z31', '博格', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '威奇塔', '海伦娜', '果敢', '安东尼奥·达诺利', '岚', '江原', '胡德', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['4-1']['5'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '宵月', '日向', '斯佩伯爵海军上将', '法迪布鲁诺', '空想',
}

maps['4-2'] = { }

maps['4-2']['1'] = {
    '白雪', '初雪', '深雪', '北上',
}

maps['4-2']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '摩耶', '鸟海', '希佩尔海军上将', '大井', '五十铃', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['4-2']['3'] = {
    '哥萨克人', 'Z1', '弗兰克·诺克斯', '鲍尔', '山城', '高雄', '爱宕', '晓', '响', '雷', '电', '圣胡安', '祥凤', '果敢', '天狼星',
}

maps['4-2']['4'] = {
    '德·鲁伊特', '宵月', '扶桑', '伊势', '日向', '内华达', '布吕歇尔(重巡洋舰)', '昆西', 'Z31', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '罗德尼', '瑞凤', '海伦娜', '安东尼奥·达诺利', '岚', '江原', '胡德', '威尔士亲王', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['4-2']['5'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '反击', '百眼巨人', '肇和', '斯佩伯爵海军上将', '奥斯塔公爵', '赤城', '空想', '卡约·杜伊里奥',
}

maps['4-3'] = { }

maps['4-3']['1'] = {
    '白雪', '初雪', '深雪', '北上',
}

maps['4-3']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '五十铃', '曙光女神', '亚特兰大', '朱诺(CL-52)', '布鲁克林',
}

maps['4-3']['3'] = {
    '哥萨克人', 'Z1', '弗兰克·诺克斯', '鲍尔', '德·鲁伊特', '山城', '昆西', '晓', '响', '雷', '电', '祥凤', '威奇塔', '海伦娜', '果敢', '天狼星',
}

maps['4-3']['4'] = {
    '吹雪', 'Z16', '萤火虫', '基林', '扶桑', '日向', '俄克拉荷马', '反击', '布吕歇尔(重巡洋舰)', 'Z31', '博格', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '纳尔逊', '瑞凤', '列克星敦(CV-2)', '斯佩伯爵海军上将', '安东尼奥·达诺利', '岚', '江原', '法迪布鲁诺', '胡德', '威尔士亲王', '欧根亲王', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['4-3']['5'] = {
    '伊势', '舍尔海军上将', '应瑞', '堪培拉', '关岛', '加贺', '空想', '卡约·杜伊里奥',
}

maps['4-4'] = { }

maps['4-4']['1'] = {
    '白雪', '初雪', '深雪', '北上',
}

maps['4-4']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '五十铃', '曙光女神', '天狼星',
}

maps['4-4']['3'] = {
    '哥萨克人', 'Z1', '德·鲁伊特', '扶桑', '山城', '伊势', '日向', '反击', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '盐湖城', '休斯顿', '瑞凤', '威奇塔', '海伦娜', '果敢', '胡德', '欧根亲王',
}

maps['4-4']['4'] = {
    '吹雪', 'Z16', '萤火虫', '基林', 'Z31', '博格', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '纳尔逊', '突击者', '列克星敦(CV-2)', '斯佩伯爵海军上将', '安东尼奥·达诺利', '岚', '江原', '奥斯塔公爵', '威尔士亲王', '关岛', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['4-4']['5'] = {
    '内华达', '德意志(装甲舰)', '舍尔海军上将', 'M2', '堪培拉', '宁海', '平海', '卡米契亚·内拉', 'B65', '赤城', '加贺', '空想', '卡约·杜伊里奥',
}

maps['5-1'] = { }

maps['5-1']['1'] = {
    '白雪', '初雪', '深雪', '北上',
}

maps['5-1']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '大井', '五十铃', '曙光女神', '天狼星',
}

maps['5-1']['3'] = {
    '哥萨克人', 'Z1', '山城', '内华达', '百眼巨人', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '圣胡安', '瑞凤', '威奇塔', '海伦娜', '果敢', '胡德', '欧根亲王',
}

maps['5-1']['4'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '秋月', '凉月', '扶桑', '伊势', '日向', '声望', '反击', 'Z31', '博格', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '罗德尼', '列克星敦(CV-2)', '安东尼奥·达诺利', '岚', '江原', '史密斯', '安德烈亚·多利亚', '塔什干', '大青花鱼', 'U-505', '约克公爵', '卡约·杜伊里奥', '瑞鹤', '翔鹤', '兴登堡',
}

maps['5-1']['5'] = {
    '爱丽', '赤城', '空想',
}

maps['5-2'] = { }

maps['5-2']['1'] = {
    '白雪', '初雪', '深雪', '北上',
}

maps['5-2']['2'] = {
    'Z21', 'Z22', '沃克兰', '林仙', '加拉蒂亚', '佩内洛珀', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '大井', '五十铃', '曙光女神', '天狼星',
}

maps['5-2']['3'] = {
    '哥萨克人', 'Z1', '扶桑', '伊势', '日向', '内华达', '声望', '反击', '百眼巨人', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '祥凤', '瑞凤', '威奇塔', '海伦娜', '果敢', '胡德', '欧根亲王',
}

maps['5-2']['4'] = {
    '吹雪', 'Z16', '萤火虫', '黑背豺', '基林', '山城', 'Z31', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '罗德尼', '安东尼奥·达诺利', '岚', '江原', '史密斯', '安德烈亚·多利亚', '塔什干', '大青花鱼', 'U-505', '约克公爵', '卡约·杜伊里奥', '瑞鹤', '翔鹤', '兴登堡',
}

maps['5-2']['5'] = {
    '舍尔海军上将', '爱丽', '列克星敦(CV-2)', '乌戈里尼·维瓦尔迪', '加贺', '空想', '乔治·埃夫洛夫',
}

maps['5-3'] = { }

maps['5-3']['1'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '北上', '五十铃', '曙光女神', '天狼星',
}

maps['5-3']['2'] = {
    'Z21', 'Z22', '沃克兰', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西',
}

maps['5-3']['3'] = {
    '哥萨克人', 'Z1', '黑背豺', '扶桑', '山城', '伊势', '日向', '内华达', '俄克拉荷马', '反击', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '圣胡安', '祥凤', '威奇塔', '果敢', '欧根亲王',
}

maps['5-3']['4'] = {
    '吹雪', 'Z16', '萤火虫', '基林', '撒切尔', '沙利文', '西格斯比', 'Z31', '普林斯顿', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', 'M2', '纳尔逊', '罗德尼', '安东尼奥·达诺利', '岚', '江原', '史密斯', '胡德', '关岛', '塔什干', '大青花鱼', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '兴登堡',
}

maps['5-3']['5'] = {
    '巨像', '德意志(装甲舰)', '肇和', '新墨西哥', '大黄蜂', '斯佩伯爵海军上将', '库欣', '奥斯塔公爵', '法迪布鲁诺', '赤城', '空想', '乔治·埃夫洛夫',
}

maps['5-4'] = { }

maps['5-4']['1'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '北上', '五十铃', '曙光女神', '天狼星',
}

maps['5-4']['2'] = {
    'Z21', 'Z22', '沃克兰', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '大井', '圣胡安',
}

maps['5-4']['3'] = {
    '哥萨克人', 'Z1', '黑背豺', '扶桑', '山城', '伊势', '日向', '内华达', '俄克拉荷马', '声望', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '博格', '祥凤', '威奇塔', '果敢', '欧根亲王',
}

maps['5-4']['4'] = {
    '吹雪', 'Z16', '萤火虫', '基林', '撒切尔', '沙利文', '西格斯比', 'Z31', '普林斯顿', '舍尔海军上将', '盐湖城', '休斯顿', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '加纳里亚斯', '罗德尼', '安东尼奥·达诺利', '乌戈里尼·维瓦尔迪', '岚', '江原', '法迪布鲁诺', '史密斯', 'B65', '胡德', '威尔士亲王', '安德烈亚·多利亚', '关岛', '塔什干', '大青花鱼', 'U-505', '约克公爵', '卡约·杜伊里奥', '瑞鹤', '翔鹤', '兴登堡',
}

maps['5-4']['5'] = {
    '独角兽', '应瑞', 'M2', '大黄蜂', '库欣', '加贺', '空想',
}

maps['5-5'] = { }

maps['5-5']['1'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '北上', '五十铃', '曙光女神', '天狼星',
}

maps['5-5']['2'] = {
    'Z21', 'Z22', '沃克兰', '标枪', '天后', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '希佩尔海军上将', '昆西', '大井', '圣胡安',
}

maps['5-5']['3'] = {
    '哥萨克人', 'Z1', '黑背豺', '撒切尔', '沙利文', '西格斯比', '扶桑', '山城', '伊势', '日向', '内华达', '俄克拉荷马', '反击', '布吕歇尔(重巡洋舰)', '晓', '响', '雷', '电', '博格', '普林斯顿', '盐湖城', '休斯顿', '瑞凤', '威奇塔', '果敢', '欧根亲王',
}

maps['5-5']['4'] = {
    '吹雪', 'Z16', '萤火虫', '基林', 'Z31', '巨像', '舍尔海军上将', 'Z3', '波特', '絮库夫', '伊丽莎白女王', '莱比锡', '门德斯·努涅斯', '坎伯兰', '新墨西哥', '纳尔逊', '突击者', '卡米契亚·内拉', '安东尼奥·达诺利', '竞技神', '岚', '江原', '奥斯塔公爵', '加里波第', '史密斯', '胡德', '威尔士亲王', '安德烈亚·多利亚', '关岛', '赤城', '塔什干', '大青花鱼', 'U-505', '约克公爵', '卡约·杜伊里奥', '瑞鹤', '翔鹤', '兴登堡',
}

maps['5-5']['5'] = {
    '独角兽', '德意志(装甲舰)', '堪培拉', '大黄蜂', '宁海', '平海', '斯佩伯爵海军上将', '库欣', '哥伦比亚', '空想',
}

maps['6-1'] = { }

maps['6-1']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '沃克兰', '弗兰克·诺克斯', '鲍尔',
}

maps['6-1']['2'] = {
    'Z21', 'Z22', 'Z16', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '彭萨科拉', '新奥尔良', '圣胡安',
}

maps['6-1']['3'] = {
    '反击', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', 'Z31', '博格', '普林斯顿', '威奇塔', '果敢', '维那莫依嫩', '斯普利特', '胡德', '欧根亲王',
}

maps['6-1']['4'] = {
    '紫石英', '基林', '军团', '兰利', '维纳斯', 'M2', '列克星敦(CV-2)', '海伦娜', '索玛雷兹', 'U-47', '竞技神', '加里波第', '安德烈亚·多利亚',
}

maps['6-1']['5'] = {
    '翡翠', '进取', '巨像', '迪凯纳', '斯佩伯爵海军上将', '古斯塔夫五世', '巴夫勒尔', '塞班', '空想',
}

maps['6-2'] = { }

maps['6-2']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '沃克兰', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['6-2']['2'] = {
    'Z21', 'Z22', 'Z16', '高雄', '爱宕', '摩耶', '鸟海', '昆西', '盐湖城', '休斯顿', '圣胡安',
}

maps['6-2']['3'] = {
    '内华达', '俄克拉荷马', '声望', '反击', '百眼巨人', '兰利', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', 'Z31', '博格', '普林斯顿', '罗德尼', '威奇塔', '维那莫依嫩', '斯普利特', '胡德', '欧根亲王',
}

maps['6-2']['4'] = {
    '爱斯基摩人', '旁遮普人', '紫石英', '基林', '翡翠', '进取', '军团', '独角兽', '维纳斯', 'M2', '列克星敦(CV-2)', '索玛雷兹', 'U-47', '竞技神', '加里波第', '塞班', '安德烈亚·多利亚', '关岛',
}

maps['6-2']['5'] = {
    '皇家橡树', '舍尔海军上将', '勇敢', '贝亚恩', '安东尼奥·达诺利', '巴夫勒尔', '哥特兰', '俾斯麦', '空想',
}

maps['6-3'] = { }

maps['6-3']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '沃克兰', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['6-3']['2'] = {
    'Z21', 'Z22', 'Z16', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '昆西', '盐湖城', '休斯顿', '圣胡安', '果敢',
}

maps['6-3']['3'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '内华达', '俄克拉荷马', '声望', '反击', '百眼巨人', '兰利', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', 'Z31', 'M2', '纳尔逊', '罗德尼', '威奇塔', '夕张', '欧根亲王', '天狼星',
}

maps['6-3']['4'] = {
    '爱斯基摩人', '旁遮普人', '紫石英', '基林', '亚特兰大', '朱诺(CL-52)', '皇家橡树', '德意志(装甲舰)', '阿卡司塔', '埃德加·居内', '堪培拉', '迪凯纳', '列克星敦(CV-2)', '海伦娜', '卡米契亚·内拉', '竞技神', '龙骑兵', '斯普利特', '奥斯塔公爵', '法迪布鲁诺', '加里波第', '赤城',
}

maps['6-3']['5'] = {
    '巨像', '光荣(大型轻巡洋舰)', '热心', '坎伯兰', '厌战', '沙恩霍斯特', '斯佩伯爵海军上将', '乌戈里尼·维瓦尔迪', '古斯塔夫五世', '扎拉', 'U-81', '哥特兰', '塞班', '空想',
}

maps['6-4'] = { }

maps['6-4']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '沃克兰', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['6-4']['2'] = {
    'Z21', 'Z22', 'Z16', '弗兰克·诺克斯', '鲍尔', '高雄', '爱宕', '摩耶', '鸟海', '昆西', '盐湖城', '休斯顿', '圣胡安', '果敢',
}

maps['6-4']['3'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '内华达', '俄克拉荷马', '声望', '反击', '百眼巨人', '兰利', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', 'Z31', 'M2', '纳尔逊', '罗德尼', '威奇塔', '夕张', '胡德', '欧根亲王', '天狼星',
}

maps['6-4']['4'] = {
    '爱斯基摩人', '旁遮普人', '紫石英', '基林', '亚特兰大', '朱诺(CL-52)', '独角兽', '德意志(装甲舰)', '热心', '萨福克', '堪培拉', '突击者', '列克星敦(CV-2)', '斯佩伯爵海军上将', '卡米契亚·内拉', '古斯塔夫五世', '竞技神', '龙骑兵', '加里波第', '塞班', '安德烈亚·多利亚', '关岛', '赤城',
}

maps['6-4']['5'] = {
    '布鲁克林', '舍尔海军上将', '光荣(大型轻巡洋舰)', '阿卡司塔', '贝亚恩', '坎伯兰', '沙恩霍斯特', '安东尼奥·达诺利', '乌戈里尼·维瓦尔迪', '扎拉', 'U-81', '哥特兰', '俾斯麦', '空想',
}

maps['7-1'] = { }

maps['7-1']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '弗兰克·诺克斯', '卡尔斯鲁厄', '科隆', '夕张', '天狼星',
}

maps['7-1']['2'] = {
    'Z21', 'Z22', '林仙', '佩内洛珀', 'Z16', '标枪', '天后', '鲍尔', '昆西', '柯尼斯堡', '曙光女神', '盐湖城', '休斯顿', '圣胡安', '海达人',
}

maps['7-1']['3'] = {
    '加拉蒂亚', '黑背豺', '内华达', '俄克拉荷马', '声望', '反击', '百眼巨人', '希佩尔海军上将', '亚特兰大', 'Z31', '塔斯卡卢萨', '威奇塔', '拉菲(DD-459)', '胡德', '欧根亲王',
}

maps['7-1']['4'] = {
    '旁遮普人', '萤火虫', '基林', '兰利', '朱诺(CL-52)', '维纳斯', '贝亚恩', '圣女贞德', '加纳里亚斯', '门德斯·努涅斯', '埃德加·居内', '堪培拉', '列克星敦(CV-2)', '海伦娜', '索玛雷兹', '古斯塔夫五世', '圣路易斯', '斯普利特', '关岛',
}

maps['7-1']['5'] = {
    '翡翠', '军团', '巨像', '舍尔海军上将', '坎伯兰', '巴夫勒尔', '马伊·布雷泽', '彼得·施特拉塞尔',
}

maps['7-2'] = { }

maps['7-2']['1'] = {
    '安东尼', '弗兰克·诺克斯', '鲍尔', '科隆', '夕张', '天狼星',
}

maps['7-2']['2'] = {
    'Z22', 'Z16', '标枪', '黑背豺', '百眼巨人', '昆西', '柯尼斯堡', '曙光女神',
}

maps['7-2']['3'] = {
    '加拉蒂亚', '基林', '内华达', '俄克拉荷马', '兰利', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', '亚特兰大', '朱诺(CL-52)', '巨像', '维纳斯', '瓜达卡纳尔', '塔斯卡卢萨', '爱丽', '埃德加·居内', '威奇塔', '海伦娜', '拉菲(DD-459)', '史密斯', '马伊·布雷泽', '欧根亲王',
}

maps['7-2']['4'] = {
    '萤火虫', '德意志(装甲舰)', '舍尔海军上将', '贝亚恩', '奥克兰', '圣女贞德', '堪培拉', '列克星敦(CV-2)', '索玛雷兹', '古斯塔夫五世', '胡德', '关岛', '乔治·埃夫洛夫', '彼得·施特拉塞尔',
}

maps['7-2']['5'] = {
    '坎伯兰', 'U-156', '巴夫勒尔', '七省联盟',
}

maps['7-3'] = { }

maps['7-3']['1'] = {
    '安东尼', '弗兰克·诺克斯', '鲍尔', '科隆', '夕张', '天狼星',
}

maps['7-3']['2'] = {
    '加拉蒂亚', 'Z16', '标枪', '黑背豺', '百眼巨人', '希佩尔海军上将', '昆西', '柯尼斯堡', '曙光女神',
}

maps['7-3']['3'] = {
    '萤火虫', '内华达', '俄克拉荷马', '兰利', '布吕歇尔(重巡洋舰)', '亚特兰大', '朱诺(CL-52)', '维纳斯', '阿贾克斯', '塔斯卡卢萨', '威奇塔', '海伦娜', '拉菲(DD-459)', '加里波第', '史密斯', '马伊·布雷泽', '欧根亲王',
}

maps['7-3']['4'] = {
    '德意志(装甲舰)', '舍尔海军上将', '贝亚恩', '圣女贞德', '埃德加·居内', '列克星敦(CV-2)', '索玛雷兹', '古斯塔夫五世', '诺福克(78)', '斯特雷特', '斯普利特', '胡德', '关岛', '彼得·施特拉塞尔', '尼古拉斯',
}

maps['7-3']['5'] = {
    '坎伯兰', '迪凯纳', 'U-156', '巴夫勒尔', '鹞鹰', '七省联盟',
}

maps['7-4'] = { }

maps['7-4']['1'] = {
    '安东尼', '弗兰克·诺克斯', '鲍尔', '科隆', '夕张', '天狼星',
}

maps['7-4']['2'] = {
    '加拉蒂亚', 'Z16', '标枪', '黑背豺', '百眼巨人', '希佩尔海军上将', '昆西', '柯尼斯堡', '曙光女神',
}

maps['7-4']['3'] = {
    '萤火虫', '内华达', '俄克拉荷马', '兰利', '布吕歇尔(重巡洋舰)', '亚特兰大', '朱诺(CL-52)', '维纳斯', '阿贾克斯', '塔斯卡卢萨', '埃德加·居内', '威奇塔', '海伦娜', '拉菲(DD-459)', '加里波第', '史密斯', '欧根亲王',
}

maps['7-4']['4'] = {
    '德意志(装甲舰)', '舍尔海军上将', '贝亚恩', '圣女贞德', '坎伯兰', '列克星敦(CV-2)', '索玛雷兹', '古斯塔夫五世', '竞技神', '扎拉', '诺福克(78)', '斯特雷特', '神鹰', '不惧(驱逐舰)', '七省联盟', '马伊·布雷泽', 'B65', '胡德', '关岛', '鹦鹉螺', '尼古拉斯',
}

maps['7-4']['5'] = {
    '迪凯纳', '维那莫依嫩', 'U-81', 'U-156', '巴夫勒尔', '鹞鹰', '龙骑兵', '忠武', '亨廷顿', '托戈',
}

maps['7-5'] = { }

maps['7-5']['1'] = {
    '安东尼', '弗兰克·诺克斯', '鲍尔', '科隆', '夕张', '天狼星',
}

maps['7-5']['2'] = {
    '加拉蒂亚', 'Z16', '标枪', '黑背豺', '百眼巨人', '希佩尔海军上将', '昆西', '柯尼斯堡', '曙光女神',
}

maps['7-5']['3'] = {
    '萤火虫', '内华达', '俄克拉荷马', '兰利', '布吕歇尔(重巡洋舰)', '亚特兰大', '朱诺(CL-52)', '波特兰', '维纳斯', '阿贾克斯', '塔斯卡卢萨', '埃德加·居内', '威奇塔', '海伦娜', '格奈森瑙', '拉菲(DD-459)', '谢菲尔德', '斯普利特', '史密斯', '欧根亲王',
}

maps['7-5']['4'] = {
    '德意志(装甲舰)', '舍尔海军上将', '贝亚恩', '吸血鬼', '圣女贞德', '坎伯兰', '列克星敦(CV-2)', '约克城', '暴怒', '索玛雷兹', '古斯塔夫五世', '竞技神', '扎拉', '诺福克(78)', '斯特雷特', '马伊·布雷泽', '亨廷顿', '胡德', '关岛', '鹦鹉螺', '鲃鱼',
}

maps['7-5']['5'] = {
    '迪凯纳', 'U-81', 'U-156', '巴夫勒尔', '鹞鹰', '龙骑兵', '忠武', '托戈',
}

maps['8-1'] = { }

maps['8-1']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '奥马哈', '基阿特', '弗兰克·诺克斯', '鲍尔',
}

maps['8-1']['2'] = {
    '睦月', '林仙', '加拉蒂亚', '佩内洛珀', '天后', '黑背豺', '撒切尔', '沙利文', '西格斯比', '百眼巨人', '兰利', '昆西', '曙光女神', '布鲁克林', '圣地亚哥',
}

maps['8-1']['3'] = {
    '萤火虫', '标枪', '基林', '山城', '内华达', '俄克拉荷马', '声望', '反击', '亚特兰大', '朱诺(CL-52)', '田纳西', '加利福尼亚', '普林斯顿', '彭萨科拉', '盐湖城', '休斯顿', '维纳斯', '贝亚恩', '白露', '村雨', '塔斯卡卢萨', '堪培拉', '科顿艾尔', '威奇塔', '科罗拉多', '马里兰', '西弗吉尼亚', '格奈森瑙', '拉菲(DD-459)', '吞武里', '时雨', '夕立', '岚', '哥特雄狮', '斯特雷特', '谢菲尔德', '闪电', '史密斯', '丹佛',
}

maps['8-1']['4'] = {
    '巨像', '独角兽', '坎伯兰', '哈曼', '迪凯纳', '纳尔逊', '罗德尼', '夕张', '海伦娜', '厌战', '约克城', '龙骧', '爱丁堡', '暴怒', '索玛雷兹', '卡米契亚·内拉', '扎拉', '初月', '哥伦比亚', '留里克', '七省联盟', '马伊·布雷泽', '托戈', '阿拉斯加', '关岛', '天狼星', '空想', '贝尔法斯特', '诺夫哥罗德',
}

maps['8-1']['5'] = {
    '吸血鬼', '海达人', '突击者', '大黄蜂', 'U-81', 'U-156', '巴夫勒尔', '忠武', '胡德', '大淀', '鲃鱼', '彼得·施特拉塞尔',
}

maps['8-2'] = { }

maps['8-2']['1'] = {
    'Z21', '哥萨克人', '爱斯基摩人', '旁遮普人', '柯尼斯堡', '卡尔斯鲁厄', '科隆',
}

maps['8-2']['2'] = {
    '睦月', 'Z24', 'Z28', '埃姆登', '声望', '兰利', '希佩尔海军上将', '布吕歇尔(重巡洋舰)', '布鲁克林', '罗伯茨', '阿贝克隆比', '古鹰', '加古', '青叶', '衣笠', '摩尔曼斯克', '圣地亚哥', '阿维埃尔', '恩格斯',
}

maps['8-2']['3'] = {
    'Z16', '军团', '山城', '内华达', '昆西', '亚特兰大', '朱诺(CL-52)', 'Z31', '田纳西', '博格', '德意志(装甲舰)', '舍尔海军上将', '波特兰', '新奥尔良', '圣胡安', '热心', '阿卡司塔', '维纳斯', 'M1', '白露', '村雨', 'M2', '埃德加·居内', '堪培拉', '科顿艾尔', '罗德尼', '威奇塔', '马里兰', '西弗吉尼亚', '格奈森瑙', '斯佩伯爵海军上将', '古斯塔夫五世', '吞武里', '时雨', '夕立', '岚', '哥特雄狮', '斯普利特', '乔治莱格', '史密斯', '波士顿', '萨里',
}

maps['8-2']['4'] = {
    '翡翠', '进取', '俄克拉荷马', '反击', '皇家橡树', '巨像', '独角兽', '勇敢', '光荣(大型轻巡洋舰)', '萨福克', '约克', '埃克赛特', '吸血鬼', '圣女贞德', '哈曼', '迪凯纳', '夕张', '海伦娜', '平海', '厌战', '约克城', '龙骧', '印第安纳波利斯', '卡米契亚·内拉', '安东尼奥·达诺利', '乌戈里尼·维瓦尔迪', 'U-47', '竞技神', '龙骑兵', '法迪布鲁诺', '留里克', '闪电', '凤凰城', '亨廷顿', '托戈', '胡德', '阿拉斯加', '关岛', '天狼星', '空想', '卡约·杜伊里奥', '大淀', '乔治·埃夫洛夫', '鹦鹉螺', '尼古拉斯', '诺夫哥罗德',
}

maps['8-2']['5'] = {
    '纳尔逊', '突击者', '沙恩霍斯特', '齐柏林伯爵', '索玛雷兹', 'U-81', 'U-156', '巴夫勒尔', '鹞鹰', '卫士', '欧根亲王', 'U-505', '鲃鱼',
}

maps['8-3'] = { }

maps['8-3']['1'] = {
    '林仙', '加拉蒂亚', '佩内洛珀', '奥马哈', '基阿特', '弗兰克·诺克斯', '鲍尔', '兰利', '曙光女神',
}

maps['8-3']['2'] = {
    '睦月', 'Z24', 'Z28', '埃姆登', '撒切尔', '沙利文', '西格斯比', '古鹰', '加古', '青叶', '衣笠', '摩尔曼斯克', '圣地亚哥', '阿维埃尔', '恩格斯',
}

maps['8-3']['3'] = {
    '基林', '山城', '昆西', '亚特兰大', '加利福尼亚', '普林斯顿', '波特兰', '彭萨科拉', '盐湖城', '休斯顿', '新奥尔良', 'M1', '奥克兰', '白露', '村雨', '阿贾克斯', '塔斯卡卢萨', '科顿艾尔', '威奇塔', '科罗拉多', '格奈森瑙', '吞武里', '时雨', '夕立', '岚', '哥特雄狮', '斯特雷特', '斯普利特', '乔治莱格', '波士顿', '萨里',
}

maps['8-3']['4'] = {
    '巨像', '独角兽', '光荣(大型轻巡洋舰)', '吸血鬼', '哈曼', '迪凯纳', '突击者', '列克星敦(CV-2)', '夕张', '约克城', '龙骧', '印第安纳波利斯', '暴怒', '拉菲(DD-459)', '卡米契亚·内拉', '诺福克(78)', '哥伦比亚', '奥斯塔公爵', '法迪布鲁诺', '加里波第', '凤凰城', '塞班', '马伊·布雷泽', '亨廷顿', '托戈', '阿拉斯加', '关岛', '天狼星', '贝尔法斯特', '大青花鱼', '大淀', '尼古拉斯', '诺夫哥罗德',
}

maps['8-3']['5'] = {
    '罗德尼', '大黄蜂', '飞龙', '苍龙', 'U-81', 'U-156', '胡德', '威廉·D·波特', 'U-505',
}

maps['8-4'] = { }

maps['8-4']['1'] = {
    '兰利', '晓', '响', '雷', '电',
}

maps['8-4']['2'] = {
    '睦月', 'Z24', 'Z28', '埃姆登', '五十铃', '古鹰', '加古', '青叶', '衣笠', '摩尔曼斯克', '圣地亚哥', '阿维埃尔', '恩格斯',
}

maps['8-4']['3'] = {
    '不知火', '黑潮', '山城', '声望', '反击', '高雄', '爱宕', '摩耶', '鸟海', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '田纳西', '加利福尼亚', '巨像', '普林斯顿', '德意志(装甲舰)', '舍尔海军上将', '波特兰', '彭萨科拉', '盐湖城', '休斯顿', '新奥尔良', '圣胡安', '阳炎', '飞鹰', '隼鹰', '奥克兰', '白露', '村雨', '阿贾克斯', '塔斯卡卢萨', '埃德加·居内', '科顿艾尔', '突击者', '格奈森瑙', '斯佩伯爵海军上将', '吞武里', '时雨', '夕立', '岚', '哥特雄狮', '斯特雷特', '斯普利特', '乔治莱格', '史密斯', '波士顿', '亨廷顿', '萨里',
}

maps['8-4']['4'] = {
    '罗伯茨', '阿贝克隆比', '光荣(大型轻巡洋舰)', 'M1', '约克', '埃克赛特', '吸血鬼', '哈曼', '迪凯纳', '墨尔波墨涅', '纳尔逊', '罗德尼', '夕张', '宁海', '平海', '科罗拉多', '马里兰', '西弗吉尼亚', '约克城', '龙骧', '印第安纳波利斯', '暴怒', 'U-47', '诺福克(78)', '哥伦比亚', '留里克', '七省联盟', '塞班', 'B65', '托戈', '霞飞', '胡德', '俾斯麦', '阿拉斯加', '关岛', '天狼星', '大青花鱼', '大淀', 'S-56', '鲃鱼', '彼得·施特拉塞尔', '尼古拉斯', '诺夫哥罗德',
}

maps['8-4']['5'] = {
    '约翰斯顿', '大黄蜂', '飞龙', '苍龙', 'U-81', 'U-156', '提尔比茨', '加贺', '岛风(岛风型驱逐舰)',
}

maps['8-5'] = { }

maps['8-5']['1'] = {
    '兰利',
}

maps['8-5']['2'] = {
    '睦月', 'Z24', 'Z28', '埃姆登', '古鹰', '加古', '青叶', '衣笠', '摩尔曼斯克', '圣地亚哥', '阿维埃尔', '恩格斯',
}

maps['8-5']['3'] = {
    '不知火', '黑潮', '声望', '反击', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '田纳西', '加利福尼亚', '巨像', '普林斯顿', '波特兰', '彭萨科拉', '休斯顿', '新奥尔良', '圣胡安', '阳炎', '飞鹰', '隼鹰', '奥克兰', '白露', '村雨', '埃德加·居内', '科顿艾尔', '马戈迪尼', '突击者', '格奈森瑙', '吞武里', '时雨', '夕立', '岚', '哥特雄狮', '斯特雷特', '斯普利特', '乔治莱格', '史密斯', '波士顿', '亨廷顿', '萨里',
}

maps['8-5']['4'] = {
    '山城', '罗伯茨', '阿贝克隆比', 'M1', '吸血鬼', '哈曼', '迪凯纳', '墨尔波墨涅', '纳尔逊', '罗德尼', '夕张', '宁海', '平海', '科罗拉多', '马里兰', '西弗吉尼亚', '约克城', '龙骧', '爱丁堡', 'U-47', '哥伦比亚', '留里克', '七省联盟', '塞班', 'B65', '托戈', '霞飞', '胡德', '俾斯麦', '阿拉斯加', '关岛', '天狼星', '贝尔法斯特', '大青花鱼', '大淀', 'S-56', '鲃鱼', '彼得·施特拉塞尔', '尼古拉斯',
}

maps['8-5']['5'] = {
    '约翰斯顿', '大黄蜂', '飞龙', '苍龙', 'U-81', 'U-156', '提尔比茨', '加贺', '岛风(岛风型驱逐舰)',
}

maps['9-1'] = { }

maps['9-1']['1'] = {
    '卡辛杨', '安东尼', '布雷恩', '基林', '基阿特', '弗兰克·诺克斯', '鲍尔', '埃姆登', '撒切尔', '沙利文', '西格斯比', '彭萨科拉', '波特', '拉菲(DD-724)', '拉菲(DD-459)',
}

maps['9-1']['2'] = {
    '奥马哈', 'Z24', 'Z28', '百眼巨人', '兰利', '昆西', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '波特兰', '盐湖城', '新奥尔良', '圣胡安', '摩尔曼斯克', '海达人', 'K1', '圣地亚哥', '阿维埃尔', '恩格斯', '乔治莱格', '波士顿',
}

maps['9-1']['3'] = {
    '内华达', '俄克拉荷马', '田纳西', '加利福尼亚', '博格', '巨像', '普林斯顿', '奥克兰', '白露', '村雨', '瓜达卡纳尔', '科顿艾尔', '马戈迪尼', '墨尔波墨涅', '突击者', '威奇塔', '海伦娜', '科罗拉多', '马里兰', '西弗吉尼亚', '格奈森瑙', '阿尔及利亚', '吞武里', '时雨', '夕立', '岚', '库欣', '哥特雄狮', '波尔扎诺', '斯维尔德洛夫', '克莱夫勋爵', 'S113', '萨里', '欧根亲王', 'M计划', '卡约·杜伊里奥', '雷鸣', '鲃鱼', '尼古拉斯', '诺夫哥罗德',
}

maps['9-1']['4'] = {
    '应瑞', '爱丽', '列克星敦(CV-2)', '约克城', '印第安纳波利斯', 'U-47', '黄蜂', '霞飞', '阿拉斯加', '关岛', '约克公爵', '敦刻尔克', '斯特拉斯堡', '英王乔治五世', '毛奇', '塞德利茨',
}

maps['9-1']['5'] = {
    '肇和', '大黄蜂', 'U-81', '马萨诸塞',
}

maps['9-2'] = { }

maps['9-2']['1'] = {
    '撒切尔', '沙利文', '西格斯比', '波特', '拉菲(DD-724)', '拉菲(DD-459)',
}

maps['9-2']['2'] = {
    '卡辛杨', '安东尼', '布雷恩', '林仙', '加拉蒂亚', '佩内洛珀', '紫石英', '基林', '基阿特', '弗兰克·诺克斯', '鲍尔', '百眼巨人', '兰利', '曙光女神', '波特兰', '彭萨科拉', '圣胡安', '海达人', 'K1', '圣地亚哥', '乔治莱格', '波士顿',
}

maps['9-2']['3'] = {
    '奥马哈', '吹雪', '内华达', '俄克拉荷马', '昆西', '亚特兰大', '朱诺(CL-52)', '布鲁克林', '田纳西', '加利福尼亚', '博格', '巨像', '普林斯顿', '盐湖城', '休斯顿', '新奥尔良', '飞鹰', '隼鹰', '约克', '奥克兰', '白露', '村雨', '瓜达卡纳尔', '科顿艾尔', '马戈迪尼', '墨尔波墨涅', '突击者', '威奇塔', '海伦娜', '科罗拉多', '马里兰', '西弗吉尼亚', '阿尔及利亚', '吞武里', '时雨', '夕立', '岚', '库欣', '哥特雄狮', '明斯克', '波尔扎诺', '斯维尔德洛夫', '克莱夫勋爵', '萨里', '本明', '胡德', '俾斯麦', '提尔比茨', '卡约·杜伊里奥', '埃塞克斯', '雷鸣', '鲃鱼', '尼古拉斯', '诺夫哥罗德',
}

maps['9-2']['4'] = {
    '应瑞', '爱丽', '列克星敦(CV-2)', '厌战', '约克城', '印第安纳波利斯', 'U-47', '黄蜂', '霞飞', '阿拉斯加', '关岛', '前卫', '华盛顿', '奥班农', '威廉·D·波特', '约克公爵', '敦刻尔克', '斯特拉斯堡', '英王乔治五世', '毛奇', '塞德利茨',
}

maps['9-2']['5'] = {
    '肇和', '大黄蜂', 'U-81', '马萨诸塞',
}

maps['9-3'] = { }

maps['9-3']['1'] = {
    '波特',
}

maps['9-3']['2'] = {
    'Z1', '川内', '神通', '那珂', '德·鲁伊特', '秋月', '凉月', '罗伯茨', '阿贝克隆比', '北安普顿', '新奥尔良', 'Z3', '宁海', '平海', '圣地亚哥', '克莱夫勋爵', 'M计划',
}

maps['9-3']['3'] = {
    '进取', '田纳西', '古鹰', '加古', '青叶', '衣笠', '伦敦', '肯特', '絮库夫', '伊丽莎白女王', '飞鹰', '隼鹰', '莱比锡', '白露', '村雨', '吸血鬼', '塞尔弗里奇', '妙高', '加纳里亚斯', '门德斯·努涅斯', '天雾', '德里', '冬月', '迪凯纳', '爱丁堡', '安东尼奥·达诺利', '竞技神', '三隈', '熊野', '克利夫兰', '时雨', '夕立', '岚', '哥特雄狮', '鹞鹰', '斯特雷特', '奥古斯塔', '龙骑兵', '江原', '阿尔贝托·迪·朱桑诺', '天津风', '库图佐夫', '阿布鲁奇公爵', '黛朵', '亚尔古水手', '萨凡纳', '燕八哥', '蒂默曼', '阿贺野', '红色高加索', '本明', '塔什干', 'U-505', '约克公爵', '瑞鹤', '翔鹤', '埃塞克斯', '英王乔治五世', '蒙彼利埃', '联合力量', '塞德利茨', '印第安纳', '查尔斯·奥斯本', '泰勒', '可怖', '兴登堡', '莫斯科',
}

maps['9-3']['4'] = {
    '翡翠', '独角兽', '印第安纳波利斯', '贝尔法斯特',
}

maps['9-3']['5'] = { }

maps['9-4'] = { }

maps['9-4']['1'] = { }

maps['9-4']['2'] = {
    'Z1', '川内', '神通', '那珂', '德·鲁伊特', '秋月', '凉月', '罗伯茨', '北安普顿', '新奥尔良', 'Z3', '圣地亚哥', 'M计划',
}

maps['9-4']['3'] = {
    '进取', '田纳西', '古鹰', '加古', '衣笠', '伦敦', '肯特', '伊丽莎白女王', '飞鹰', '隼鹰', '白露', '村雨', '吸血鬼', '塞尔弗里奇', '妙高', '加纳里亚斯', '门德斯·努涅斯', '天雾', '德里', '冬月', '特伦托', '爱丁堡', '安东尼奥·达诺利', '竞技神', '三隈', '熊野', '克利夫兰', '时雨', '岚', '鹞鹰', '斯特雷特', '奥古斯塔', '龙骑兵', '江原', '阿尔贝托·迪·朱桑诺', '天津风', '库图佐夫', '黛朵', '亚尔古水手', '萨凡纳', '燕八哥', '阿贺野', '塔什干', 'U-505', '瑞鹤', '翔鹤', '埃塞克斯', '英王乔治五世', '蒙彼利埃', '联合力量', '塞德利茨', '印第安纳', '查尔斯·奥斯本', '泰勒', '可怖', '兴登堡', '莫斯科',
}

maps['9-4']['4'] = { }

maps['9-4']['5'] = { }

maps['决战E1、E2'] = { }

maps['决战E1、E2']['1'] = {
	"马里兰", "西弗吉尼亚", "勇敢", "声望", "榛名", "雾岛", "肯特", "波特兰", "塔斯卡卢萨", "燕八哥", "库欣", "马汉", "哈尔福德", "竹", "波特", "萤火虫", "紫石英", "绫波", "吹雪", "K1", "暴怒"
}

maps['决战E1、E2']['2'] = { }
maps['决战E1、E2']['3'] = { }
maps['决战E1、E2']['4'] = { }
maps['决战E1、E2']['5'] = { }

maps['决战E3、E4'] = { }

maps['决战E3、E4']['1'] = {
	"陆奥", "光荣(大型轻巡洋舰)", "追赶者", "神鹰", "突击者", "萨里", "波尔扎诺", "诺福克(78)", "坎伯兰", "羽黑", "欧根亲王", "旧金山", "最上", "萨福克", "奥斯塔公爵", "阿尔贝托·迪·朱桑诺", "凤凰城", "圣路易斯", "逸仙", "基洛夫", "奥克兰", "埃姆登", "乌戈里尼·维瓦尔迪", "卡米契亚·内拉", "塔什干", "克拉克斯顿", "戴森", "康弗斯", "蔚山", "查尔斯·亚当斯", "U-47", "法迪布鲁诺", "絮库夫", "哥特兰"	
}

maps['决战E3、E4']['2'] = { }
maps['决战E3、E4']['3'] = { }
maps['决战E3、E4']['4'] = { }
maps['决战E3、E4']['5'] = { }

maps['决战E5'] = { }

maps['决战E5']['1'] = {
	"阿金库尔", "俾斯麦", "敦刻尔克", "斯特拉斯堡", "提尔比茨", "长门", "卡约·杜伊里奥", "沙恩霍斯特", "帝国", "赤城", "加贺", "翔鹤", "瑞鹤", "列克星敦(CV-2)", "萨拉托加", "光辉", "不挠(装甲航母)", "天鹰", "大凤", "莫斯科", "巴尔的摩", "彼得罗巴甫洛夫斯克", "海王星", "德格拉斯", "伟大的庞贝", "伍斯特", "巴夫勒尔", "空想", "阿尔维塞·达·摩斯托", "雪风", "早春", "基辅", "奥班农", "鞍山"
}

maps['决战E5']['2'] = { }
maps['决战E5']['3'] = { }
maps['决战E5']['4'] = { }
maps['决战E5']['5'] = { }

maps['决战E6'] = { }

maps['决战E6']['1'] = {
	"狮(战列舰)", "前卫", "黎塞留", "兴登堡", "维内托", "新泽西", "北卡罗来纳", "华盛顿", "南达科他(BB-57)", "马萨诸塞", "密苏里", "星座", "皇家方舟(91)", "齐柏林伯爵", "约克城", "企业", "大黄蜂", "埃塞克斯", "列克星敦(CV-16)", "72工程", "可畏", "怨仇", "纽波特纽斯", "虎", "大淀", "巴夫勒尔", "U-96", "U-156", "鹦鹉螺"
}

maps['决战E6']['2'] = { }
maps['决战E6']['3'] = { }
maps['决战E6']['4'] = { }
maps['决战E6']['5'] = { }

return { maps=maps }